{"title":"Fear and Desire","uid":6937292,"size":934368201,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00ecbdf4bce71d67ba8351526c2976bbd5606e36&amp;dn=Fear+and+Desire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1325871523,"description":"Reseed of Stanley Kubrick's first feature film, released in 1953. Nearly as pretentious as it is precocious, the film was disowned by Kubrick as an instructive but amateur piece and he is said to have attempted to destroy all remaining copies. However, only a few prints were struck of the film in the first place and most of those had been destroyed or disappeared by the time he began a recognized talent. Two from defunct distributor Joseph Burstyn's film exchange wound up in the George Eastman film collection, however, in the late 1950s. From these a &quot;restored&quot; print was created in 2011 and shown on TCM in December 2011. Although Kubrick had been a professional still photographer for Look magazine and had made three short films, this maiden feature effort, which Kubrick directed, cowrote, shot and edited, is of dubious merit. Still it was written by Howard Sackler, who would go on to win a Pultizer Prize (for &quot;The Great White Hope&quot;) and would also do the script for Kubrick's second film, &quot;Killer's Kiss.&quot; It shows Kubrick learning on the job and creating effects he would use later in classics like &quot;Strangelove.&quot; Also, it's Kubrick's film film on war, a subject that would figure in most of his later pictures.","torrent":{"xt":"urn:btih:00ecbdf4bce71d67ba8351526c2976bbd5606e36","amp;dn":"Fear+and+Desire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ecbdf4bce71d67ba8351526c2976bbd5606e36","infoHashBuffer":{"type":"Buffer","data":[0,236,189,244,188,231,29,103,186,131,81,82,108,41,118,187,213,96,110,54]},"announce":[],"urlList":[]}}