{"title":"Pink - I'm Not Dead (FLAC)","uid":6051280,"size":463375953,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:01272249e787b2d92fdc52c8045203f686537b44&amp;dn=Pink+-+I%5C%27m+Not+Dead+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piratetorrent1989","files":-1,"time":1292744155,"description":"I'm Not Dead is the fourth studio album by American recording artist Pink. The album was released on April 4, 2006 in the USA, to coincide the release of Pink's debut album, Can't Take Me Home, which was released six years prior, to receive remarkable chart success with its singles and sales. The album, originally titled Long Way To Happy, track 3 on the album, and scheduled for a September, 2005 release, explores Pop rock music and speaks about social and political issues on one hand, to switch to personal and vulnerable subjects on the other.\n\nI'm Not Dead was preceded by its controversial lead single, &quot;Stupid Girls,&quot; which reached the Top 20 on the Billboard Hot 100, peaking at #13, and its music video, directed by Dave Meyers, received a VMA for Best Pop Video.\n\nThe album's second and third singles, &quot;Who Knew&quot; and &quot;U + Ur Hand,&quot; both peaked at #9 on the Hot 100 and collected over one million sold units each, receiving Platinum certifications from RIAA, thus re-energizing Pink's career in the USA and pulling their host album back to Billboard charts, after months of battling with poor sales issues. Songs like &quot;Nobody Knows&quot;, &quot;Leave Me Alone (I'm Lonely)&quot;, &quot;Dear Mr. President&quot; and &quot;'Cuz I Can&quot; became regional singles and followed the success of the first three singles, without any remarkable chart performance.\n\nThe album marks Pink's comeback after the poor commercial and critical success of her previous album, Try This. It went Platinum in several regions including USA, Canada and France and scored a head-turning success in Australia, where it went 11x Platinum and spawned five Top 5 hits on the ARIA Singles Chart. Worlwide sales are estimated to exceed six and half million units in early 2010. The album was re-released as I'm Not Dead - Platinum Edition, with bonus tracks, remixes and a DVD.","torrent":{"xt":"urn:btih:01272249e787b2d92fdc52c8045203f686537b44","amp;dn":"Pink+-+I%5C%27m+Not+Dead+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01272249e787b2d92fdc52c8045203f686537b44","infoHashBuffer":{"type":"Buffer","data":[1,39,34,73,231,135,178,217,47,220,82,200,4,82,3,246,134,83,123,68]},"announce":[],"urlList":[]}}