{"title":"Monte Carlo Techniques in Radiation Therapy (2013).pdf Gooner","uid":13175503,"size":7442643,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:015d2a0768b30bf5e8a1453d8aabf219c3005083&amp;dn=Monte+Carlo+Techniques+in+Radiation+Therapy+%282013%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452283351,"description":"Monte Carlo Techniques in Radiation Therapy - 1st Edition (2013).pdf Gooner\r\n\r\nPublisher: CRC Press; 1 edition (March 25, 2013)\r\nLanguage: English\r\nISBN-10: 1466507926\r\nISBN-13: 978-1466507920\r\n\r\nModern cancer treatment relies on Monte Carlo simulations to help radiotherapists and clinical physicists better understand and compute radiation dose from imaging devices as well as exploit four-dimensional imaging data. With Monte Carlo-based treatment planning tools now available from commercial vendors, a complete transition to Monte Carlo-based dose calculation methods in radiotherapy could likely take place in the next decade. Monte Carlo Techniques in Radiation Therapy explores the use of Monte Carlo methods for modeling various features of internal and external radiation sources, including light ion beams.\r\n\r\nThe book―the first of its kind―addresses applications of the Monte Carlo particle transport simulation technique in radiation therapy, mainly focusing on external beam radiotherapy and brachytherapy. It presents the mathematical and technical aspects of the methods in particle transport simulations. The book also discusses the modeling of medical linacs and other irradiation devices; issues specific to electron, photon, and proton ion beams and brachytherapy; and the optimization of treatment planning, radiation dosimetry, and quality assurance.\r\n\r\nUseful to clinical physicists, graduate students, and researchers, this book provides a detailed, state-of-the-art guide to the fundamentals, application, and customization of Monte Carlo techniques in radiotherapy. Through real-world examples, it illustrates the use of Monte Carlo modeling and simulations in dose calculation, beam delivery, kilovoltage and megavoltage imaging, proton radiography, device design, and much more","torrent":{"xt":"urn:btih:015d2a0768b30bf5e8a1453d8aabf219c3005083","amp;dn":"Monte+Carlo+Techniques+in+Radiation+Therapy+%282013%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015d2a0768b30bf5e8a1453d8aabf219c3005083","infoHashBuffer":{"type":"Buffer","data":[1,93,42,7,104,179,11,245,232,161,69,61,138,171,242,25,195,0,80,131]},"announce":[],"urlList":[]}}