{"title":"Nanocrystalline Apatite-Based Biomaterials - D. Eichert et al.","uid":15520721,"size":1324139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0177b8b53a50e082ae79c00686f61bb27bb5dc65&amp;dn=Nanocrystalline+Apatite-Based+Biomaterials+-+D.+Eichert+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470748859,"description":"Nanocrystalline Apatite-Based Biomaterials - D. Eichert et al. (Nova, 2009).pdf\r\n\r\nThe improvement of the biological activity and performance of bone substitute materials is one of the main concerns of orthopaedic and dental surgery specialists. Biomimetic nanocrystalline apatites exhibit enhanced and tunable reactivity as well as original surface properties related to their composition and mode of formation. Synthetic nanocrystalline apatites analogous to bone mineral can be easily prepared in aqueous media and one of their most interesting characteristics is the existence of a hydrated surface layer containing labile ionic species. Ion exchange and macromolecule adsorption processes can easily and rapidly take place due to strong interactions with the surrounding fluids. The ion mobility in the hydrated layer allows direct crystal-crystal or crystal-substrate bonding. The fine characterization of these very reactive nanocrystals is essential and can be accomplished with different tools including chemical analysis and spectroscopic techniques such as FTIR, Raman and solid state NMR. The reactivity of the hydrated layer of apatite nanocrystals offers material scientists and medical engineers extensive possibilities for the design of biomaterials with improved bioactivity using unconventional processing. Indeed apatitic biomaterials can be processed at low temperature which preserves their surface reactivity and biological properties. They can also be associated in various ways with active molecules and/or ions. Several examples of use and processing of nanocrystalline apatites involved in the preparation of tissue-engineered biomaterials, cements, ceramics, composites and coatings on metal prostheses are presented","torrent":{"xt":"urn:btih:0177b8b53a50e082ae79c00686f61bb27bb5dc65","amp;dn":"Nanocrystalline+Apatite-Based+Biomaterials+-+D.+Eichert+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0177b8b53a50e082ae79c00686f61bb27bb5dc65","infoHashBuffer":{"type":"Buffer","data":[1,119,184,181,58,80,224,130,174,121,192,6,134,246,27,178,123,181,220,101]},"announce":[],"urlList":[]}}