{"title":"Madeleine L'Engle 5 of 5 - An Acceptable Time [1989]","uid":8289230,"size":838131956,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:01cebdb8136e1443fd08205c207963b2a96ea109&amp;dn=Madeleine+L%27Engle+5+of+5+-+An+Acceptable+Time+%5B1989%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1364002650,"description":"Unabridged. 192 kbps\nRead by Ann Marie Lee. \nPublished by: Listening Library\nSplit in 8 Cds.\n\nA flash of lightning, quivering ground, and, instead of her grandparents' farm, Polly sees mist and jagged mountains -- and coming toward her, a group of young men carrying spears.\n\nWhy has a time gate opened and dropped Polly into a world that existed 3,000 years ago? Will she be able to get back to the present before the time gate closes -- and leaves her to face a group of people who believe in human sacrifice?\n\nAmazon.com Review\n\nFor this time-slip novel, L'Engle again reaches into her bag of weird and wonderful knowledge, blending snippets of tantalizing information from a variety of disciplines--history, natural history, physics and Christian metaphysics, to name a few--into a rich and heady brew. Red-haired Polly O'Keefe (last seen in A House Like a Lotus ) arrives at her grandparents' farm in Connecticut for some private tutoring. There, in a landscape familiar to L'Engle fans (who will be pleased to know that the Nobel Prize-winning Mrs. Murry still cooks over a Bunsen burner), Polly slips back 3000 years into a different time &quot;spiral.&quot; She meets Anaral, a Native American girl; Karralys, a druid banished from Britain for his progressive thinking; and Tav, a handsome warrior who accompanied the druid to their new land. Polly travels back and forth between the two worlds, and eventually her purpose becomes clear: with the aid of her new friends she forges peace between two clashing tribes, and helps Zachary Gray (also from A House Like a Lotus ), a self-centered but very ill young man. The story is laced together with L'Engle's now-familiar theme of the transcendent importance of love. This fine fantasy, firmly rooted in reality, is the kind of thoughtful story at which L'Engle excels.\n\nThis is the last book in the Time Quartet series by Madeleine L'Engle.\n\n","torrent":{"xt":"urn:btih:01cebdb8136e1443fd08205c207963b2a96ea109","amp;dn":"Madeleine+L%27Engle+5+of+5+-+An+Acceptable+Time+%5B1989%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cebdb8136e1443fd08205c207963b2a96ea109","infoHashBuffer":{"type":"Buffer","data":[1,206,189,184,19,110,20,67,253,8,32,92,32,121,99,178,169,110,161,9]},"announce":[],"urlList":[]}}