{"title":"Pusher (Nicolas Winding Refn, 1996)","uid":6744271,"size":733435871,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01dedaa74edf826409225a75741989f21a367145&amp;dn=Pusher+%28Nicolas+Winding+Refn%2C+1996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ceronte","files":2,"time":1318623332,"description":"Pusher (1996)\n# Actors: Kim Bodnia, Zlatko Buric, Laura DrasbÃƒÆ’|k, Slavko Labovic, Mads Mikkelsen\n# Director: Nicolas Winding Refn\n\nFrank and Tonny are foul-mouthed, small-time drug dealers who constantly (and comically) brag about their squalid sexual exploits. But when a drug deal goes bad and Frank is arrested then released for lack of evidence, he finds himself in deep debt with a ruthless Yugoslav dealer who wants his money now. Frank, believing he's been betrayed by Tonny, takes revenge, making one desperate ploy after another as his life spirals into a nightmare of bad choices. Though clearly influenced by recent hipster movies such as Trainspotting and Pulp Fiction, a truer ancestor to Pusher is Martin Scorsese's Mean Streets. Pusher is brutally realistic and rigorously unsentimental--there are no flashy camera tricks. The movie takes into account the occasional moment of gentleness in Frank's troubled relationship with a prostitute but doesn't use that to exonerate him. And yet, despite everything, Frank is sympathetic simply because he's human. The performances are excellent, the editing sharp and propulsive, the violence is spare but extremely effective. Pusher slowly draws its net tighter and tighter, until every moment seems charged with menace. --Bret Fetzer ","torrent":{"xt":"urn:btih:01dedaa74edf826409225a75741989f21a367145","amp;dn":"Pusher+%28Nicolas+Winding+Refn%2C+1996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01dedaa74edf826409225a75741989f21a367145","infoHashBuffer":{"type":"Buffer","data":[1,222,218,167,78,223,130,100,9,34,90,117,116,25,137,242,26,54,113,69]},"announce":[],"urlList":[]}}