{"title":"Zarathandra 1&amp;2 By Donald Aamodt (EPUB MOBI AZW3 PDF)","uid":10811084,"size":5304072,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02041eb6b3eb737af65799c526416190a1ed0584&amp;dn=Zarathandra+1%26amp%3B2+By+Donald+Aamodt+%28EPUB+MOBI+AZW3+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":12,"time":1408428821,"description":"A NAME TO COJURE WITH\nSandy MacGregor never asked to become a demon. But when a shifty sorcerer conjured him to the mystic realm of Zarathandra, he didn't have much choice. And in this world of high treachery and low wizardry, Sandy is nothing less than magical.\n\nIt seems that he's been drafted across space and time into a sorcerer's private army-along with a madman, a mute and a lethargic giant-to plunder the treasure-hoard of an evil god. Sandy is more than just conjure-fodder, though. He's the sorcerer's secret weapon. For in this world, the mere mention of his name can loose the very fires of Hell and scorch the gods themselves!\n\n\nA TROUBLING ALONG THE BORDER\nSandy MacGregor doesn't want to be a hero. He has been unwillingly transported through time and space to the planet Zarathandra. He is being used for selfish purposes by a power hungry Goddess. He's stuck on the Rithian border where a rebellion brewing for centuries is about to explode in his face. And now, accompanied by an ancient desert scout and a bumbling sorcerer whose magic does more harm than good, he must journey to a dread region between the worlds to confront the evil usurper behind the realm-shattering revolt. Sandy would certainly prefer a destiny that was considerably less dangerous...but that's life","torrent":{"xt":"urn:btih:02041eb6b3eb737af65799c526416190a1ed0584","amp;dn":"Zarathandra+1%26amp%3B2+By+Donald+Aamodt+%28EPUB+MOBI+AZW3+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02041eb6b3eb737af65799c526416190a1ed0584","infoHashBuffer":{"type":"Buffer","data":[2,4,30,182,179,235,115,122,246,87,153,197,38,65,97,144,161,237,5,132]},"announce":[],"urlList":[]}}