{"title":"Under The Dome Episode 7 (720p)","uid":10726352,"size":328061552,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:02eabc1f133477f88e083e44922aa3c214516418&amp;dn=Under+The+Dome+Episode+7+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407567245,"description":"Feeling threatened that he is losing his authority, Big Jim takes matters into his own hands. Meanwhile, the dome asserts its actions after a newborn's birth. Julia's friend, Harriet, touches the dome and goes into labor so Julia takes her to the hospital. But on their way, they are gas-jacked by the two Dundee brothers who killed Rose, but Barbie arrives and the two flee. Barbie then takes the woman in labor to Alice to help them. While that's happening, Junior and Big Jim argue about Junior disturbing Angie and Jim forces Junior out of his house. Angie then decides to go see Rose and runs into Joe's friend and both fix the diner. Junior goes to the police station and comes with Linda to find the two murderers. Junior realizes that they are at an abandoned house and gets told by Linda that one of them almost raped Angie. Linda kills one of the brothers during a fight. Junior kills the other for the attempted murder when he tries to escape. Elsewhere, Ollie threatens Big Jim. Big Jim then checks on the city's stockpiled propane; however, he is stopped by an armed thug. But at night, while the thug tries to take a truck full of propane, Jim shoots it and it explodes, killing the thug. Joe and Norrie try to find the center of the dome, finding a second mini-dome that holds a mysterious egg in it. After touching it, Norrie and Joe see her mother Alice and Norrie runs off to find her. Back at Joe's house the baby is born and named 'Alice' out of gratitude for her help. The original Alice then has a heart attack (due to insufficient insulin) and dies in Norrie's arms. Joe and Angie reunite. But in the mini-dome, the egg's shell begins to light up, with many pink-colored lights on the surface of the egg traveling from the bottom to the top of the egg.","torrent":{"xt":"urn:btih:02eabc1f133477f88e083e44922aa3c214516418","amp;dn":"Under+The+Dome+Episode+7+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02eabc1f133477f88e083e44922aa3c214516418","infoHashBuffer":{"type":"Buffer","data":[2,234,188,31,19,52,119,248,142,8,62,68,146,42,163,194,20,81,100,24]},"announce":[],"urlList":[]}}