{"title":"El verano del ingles [ebook].","uid":6024140,"size":840044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:032a070ff0a072f24ea7fc3588b29626fc83a8bc&amp;dn=El+verano+del+ingles+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1291883947,"description":"La escritora Carme Riera (Palma de Mallorca, 1948), como tantas otras personas de su generaciÃƒÂ³n, tuvo que aprender de adulta la lengua franca de nuestra ÃƒÂ©poca, el inglÃƒÂ©s. Lo mismo le sucede a la protagonista de su nueva novela, El verano del inglÃƒÂ©s (Alfaguara en castellano, Proa en catalÃƒÂ¡n), una obra breve calificada de &quot;divertimiento&quot; por la autora y que supone su irÃƒÂ³nica incursiÃƒÂ³n en el gÃƒÂ©nero de terror.\n\n&quot;Es mi novela mÃƒÂ¡s contemporÃƒÂ¡nea. No he necesitado documentarme, una tarea imprescindible cuando escribo una novela histÃƒÂ³rica. En esta ocasiÃƒÂ³n, tampoco trato temas recurrentes en mi narrativa, como la identidad o la memoria colectiva&quot;, explicÃƒÂ³ Riera en la presentaciÃƒÂ³n del libro.\n\n\nTodo comienza con una decisiÃƒÂ³n, en apariencia, inocente. Laura Prats, la heroÃƒÂ­na de la novela, opta por suspender un viaje de ocio a PerÃƒÂº para encarar su asignatura pendiente. El afÃƒÂ¡n de Laura de medrar en la empresa inmobiliaria donde trabaja acaba siempre frustrado por el poco dominio que tiene del idioma de Shakespeare. La ÃƒÂºnica manera que se le ocurre para superar esta laguna crÃƒÂ³nica consiste en desplazarse a Londres y realizar allÃƒÂ­ un curso intensivo. Por Internet, encuentra a una nativa dispuesta a darle clases, Mrs. Grose. Lo que preveÃƒÂ­a como un mes de agosto placentero y productivo se convertirÃƒÂ¡ finalmente en una pesadilla, porque su maestra es una autÃƒÂ©ntica sÃƒÂ¡dica.\n\n \n\n&quot;He escrito esta novela con un lenguaje sencillo. EstÃƒÂ¡ narrada en primera persona por una mujer a la que no le gustan los libros. Es un registro muy funcional&quot;, apuntÃƒÂ³ Riera. A pesar del poco apego de la protagonista por la literatura, en El verano del inglÃƒÂ©s se acumulan las evocaciones novelescas. La morada de la iracunda anfitriona, en la que parecen campar a sus anchas varios fantasmas, estÃƒÂ¡ rodeada por paisajes tÃƒÂ­picos de Henry James y otros literatos especialistas en poner los pelos de punta al lector. Su arquitectura victoriana recuerda ademÃƒÂ¡s a las mansiones cinematogrÃƒÂ¡ficas de Rebeca o de Psicosis.\n\n \n\nLa propia escritora sabe bien quÃƒÂ© es vivir en un sitio asÃƒÂ­ durante un tiempo. En una de sus estancias como profesora visitante en el extranjero, recalÃƒÂ³ en una universidad estadounidense sita en la regiÃƒÂ³n de Nueva Inglaterra. La casa en la que se hospedÃƒÂ³ tenÃƒÂ­a armarios de doble fondo y un sÃƒÂ³tano que provocaba pavor. &quot;Recientemente habÃƒÂ­an asesinado en el dormitorio a dos profesores siguiendo un juego de rol. PasÃƒÂ© mucho miedo&quot;.\n\nPara escribir la novela, la autora echÃƒÂ³ mano de otras experiencias personales, pero dÃƒÂ¡ndoles la vuelta: donde sÃƒÂ³lo habÃƒÂ­a cotidianidad, imaginÃƒÂ³ escenas pavorosas que matizÃƒÂ³ con sorna. &quot;Soy bastante irÃƒÂ³nica. No entiendo a la gente que se lo toma todo al pie de la letra. En esta novela podÃƒÂ­a dar rienda suelta a todas las animaladas que se me pasaban por la cabeza. Fue muy divertido&quot;, concluyÃƒÂ³ Riera.","torrent":{"xt":"urn:btih:032a070ff0a072f24ea7fc3588b29626fc83a8bc","amp;dn":"El+verano+del+ingles+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032a070ff0a072f24ea7fc3588b29626fc83a8bc","infoHashBuffer":{"type":"Buffer","data":[3,42,7,15,240,160,114,242,78,167,252,53,136,178,150,38,252,131,168,188]},"announce":[],"urlList":[]}}