{"title":"Sleigh Bells - Bitter Rivals [2013] [FLAC] [VINYL]","uid":9025227,"size":721262779,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:039a9fd16da0f729c6a9f82302405d762e1afa1f&amp;dn=Sleigh+Bells+-+Bitter+Rivals+%5B2013%5D+%5BFLAC%5D+%5BVINYL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1381358819,"description":"Sleigh Bells - Bitter Rivals [2013] [FLAC] [VINYL]\n\nReleased ................ 2013\nSource .................. VINYL\nGenre ................... Pop/Rock\nStyle ................... Noise Pop, Alternative\nCodec ................... FLAC\nBit Depth ............... 24 bits\nSampling Rate ........... 96 KHz\n\n01 - Bitter Rivals\n02 - Sugarcane\n03 - Minnie\n04 - Sing Like A Wire\n05 - Young Legends\n06 - Tiger Kit\n07 - You Don't Get Me Twice\n08 - To Hell With You\n09 - 24\n10 - Love Sick\n\nOver the course of the three albums Sleigh Bells cranked out between 2010 and 2013, the pop and noise elements in their music didn't always play nicely together; 2012's Reign of Terror had almost as many frustrating moments as inspired ones. Album titles like that one and Bitter Rivals hint at the inherent tension in the duo's sound, but Derek Miller and Alexis Krauss take a more holistic approach to blending and balancing with these songs. For such a flamboyantly loud band, the tweaks they make are surprisingly subtle: Bitter Rivals' mix of Sunset Strip riffs, teeny bopper vocals, and crashing beats isn't as punishingly dense as it was on Reign of Terror, and its heavy and sweet sides work together instead of competing for attention. Songs like &quot;Sugarcane&quot; and &quot;Young Legends&quot; allow the melodies -- and Krauss' voice in particular -- to take center stage and act as the glue for louder and wilder parts. Meanwhile, &quot;Love Sick&quot;'s slow, dreamy chorus evokes Treats' prettier moments, and the sweet love song &quot;To Hell with You&quot; shows that Sleigh Bells still have the ability to surprise. Of course, the duo still crosses the fine line between bold and bratty as hard and as often as their sound goes into the red: &quot;Minnie&quot;'s acidly sweet chorus (&quot;Go count your pennies/I'm sorry to say you don't have any&quot;) sounds like a catty nursery rhyme and stings like a mean girl's burn book. Bitter Rivals was written and recorded quickly, and sometimes feels a little underdone -- there isn't much to the title track except its admittedly catchy refrain, for example. Still, the album's shorter, lighter approach suits Krauss and Miller, and its best moments allow them to find more levels of expression in a sound that could easily wear out its welcome. Sleigh Bells' studies in contrasts aren't shocking anymore, but the fact that they sound more natural on Bitter Rivals makes this some of their most enjoyable music since Treats.\n &lt;a href=&quot;\nhttp://i.imgur.com/S0PHgV1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/S0PHgV1.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:039a9fd16da0f729c6a9f82302405d762e1afa1f","amp;dn":"Sleigh+Bells+-+Bitter+Rivals+%5B2013%5D+%5BFLAC%5D+%5BVINYL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"039a9fd16da0f729c6a9f82302405d762e1afa1f","infoHashBuffer":{"type":"Buffer","data":[3,154,159,209,109,160,247,41,198,169,248,35,2,64,93,118,46,26,250,31]},"announce":[],"urlList":[]}}