{"title":"Australia with Simon Reeve  (BBC 2013 - Complete Series)","uid":8722640,"size":1517777109,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:04b4cf2794342a79ddf471a3e82e7293b8c12d56&amp;dn=Australia+with+Simon+Reeve++%28BBC+2013+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":11,"time":1374449050,"description":"TRAVEL: Australia with Simon Reeve\nOn: BBC 2    \nDate: Sunday 19th May 2013 (Already shown)\nTime: 21:00 to 22:00 (1 hour long)\n\nSimon Reeve explores Australia. His adventure starts in the 'red centre' of the continent and onwards through South Australia via the extraordinary Indian Pacific Railway, until he reaches the west coast city of Perth. On the way, he joins an Aussie rancher in the parched outback and takes part in a spectacular camel round-up - part of an ongoing effort to stop the damaging spread of feral camels across the country. Simon also passes through Australia's wine country and to the lucrative tuna fishing city of Port Lincoln, and he investigates the impact these trades are having on the environment. In Western Australia, he joins a 21st century gold rush - part of the resource boom that has made Australia one of the richest countries in the world. Finally in Perth, Simon discovers a full scale British invasion. Working in a mine or driving a lorry can bring a salary of a hundred thousand pounds a year, as evidenced when Simon meets a former binman from hull who is now living the dream.\n\n\n\nTRAVEL: Australia with Simon Reeve\nOn: BBC 2    \nDate: Sunday 26th May 2013 (Already shown)\nTime: 21:30 to 22:30 (1 hour long)\n\nSimon travels from Darwin in Australia's Northern Territory or 'Top End', across to the remote Cape York Peninsula, and on to the Great Barrier Reef. Simon sets off from Kakadu, the largest national park in the world, where the wildlife is under threat from the march of millions of poisonous cane toads. He joins a team of toad-busters catching the amphibian invaders - originally introduced to the country to kill pests. In Robertson barracks Simon meets Australia's best - and only - tank regiment. They will soon host 6,000 American Marines - evidence of Australia's strategic importance in the Asia Pacific region. Simon also heads out on patrol with Norforce, a unique military unit who use ancient aboriginal knowledge to help them survive in the bush. On the Cape York peninsula Simon joins scientists catching deadly box jellyfish, whose venom could prove to have great medicinal value. And on the Great Barrier Reef he dives in search of the starfish destroying coral.\n\n\n\nTRAVEL: Australia with Simon Reeve\nOn: BBC 2    \nDate: Sunday 2nd June 2013 (Already shown)\nTime: 21:00 to 22:00 (1 hour long)\n\nSimon travels down the east coast of Australia to the magnificent cities of Sydney and Melbourne. The final part of his journey begins in Surfer's Paradise, near the city of Gold Coast. Known as the Las Vegas of Australia, the area has also become the organised crime capital of the country. Then, in the East Coast suburbs, Simon joins a vet and his team who rescue and treat injured koalas. In Sydney, Simon investigates attitudes to immigration among Australians. Finally, Simon takes to the air and witnesses the devastating bush fires ripping through the countryside as he travels to Melbourne - arriving just in time for Australia Day.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:04b4cf2794342a79ddf471a3e82e7293b8c12d56","amp;dn":"Australia+with+Simon+Reeve++%28BBC+2013+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04b4cf2794342a79ddf471a3e82e7293b8c12d56","infoHashBuffer":{"type":"Buffer","data":[4,180,207,39,148,52,42,121,221,244,113,163,232,46,114,147,184,193,45,86]},"announce":[],"urlList":[]}}