{"title":"Superman - Ending Battle 1-8 (2002) (hybrid) (DreamGirl-Novus-HD","uid":8774091,"size":321806759,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:04cd449eb7997207778645b1ab00a6118956771d&amp;dn=Superman+-+Ending+Battle+1-8+%282002%29+%28hybrid%29+%28DreamGirl-Novus-HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1375510884,"description":"English | CBZ | 8 Issues\n\nSuperman: Ending Battle #1-8 (Story Arc)\nPublisher:  DC Comics\nPublication Date:  September 4, 2002 - October 23, 2002\n\nWriters:  Geoff Johns, Joe Casey, Mark Schultz, and Joe Kelly\nPencillers:  Pasqual Ferry, Derec Aucoin, Brandon Badeaux, and Duncan Rouleau\nInkers:  Cam Smith, Derec Aucoin, Mark Morales, Marlo Alquiza, and Mark Farmer\nColorists:  Richard Horie, Tanya Horie, Rob Ro, Alex Bleyaert, and Moose Baumann\nLetterers:  Richard Starkings and Ken Lopez\nCover:  Pasqual Ferry, Cam Smith, Kevin Nowlan, Paul Neary, Carlos Pacheco, Jesus Merino, Dan Jurgens, Bill Sieniewicz, and Dexter Vines\n\nSuperman v2 #186\n&quot;Ending Battle&quot; part 1! When a revamped Master Jailer and Neutron attack the Capitol aiming for Pete Ross and Lana Lang, Superman must save his friends while uncovering clues to the mysterious mastermind behind it all.\n\nThe Adventures of Superman #608\n&quot;Ending Battle&quot; part 2! The inexplicable attacks on Superman's friends and family continue, as Atomic Skull arrives at the Kent farm. Meanwhile, a host of super-villains start attacking people associated with Clark's childhood in Smallville.\n\nSuperman: The Man of Steel #130\n&quot;Ending Battle&quot; part 3! The Daily Planet is attacked by Evilstar and his Starlings, while a more powerful Terra-Man and Rock attack the Steelworks, forcing Lois to decide if her duty as a reporter comes before her duty to Superman.\n\nAction Comics v1 #795\n&quot;Ending Battle&quot; part 4! Superman confronts the man he believes is behind the attacks on his friends and family. But soon he's faced with the return of some unexpected foes.\n\nSuperman v2 #187\n&quot;Ending Battle&quot; part 5! Superman returns to a Metropolis turned into a prison by the new Master Jailer. But that's not all! Guarding the gates of that prison are deadlier versions of the Prankster, Bizarro, Metallo, and a new female Puzzler.\n\nThe Adventures of Superman #609\n&quot;Ending Battle&quot; part 6! On the trail of the man responsible for the attacks on his friends and family, Superman is attacked by an armada of new villains. Can the Man of Steel stand up to the sheer number of adversaries against him?\n\nSuperman: The Man of Steel #131\n&quot;Ending Battle&quot; part 7! Facing the combined might of Mongul, Bizarro, Master Jailer, and Silver Banshee, Superman doesn't stand a chance to get to Lois before she finds the unexpected visitor at her doorstep!\n\nAction Comics v1 #796\n&quot;Ending Battle&quot; finale, continued from Superman: Man of Steel #131. A villainous mastermind has been pushing Superman to his limits, but how far can the Man of Steel be pushed before he breaks completely?\n\nThanks goes to DreamGirl for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8689374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8689374&lt;/a&gt;","torrent":{"xt":"urn:btih:04cd449eb7997207778645b1ab00a6118956771d","amp;dn":"Superman+-+Ending+Battle+1-8+%282002%29+%28hybrid%29+%28DreamGirl-Novus-HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04cd449eb7997207778645b1ab00a6118956771d","infoHashBuffer":{"type":"Buffer","data":[4,205,68,158,183,153,114,7,119,134,69,177,171,0,166,17,137,86,119,29]},"announce":[],"urlList":[]}}