{"title":"Road Redemption v0.824","uid":11650764,"size":919717461,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:04dc2a13a414a0964a4590786d812f93686966e8&amp;dn=Road+Redemption+v0.824&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1417871346,"description":"Road Redemption is a modern reimagining of Road Rash. Lead your motorcycle gang on an epic journey across the country in this procedurally-generated driving combat adventure. Earn money by completing races, assassinations, robberies, and other challenges in your path. As you collect loot, you'll upgrade your character, your bike, and your weapons. Driving a motorcycle at 100 mph while trying to hit someone with a pipe is dangerous, and death can come quickly. There are no extra lives nor continues. Fortunately, every time you die, all the experience you've collected can be used to upgrade your character, your bike, and your weapons.\n\nChangelog:\nv0.824:\n- No more crash problems on 32 bit versions of Windows!\n- Better performance on 32 bit versions of Windows!\n- You can now drop a weapon from your inventory by holding down the associated number key\n- Significant performance improvements\n- Game no longer can lose track of players on the final campaign mode track\n- Graphical improvements\n- Slight mission tweaks\n- Halloween stuff put in the closet til next year\n- Fixed glitch when playing in Steam offline mode\n- Police missions have better win/loss explanations\n- Improved performance on car headlights\n- Improved performance on main halloween track\n- Improved performance on particle effects\n- Improved performance on Hellfire Rider\n- Increased steering sensitivity for mouse and keyboard players\n- Removed all cars from the rooftop tracks\n- Added the ability to select more weapons in missions\n- Improved icons in splitscreen multiplayer mode\n- Car AI improvements in various missions\n- Resolution configuration improvement\n- Halloween Mode: play as the super-powered Hellfire Rider in this new mini-campaign\n- New environmental effects\n- Ability to recenter the camera by pushing in on the right joystick, for gamepad users\n- Additional soundfx\n- Improved difficulty balancing\n- Slight performance improvements\n- Bug fixes\n- Tutorial Improvements\n- Fixed bug where kicking grabbed enemies sometimes wouldn't work\n- Fixed bug on camera dynamic zoom. Camera no longer stays zoomed out when it shouldn't.\n- Improved light graphics on police bikes\n- Fixed bug in final bonus level where game would lose track of player's race position\n- Killing cars will no longer make them spin out of control\n- Fixed rare bug involving C4 weapon\n- More control options for firing guns with gamepads\n- Dropping weapons you don't want is easier\n- Warning messages if car rain or crazy drivers\n- Car AI improved\n- Tutorial messages improved\n- Improved difficulty curve balance in main campaign\n- Alerted if low on health\nv0.82:\n- New playable character (masked rider)\n- Visual user interface upgrades\n- Player is now more powerful when it comes to taking down cars\n- Major performance improvement, especially in snow territories.\n- Tweaked rooftop missions so they flow better.\n- Enlarged finish lines in rooftop races so there's no chance of accidentally going around them.\n- Big performance improvements across the board.\n- Minor AI improvements\n- Fixed a few very minor glitches in the rooftops\n- Performance improvements in the snow territory (everyone, even low end folk, should get at least 30fps now)\n- Police missions now indicate how far you are from the mission end point\n- Minor AI tweaks\n\n1. Unzip // use http://www.7-zip.org/, for example\n2. Play\n3. Seed\n\nIf you like the game, support the developer, buy it!  &lt;a href=&quot;\nhttp://store.steampowered.com/app/300380/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/300380/&lt;/a&gt;","torrent":{"xt":"urn:btih:04dc2a13a414a0964a4590786d812f93686966e8","amp;dn":"Road+Redemption+v0.824","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04dc2a13a414a0964a4590786d812f93686966e8","infoHashBuffer":{"type":"Buffer","data":[4,220,42,19,164,20,160,150,74,69,144,120,109,129,47,147,104,105,102,232]},"announce":[],"urlList":[]}}