{"title":"Francisco Goya - A Life (Art Ebook).pdf","uid":13176521,"size":39691694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05f7dfff0d8b5334de4cdee0aed398a696fcc40f&amp;dn=Francisco+Goya+-+A+Life+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1452295299,"description":"Francisco Goya: A Life\r\nCounterpoint | 2004 | ISBN: 1582433070 | English | 264 pages | PDF | 37.8 MB\r\n\r\nThis rousing history of Goya's life and times opens with a devastating anecdote about his most notorious model. Evidently the 13th duchess of Alba, &quot;by every account a mankiller,&quot; once picked up a poor seminarian while cruising incognito and forced him to dine her so lavishly that he had to forfeit his trousers when the bill came. Connell takes the painter's career as a vantage point from which to portray Spain at the end of the 18th century. As the ambitious young artist from Saragossa was attempting to climb the ladder of imperial favor, the House of Bourbon was in decline, its empire dominated by a despotic Inquisition and a terrible heedlessness of what was happening on the other side of the Pyrenees. By the time the French invaded, Goya's hard-won status was unassailable, even by his own brutal honesty, and remained so through the ensuing upheavals, his work growing more satirical and embittered with each change of regime. One of the chief puzzles about Goya is how he managed to retain the favor of his patrons while making them look awful and, conversely, how he correlated his political conscience with his persistent ambition. Instead of answering these questions, Connell explores the rich perversities of the whole epoch, thus rendering the painter's peculiarities more authoritative than mysterious. The loosely structured narrative includes canny, sometimes hilarious character sketches, wry reportage of contemporary horrors and opinionated engagements with his many sources, including such entertaining figures as Casanova and Lady Elizabeth Holland. On the paintings, he makes only occasional, though pointed, commentary. This is, in short, an old-fashioned, belle-lettristic biography, full of erudition, unobtrusive scholarship and personality, whether its subject's or its author's being really beside the point; readers of Robert Hughes's recent Goya will want Connell's cultural reportage as counterpoint","torrent":{"xt":"urn:btih:05f7dfff0d8b5334de4cdee0aed398a696fcc40f","amp;dn":"Francisco+Goya+-+A+Life+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f7dfff0d8b5334de4cdee0aed398a696fcc40f","infoHashBuffer":{"type":"Buffer","data":[5,247,223,255,13,139,83,52,222,76,222,224,174,211,152,166,150,252,196,15]},"announce":[],"urlList":[]}}