{"title":"Gates Of Gotham - Complete (1 - 5)","uid":6644431,"size":77575226,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:06b0d265beb25eaa7133321b4b13e134f0f16025&amp;dn=Gates+Of+Gotham+-+Complete+%281+-+5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MonJoh","files":5,"time":1314890623,"description":"From Wikipedia:\n\nBatman: Gates of Gotham is a five-issue, monthly comic book limited series published by DC Comics involving the various characters of the Batman franchise. It is written by Scott Snyder and Kyle Higgins, and illustrated by Trevor McCarthy. The first issue was published May 18, 2011.\n\nPlot summary\n\nThe series revolves around a decades-old mystery connected to the founding fathers of Gotham City that comes to light in the present day, leading Batman (Dick Grayson) to assemble a team of detectives to try and unravel the conspiracy. The series features Red Robin, Black Bat (Cassandra Cain), Robin (Damian Wayne) as the main characters.\n\nThe series will be used as a launching point for several high-profile Batman storylines in 2011, and will also touch upon elements introduced in Grant Morrison's The Return of Bruce Wayne limited series.\n\n----------------------------------------------------------------------------------\n\nFolks, this is my first upload and my connection may suck sometimes so you'll need to be patient at first (this is not a huge file, though) and to seed after you're finished so that the torrent keeps alive and well.\n\nAll files were downloaded from TPB, I just put them together.\n\nCredits and virtuals hugs go to the original scanners, they are the reason why we can still afford an internet connection (them and Baby Jesus, probably) and also to the users who uploaded these here in the first place - MrDowntown and mirrormaster82, they rock.\n\n-------------------------------------------------------------------------------\n\nEnjoy + Seed","torrent":{"xt":"urn:btih:06b0d265beb25eaa7133321b4b13e134f0f16025","amp;dn":"Gates+Of+Gotham+-+Complete+%281+-+5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06b0d265beb25eaa7133321b4b13e134f0f16025","infoHashBuffer":{"type":"Buffer","data":[6,176,210,101,190,178,94,170,113,51,50,27,75,19,225,52,240,241,96,37]},"announce":[],"urlList":[]}}