{"title":"Occult - Laitman on the Kabbalah, 6 book set (pdf) EarthBow","uid":4651725,"size":11470916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06e3a90078b1b2ff783cdc872551c932d7d1e50e&amp;dn=Occult+-+Laitman+on+the+Kabbalah%2C+6+book+set+%28pdf%29+EarthBow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EarthBow","files":6,"time":1232066153,"description":"This six volume set by Rav Michael Laitman, PhD is the ultimate guide to the kabbalah\n\n\nKabbalah, Attaining the Worlds Beyond, 2003, 456 pages\n\nThis book aims to show us how we can perceive and connect with our Creator. Rather than filling our heads with facts, Laitman suggests we concentrate on the feelings aroused by this work, instantly bringing Kabbalah out of the theoretical and into the actual.\n\n\nThe Kabbalah Experience, 2005, 450 pages\n\nKabbalah Experience is a collection of questions and answers from the students of Dr. Michael Laitman, who is today's foremost teacher of authentic Kabbalah. Essentially, it is a book by the students for the students with Dr. Laitman merely providing the answers. Suggested for those who already have some knowledge of Kabbalah.\n\n\nThe Path of Kabbalah, 2005, 379 pages\n\nThis book teaches us the authentic Kabbalist view of the true structure of reality and how and why we have come to perceive it as we do. It teaches us about the human soul, past present and future and explains the interconnectedness of all souls and existence itself.\n\n\nBasic Concepts in Kabbalah, 2006, 110 pages\n\nEven though this book may seem very basic, it is not intended to be a book that conveys basic knowledge of Kabbalah. Rather, it's a book to help readers cultivate an approach to the concepts of Kabbalah, to spiritual objects, and to spiritual terms.\n\n\nKabbalah Revealed, 2006, 167 pages\n\nThis book is a good introduction to the basics of Kabbalah, and shows how we can use these basic principals to enrich our daily lives.\n\n\nKabbalah, Science, and the Meaning of Life, 2006, 221 pages\n\nThis book presents the fundamentals of the science that explores the aspects of reality hidden from scientists. When we discover those hidden parts, our knowledge of the world we live in will be complete. The Wisdom of Kabbalah grants all the above to anyone who truly seeks it.\n\n\nNote: I will be adding many more titles soon, subscribe to my RSS feed at...\n &lt;a href=&quot;\nhttp://rss.thepiratebay.se/user/01e1e80da7131a28ecc9392fa89798bf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rss.thepiratebay.se/user/01e1e80da7131a28ecc9392fa89798bf&lt;/a&gt;\n\nOr bookmark my TPB page at... \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/EarthBow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/EarthBow&lt;/a&gt;\n\nAs always, comments (good or bad) are appreciated\n\nKeywords: occult, esoteric, qabalah, kabbalah basic, complete","torrent":{"xt":"urn:btih:06e3a90078b1b2ff783cdc872551c932d7d1e50e","amp;dn":"Occult+-+Laitman+on+the+Kabbalah%2C+6+book+set+%28pdf%29+EarthBow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06e3a90078b1b2ff783cdc872551c932d7d1e50e","infoHashBuffer":{"type":"Buffer","data":[6,227,169,0,120,177,178,255,120,60,220,135,37,81,201,50,215,209,229,14]},"announce":[],"urlList":[]}}