{"title":"The Shield Season 6 *complete* TPB fanservice compilation","uid":3717065,"size":4048217736,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:07166c79569771efa9b3de50e8103511cde3597d&amp;dn=The+Shield+Season+6+%2Acomplete%2A+TPB+fanservice+compilation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MediaMogul","files":11,"time":1182146673,"description":"The Shield season 6\nEpisodes 1 - 10\n\nCompilation from different sources\nbrought togheter fro your enjoyment\n\nEpisode 1: ON THE JONES\nDescription:\nAs the Barn mourns the loss of Lem, Vic&amp;#039;s bloodlust for the killer\nputs him on a collisioncourse with Kavanaugh. Shane&amp;#039;s increasingly \nunstable and erratic behavior concerns Vic and Ronnie. Claudette \ngets distressing news about the Barn&amp;#039;s future before she&amp;#039;s even \nsettled into her new job as Captain. Dutch and Billings discover \nthe gruesome San Marcos mass murder, while Julien and Tina&amp;#039;s relationship \ndeteriorates.\n\nEpisode 2: BAPTISM BY FIRE\nDescription:\nVic takes drastic actions to track down Lem&amp;#039;s killer as Kaveanaugh&amp;#039;s \ninvestigation makes a shocking turn. Claudette is put under intense \npolitical scrutiny in the wake of the San Marcos murders. Danny \nreceives some long-waited good news as tina is offered an unusual \nopportunity.\n\nEpisode 3: BACK To ONE\nDescription:\nVic finally catches up to Lem&amp;#039;s suspected killer as Shane&amp;#039;s torment \nworsens. Claudette delivers an unexpected blow to Vic concerning \nhis future at the Barn. Dutch creates an awkward situation when he \nmisinterprets Tina&amp;#039;s flirtious behavior. Ronnie hides his concern \nfor Vic while working an undercover case with Dutch and Billings.\n\nEpisode 4: THE NEW GUY\nDescription:\nClaudette offers Vic a chance to keep his job, but only if he agrees \nto train his replacement, Kevin Hiatt. An unsolved abduction/rape \ncase from Dutch and claudette&amp;#039;s past comes back to haunt them. \nAceveda meets am influential buisnessman who could further his \npolitical aspirations. Dutch has mixed emotions as Tina&amp;#039;s star \nrises in the department.\n\nEpisode 5: HAUNTS\nDescription:\nIn his rush to avenge Lem&amp;#039;s murder, Vic discovers he may have killed \nthe wrong man. Shane confesses the truth to Mara to save his strained \nrelationship. Using unconventional methods, Dutch makes headway in \nthe serial rapist case. Claudette and Aceveda go head-tohead when \nhis ambition collides with her professionalism.\n\nEpisode 6: CHASING GHOSTS\nDescription:\nAs Vic&amp;#039;s worst fears are realized in learning who really killed Lem, \nDutch and Claudette meet a witness that incrimidates him. Vic makes \na last ditch attempt to save his career as Shane&amp;#039;s life begins to \nspiral out of control. Cassidy confronts her father after hearing \nabout his unethical past.\n\nEpisode 7: EXILED\nDescription:\nShane reaches out to the armenian mob after Vic severs their ties. \nVic gets deeper into the San Marcos massacre after discovering \nevidence of a larger conspiracy. Dutch and Billings make headway \nof their own when they track down the lone survivor of that slaugther.\n\nEpisode 8: THE MAN OF THE WRATH\nDescription:\nVic learns he&amp;#039;s being forceed out of his job despite recent efforts \nto be a team player. Shane crosses a dangerous line when he gets into\nbed with Diro, the daughter of an Armenian mob boss. Claudette begins \nto question Hiatt&amp;#039;s loyalty and effectivness. Vic finally comes clean\nto Ronnie about Terry Crowley&amp;#039;s murder.\n\nEpisode 9: RECOIL\nDescription:\nVic and ronnie consider a deadly deal in order to solve the San Marcos murders\nand possiblysave Vic&amp;#039;s job. Shane and Diro become buisness partners as\nshe prepares to take controle of the Armenian mob. Dutch and Billings reach\nthe breaking point when Billings humiliates Dutch in front of his colleagues.\nAfter all seems lost, Vic is handed the leverage to save his career from an unexpected\nsource. Tina and hiatt see each other in a whole new light.\n\nEpisode 10: SPANISH PRACTICES\nDescription:\nVic and Aceveda form an unlikely alliance to expose a mutual enemy. Hiatt&amp;#039;s job is in\nJeopardy after botching an arrest, while Billings drops a bombshell on Claudette and \nthe department. The walls close in on Shane when the Armenians put his loyalty\nto the ultimat test. ","torrent":{"xt":"urn:btih:07166c79569771efa9b3de50e8103511cde3597d","amp;dn":"The+Shield+Season+6+%2Acomplete%2A+TPB+fanservice+compilation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07166c79569771efa9b3de50e8103511cde3597d","infoHashBuffer":{"type":"Buffer","data":[7,22,108,121,86,151,113,239,169,179,222,80,232,16,53,17,205,227,89,125]},"announce":[],"urlList":[]}}