{"title":"Hawkman v2 (1986-1987)","uid":4142801,"size":249194953,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:075870b055e5c679938583460b801b560c4269ec&amp;dn=Hawkman+v2+%281986-1987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":19,"time":1208573516,"description":"Requested from the forums. \n\nThis torrent continues the Hawkman collection with Hawkman v2 \n\nHawkman is a fictional character, a superhero in the DC Comics universe. Created by writer Gardner Fox and artist Dennis Neville, the original Hawkman first appeared in Flash Comics #1 (1940) \n\nSeveral incarnations of Hawkman have appeared in DC Comics, all of them characterized by the use of archaic weaponry and by large, artificial wings, attached to a harness made from the special Nth metal that allows flight. Most incarnations of Hawkman work closely with a partner/romantic interest named Hawkgirl or Hawkwoman. \n\nAll incarnations of Hawkman used the wondrous &quot;ninth metal&quot; or &quot;Nth Metal&quot; to defy gravity and allow them to fly. The metal is in their costume&amp;#039;s belt, and its abilities are controlled mentally. Their wings allow them to control their flight, though they can be &quot;flapped&quot; through use of shoulder motions. \n\nThe Silver Age Hawkman also had enhanced eyesight comparable (it was said) to a hawk&amp;#039;s. He (and, sometimes, the Golden Age Hawkman) was also able to converse with birds, though he couldn&amp;#039;t command them as Aquaman could, with sea creatures. \n\nThe Silver Age Hawkman also possessed a Thanagarian police space ship and a variety of science fictional weapons. \n\nAll versions of Hawkman preferred to use archaic weaponry - particularly maces, nets, spears and shields - rather than modern or futuristic weapons. The current incarnation prefers this in part because, having the memories of living through many past lives, he is more proficient in their use than with contemporary weapons. In Katar Hol&amp;#039;s case, it was too dangerous to use Thanagarian weaponry since there was too great a chance they could be lost or captured and then used or duplicated on Earth. \n\nThanks to the scanners and the original sources. \n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:075870b055e5c679938583460b801b560c4269ec","amp;dn":"Hawkman+v2+%281986-1987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075870b055e5c679938583460b801b560c4269ec","infoHashBuffer":{"type":"Buffer","data":[7,88,112,176,85,229,198,121,147,133,131,70,11,128,27,86,12,66,105,236]},"announce":[],"urlList":[]}}