{"title":"Do Make Say Think - Self-titled and Goodbye Enemy Airship...","uid":3414987,"size":291152429,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:075a2d2acfbca93f1ad70a1e57ae35552fa54616&amp;dn=Do+Make+Say+Think+-+Self-titled+and+Goodbye+Enemy+Airship...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dellamorte","files":26,"time":1133211922,"description":"size: 277 MB\nbitrate: 320 kbps\n\n\nDo Make Say Think - Do Make Say Think\n\n1. 1978\n2. Le'espalace\n3. If I Only\n4. Highway 420\n5. Dr. Hooch\n6. Disco &amp; Haze\n7. Onions\n8. The Fare to Get There\n\n\nIn 1998, the cognoscenti in the US music press spent their year salivating over the godspeed you black emperor! release on Kranky. Rarely, if ever, noted, however, was the fact that the original version of that record was released on the wonderful Constellation label out of Montreal. So now the folks from the great socialist nightmare to the north have graced us with yet another large instrumental ensemble from their beleaguered land. Do Make Say Think is a six-piece from Toronto, whose self-titled debut rivals the aforementioned godspeed record in complexity, and certainly surpasses it in intensity. Full of - you guessed it - long songs, the record ambles along at such an easy pace that it's is easy to immerse yourself inside, even if you find yourself continually cursing the post-rock scene with which this record will sadly, and undoubtedly, be associated. Sure, songs like the incredible '1978' and the misfortunately-named 'Dr. Hooch' sound a lot like a Slint single slowed down to 33 rpm, but this band maintains a much stronger electronic minimalist sensibility than anyone in Louisville, or for that matter, Chicago ever did. Where this band really excels is in their use of traditional instrumentation to replicate sounds and styles often left to electronic instruments today. The magnificent 'If I Only...' is as easily referenced to a DJ Shadow-style jazz instrumental as anything else. Do Make Say Think has made, here, the perfect record to bridge the gap between the worlds of chill-out and prog/post rock. Now let's see what the cognoscenti have to say about that!\n\nIan Fitzpatrick\nPunktlich no. 99/1 \n\n\nDo Make Say Think - Goodbye Enemy Airship The Landlord Is Dead\n\n1. When Day Chokes the Night\n2. Minmin\n3. The Landlord is Dead\n4. The Apartment Song\n5. All of This is True\n6. Bruce E Kinesis\n7. Goodbye Enemy Airship\n\nManaging to be both unsettling and deeply beautiful, genuinely experimental yet infinitely palatable, Goodbye Enemy Airship...rarely resorts to the tired quiet/loud Slint methodology that has contributed to post-rock being pilloried in some quarters.  Instead, they inject squalls of jazzy horns into opener &quot;When Day Chokes The Night&quot;, employ a Ry Cooder-style country twang on &quot;The Apartment Song&quot; and recall Future Days-era Can on the gloriously woozy &quot;All Of This Is True&quot;.  The lasting impression is of a band overflowing with a restless flow of ideas.  Stunning.\n\nPat Long\nSelect MagazineApril 2000","torrent":{"xt":"urn:btih:075a2d2acfbca93f1ad70a1e57ae35552fa54616","amp;dn":"Do+Make+Say+Think+-+Self-titled+and+Goodbye+Enemy+Airship...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075a2d2acfbca93f1ad70a1e57ae35552fa54616","infoHashBuffer":{"type":"Buffer","data":[7,90,45,42,207,188,169,63,26,215,10,30,87,174,53,85,47,165,70,22]},"announce":[],"urlList":[]}}