{"title":"Lisa Worrall - New York Cowboy [Epub &amp; Mobi] { KT }","uid":11152590,"size":1355758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:075e6d701c2da2668e44853860ffa1b8e5c4375a&amp;dn=Lisa+Worrall+-+New+York+Cowboy+%5BEpub+%26amp%3B+Mobi%5D+%7B+KT+%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1412366974,"description":"New York Cowboy (New York Cowboy #1) by Lisa Worrall\n\n\n\nNB: 20% of each copy sold will be donated to the Friends of Roxburghe House hospice in memory of my friend Keith Donald who lost his brave fight with cancer on the 7 September 2013.\n\nIt's been six months since Vance Wolf buried his father. Driven to an early grave by the constant harassment of the new owner of the neighboring property, Andrew Blackwell. Now Vance's cattle are disappearing faster than he can replace them and their cash flow has been wiped out by the new barn they had to build after the other one mysteriously caught fire. The local sheriff's pockets are being lined by Blackwell, so Vance knows they're on their own and is at his wits end. Then his mother suggests they open up the ranch to business types as a cowboy camp.\n\nAdam Prentiss arrives at Wolf Creek Ranch on a team-building exercise with the four colleagues in his department. He is not the cowboy type, but has no choice as his boss, and father, has sent him to Wolf Creek with instructions to delve into the financial status of the ranch and report back to him. Falling for Vance Wolf had not been part of the plan, but the connection between them had been instant. But what was he more afraid of? Disobeying his boss or Vance finding out Adam's father was in fact Andrew Blackwell and he'd been sent to help him appropriate Vance's land by any means necessary?\n\n\nGenre: Romance | Drama | Family\n","torrent":{"xt":"urn:btih:075e6d701c2da2668e44853860ffa1b8e5c4375a","amp;dn":"Lisa+Worrall+-+New+York+Cowboy+%5BEpub+%26amp%3B+Mobi%5D+%7B+KT+%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075e6d701c2da2668e44853860ffa1b8e5c4375a","infoHashBuffer":{"type":"Buffer","data":[7,94,109,112,28,45,162,102,142,68,133,56,96,255,161,184,229,196,55,90]},"announce":[],"urlList":[]}}