{"title":"Badfinger/Day After Day [Live][1990][2005][320 KBPS][Japan]","uid":11710667,"size":128361862,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:079e7cb1ac753f8ee3f99a6b431e4f0d91c77202&amp;dn=Badfinger%2FDay+After+Day+%5BLive%5D%5B1990%5D%5B2005%5D%5B320+KBPS%5D%5BJapan%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":17,"time":1424329113,"description":"Badfinger - Day After Day [Live][1990][2005][Japan Mini LP SHM-CD]\n\n\n\n01. Sometimes  \n02. I Don't Mind  \n03. Blind Owl  \n04. Give It Up  \n05. Constitution  \n06. Baby Blue  \n07. Name Of The Game  \n08. Day After Day  \n09. Timeless  \n10. I Can't Take It\n----------------------------------\n**320 KBPS CBR\n**Cover Art\n-----------------------------------------------\n  Badfinger were a British rock band that originally consisted of Pete Ham, Mike Gibbins, Tom Evans and Ron Griffiths. The band evolved from an earlier group called The Iveys that was formed in 1961 by Ham, Ron Griffiths and David &quot;Dai&quot; Jenkins in Swansea, Wales. They were signed by the Beatles' Apple label in 1968 as The Iveys. In 1969, Griffiths left and was replaced by Joey Molland, and the band renamed itself Badfinger. In 1970, the band engaged American businessman Stan Polley to manage their commercial affairs. Over the next five years the band recorded several albums for Apple and toured extensively, before they became embroiled in the chaos of Apple Records' dissolution.\n\nBadfinger had four consecutive worldwide hits from 1970 to 1972: &quot;Come and Get It&quot; (written and produced by Paul McCartney), &quot;No Matter What&quot;, &quot;Day After Day&quot; (produced by George Harrison) and &quot;Baby Blue&quot;. In 2013, &quot;Baby Blue&quot; made a resurgence onto the &quot;Hot Rock Songs&quot; Billboard 100 chart at number 14, due to its featuring at the end of the series finale of the hit TV show Breaking Bad. Their song &quot;Without You&quot; has been covered many times, including a Billboard number one hit for Harry Nilsson.\n\nThey signed to Warner Bros., but Polley's financial machinations resulted in a lawsuit by Warner over missing escrow account money. Warner's consequent withdrawal from market of the 1974 album, Wish You Were Here (seven weeks after its release), cut off the band's income. Three days before his 28th birthday, on 24 April 1975, Ham committed suicide by hanging himself, leaving a note that included damning comments about Polley.\n\nOver the next three years, surviving members struggled to rebuild their personal and professional lives against a backdrop of lawsuits. The albums Airwaves (1978) and Say No More (1981) floundered, as Molland and Evans see-sawed between co-operation and struggle in attempts to revive and capitalise on the Badfinger legacy. Having seen Ham's body after Ham's wife had called him, Evans reportedly never got over his friend's suicide, and was quoted as saying in darker moments, &quot;I wanna be where he is.&quot; On 19 November 1983, Evans also took his own life by hanging\n--------------------------------------------------------------------------------\nDay After Day: Live is a CD release by Rykodisc in 1990 of live recordings made by the British rock group Badfinger in 1974.\n\nDuring a concert tour in the Midwestern United States in 1974, Badfinger learned that the Agora venue in Cleveland, Ohio, contained a 16-track studio capable of live recordings. The group had released five studio albums up to this point but had not made any professional live recordings. Deciding to utilise the equipment, Badfinger recorded two of their shows at the Agora. Due to audio distortion and essentially a moderate performance by the group, the tapes were not used at the time.\n\nThe Agora recordings circulated as bootlegs for several years before band member Joey Molland brought them to the attention of Rykodisc in 1989. Molland performed a great deal of rework to the recordings, including overdubbing his vocals, several guitars, and some of the bass. He also used a computer-sampled drum snare to enhance the original drum track. Molland also rearranged the song order of the performances, placing Pete Ham's compositions at the end of the CD. As a result of Molland's augmentation, the CD has been bitterly reviewed by music critics and fans.\n\nComplications arose for Molland in the mid 1990s when other Badfinger parties objected to the release, citing they were not properly notified. There was also some confusion as to the ownership of the original tapes, which Molland testified were taken by his wife when he resigned from the group in 1974. A lawsuit in Great Britain resolved that Molland should have proceeded differently when releasing the CD, but generally ruled in his favour regarding royalty divisions (which included Molland's compensation for production work).\n--------------------------------------------------------------------------------\n\nBadfinger:\n\n\nJoey Molland: Guitar, Vocals\nPete Ham: Guitar, Vocals\nTom Evans: Bass, Vocals\nMike Gibbins: Drums","torrent":{"xt":"urn:btih:079e7cb1ac753f8ee3f99a6b431e4f0d91c77202","amp;dn":"Badfinger%2FDay+After+Day+%5BLive%5D%5B1990%5D%5B2005%5D%5B320+KBPS%5D%5BJapan%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079e7cb1ac753f8ee3f99a6b431e4f0d91c77202","infoHashBuffer":{"type":"Buffer","data":[7,158,124,177,172,117,63,142,227,249,154,107,67,30,79,13,145,199,114,2]},"announce":[],"urlList":[]}}