{"title":"Crimson Tide.mp4","uid":11536588,"size":1666748265,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08eb4e2ca7f18758d606f7c959040695567c140a&amp;dn=Crimson+Tide.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1416630023,"description":"On a US nuclear missile sub, a young first officer stages a mutiny to prevent his trigger happy captain from launching his missiles before confirming his orders to do so.\n\nTense little action thriller on par with &quot;The Hunt for Red October&quot; has a nuclear submarine commander (Gene Hackman) and his new second-in-command (Denzel Washington) getting in a chess match of words and wits ala &quot;Mutiny on the Bounty&quot;. Russian rebels may be about to launch nuclear missiles at any moment. Commands come through for Hackman to detonate the weapons from their ship, but then another message after that one which is incomplete splits the entire crew. Hackman thinks it is time to take control with aggression while Washington believes that this is way too important without knowing everything there is to know. A wide range of characters on the submarine (which includes Viggo Mortensen, Steve Zahn, James Gandolfini, Rick Schroeder, George Dzundza) must decide which of the all-world performers they are going to side with. The screenplay is mediocre really, but Hackman and Washington know how to overcome that and director Tony Scott keeps the pulse of his audience in high over-drive. Definitely an acceptable piece from the genre. 4 stars out of 5.\n.......................\nCopyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for fair-use purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use, tips the balance in favour of fair use","torrent":{"xt":"urn:btih:08eb4e2ca7f18758d606f7c959040695567c140a","amp;dn":"Crimson+Tide.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08eb4e2ca7f18758d606f7c959040695567c140a","infoHashBuffer":{"type":"Buffer","data":[8,235,78,44,167,241,135,88,214,6,247,201,89,4,6,149,86,124,20,10]},"announce":[],"urlList":[]}}