{"title":"Boom Varietal - The Rise of Argentine Malbec [Documentary DVDrip","uid":8922066,"size":1278726263,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:096fd9512179d2b353edf1a2dfa8f3484fc80f7c&amp;dn=Boom+Varietal+-+The+Rise+of+Argentine+Malbec+%5BDocumentary+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrdo","files":1,"time":1379277097,"description":"Boom Varietal - The Rise of Argentine Malbec 2011\n\nArgentine Malbec is currently the fastest growing wine varietal in the United States. Originally from the Cahors region of France, Malbec never gained the acceptance that it has achieved in Argentina. Thirsty Italian immigrants arriving in Argentina at the turn of the 20th century, widely planted Malbec cuttings all along the Andean foothills in Mendoza. In this high, dry climate, Malbec found its perfect terrior. Originally producing inexpensive and bland blends to satisfy the huge demand of the population the Argentines later developed &quot;boutique&quot;, &quot;export quality&quot;, &quot;New World&quot;, &quot;single varietal&quot; wines. This movement, combined with a dramatic shift from an internal focused culture to an outward looking, export driven economy, plus the country's 75% currency devaluation in 2002, has caused Malbec to boom. US consumers now seem to be enamored with the varietal, but will the boom last? Difficulties for foreign investors, government unpredictability, pronounced inflation and a proliferation of export brands, may sow the seeds for the varietal's demise. Americans have become progressively enthralled and bored with Merlot and Shiraz. Will Malbec be next? The film profiles several key wine producers in the industry as they speak about their successes and struggles in these times. The future is uncertain as Argentines work to keep the boom on course; focusing on family, the importance of terrior, dedication to quality, collaboration with fellow winemakers and diversifying to grow more than just Malbec. Beautifully shot and with an original music score, Boom Varietal will unlock your understanding of Argentina's great Malbec\n\nRipped with Handbrake from DVD","torrent":{"xt":"urn:btih:096fd9512179d2b353edf1a2dfa8f3484fc80f7c","amp;dn":"Boom+Varietal+-+The+Rise+of+Argentine+Malbec+%5BDocumentary+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"096fd9512179d2b353edf1a2dfa8f3484fc80f7c","infoHashBuffer":{"type":"Buffer","data":[9,111,217,81,33,121,210,179,83,237,241,162,223,168,243,72,79,200,15,124]},"announce":[],"urlList":[]}}