{"title":"Julius Caesar: Life of a Colossus - Goldsworthy  (Unabridged)","uid":4900553,"size":537135311,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0a89847c1bc930deed96096408527eb567d2bf6f&amp;dn=Julius+Caesar%3A+Life+of+a+Colossus+-+Goldsworthy++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":19,"time":1242591727,"description":"Audio Books : Misc. Educational : MP3/64Kbps : English\n \n\nCAESAR: Life of a Colossus by Adrian Goldsworthy\nUnabridged, 27 hours 5 minutes.\nAmazon Link: http://www.amazon.com/exec/obidos/ASIN/0300126891/4353-20\n\n\n\nFrom Publishers Weekly:\n\nThe man who virtually defined the West's concept of leadership comes alive in this splendid biography. Military historian Goldsworthy (The Complete Roman Army) gives a comprehensive, vigorous account of Julius Caesar's conquest of Gaul and his victories in the civil war that made him master of Rome. \n\nBut he doesn't stint on the non-martial aspects of Caesar's life - his dandyism, his flagrant womanizing (which didn't stop enemies from gay-baiting him), his supple political genius and the flair for drama and showmanship that cowed mutinous legionaries and courted Rome's restive masses. \n\nGoldsworthy's is a sympathetic profile. In his telling, Caesar's massacres and group enslavements, though &quot;utterly ruthless,&quot; are considered and pragmatic, not wanton, and the conqueror seems to possess a moderation and magnanimity that sprang from the same idealized self-image that fed his ambition. \n\nThe author's vivid portrait of the late Roman Republic that Caesar toppled is correspondingly jaundiced: its politics are about nothing except the personal ambitions of powerful men, and chaos, corruption and violence reign beneath the ritualistic niceties of republican procedure. \n\nMore compellingly than most biographies, Goldsworthy's exhaustive, lucid, elegantly written life makes its subject the embodiment of his age.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0a89847c1bc930deed96096408527eb567d2bf6f","amp;dn":"Julius+Caesar%3A+Life+of+a+Colossus+-+Goldsworthy++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a89847c1bc930deed96096408527eb567d2bf6f","infoHashBuffer":{"type":"Buffer","data":[10,137,132,124,27,201,48,222,237,150,9,100,8,82,126,181,103,210,191,111]},"announce":[],"urlList":[]}}