{"title":"The Anthony Cumia Show 2015-06-11 Ann Coulter Johnny Brennan ","uid":12011218,"size":276304989,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0d041a0c80943c1973957a87c98d02655744b90a&amp;dn=The+Anthony+Cumia+Show+2015-06-11+Ann+Coulter+Johnny+Brennan+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1434129857,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Ann Coulter, Johnny Brennan\n\nEpisode 178 - We begin today hearing about last night's Legion of Skanks and Luis J. Gomez's new show idea, Ant sings the praises of Sam Roberts, sends his condolences on the death of Dusty Rhodes and Christopher Lee, and talks about ex-Hefner girlfriend Holly Madison's new book. Anthony shares a Hugh Hefner story, talks about the old days of Playboy Magazine, we look at #TBT pics of Barbi Benton, KtC tells us how his first muff dive went down, we read an article on the molested Duggar sisters asking for privacy, Ant gives a valuable reality show tip, Rat learns all about &quot;the shocker&quot;, and the callers chime in leading to discussions about NWA, the impact music has on community actions, and the immigrant problem in Italy. We look at a &quot;fingering chart&quot;, see the new consumer friendly version of Oculus, look at the trailer for the Fallout 4 game, see a clip of Jerry Seinfeld on Seth Meyers show, read an article on Seinfeld's &quot;anti-PC&quot; opinion, and debate where the line should be drawn in comedy. Ann Coulter calls in to talk about jokes offending, her new book &quot;Adios, America&quot;, being lied to by the government, immigration and policies, catering to your voting audience, the fear of being labeled, and Ann gives Ant shit for not going to the Comedy Cellar last weekend with her. Ant and a caller talk about Andrew Dice Clay, we look at a throwback video of Dice, one of a newswoman losing her shit, a video of two little girls describing their run-in with the cops, and Johnny Brennan calls to talk with Ant about Eternal Con, the demographic of his fans, the popularity of The Jerky Boys prank calls, building characters, doing Family Guy, Sol Rosenberg, and the longevity of The Jerky Boys skits. We then discuss censorship on Reddit, internet rights, raging on-line hatred, a new glistening dwarf planet, and end the week with stories of being dragged to concerts.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:0d041a0c80943c1973957a87c98d02655744b90a","amp;dn":"The+Anthony+Cumia+Show+2015-06-11+Ann+Coulter+Johnny+Brennan+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d041a0c80943c1973957a87c98d02655744b90a","infoHashBuffer":{"type":"Buffer","data":[13,4,26,12,128,148,60,25,115,149,122,135,201,141,2,101,87,68,185,10]},"announce":[],"urlList":[]}}