{"title":"Vegan Eats World 300 International Recipes for Savoring the Plan","uid":13698767,"size":11279358,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d1955e0b300f6f54f6babf1ed975d63f51a105e&amp;dn=Vegan+Eats+World+300+International+Recipes+for+Savoring+the+Plan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alaj","files":1,"time":1456740905,"description":"What If the World Was Vegan?\r\nThe true building blocks of cuisines across the planet are the spices, herbs, and grains—from basmati rice to buckwheat, coconut to caraway seeds. Apply those flavors to vegan staples such as seitan, or tofu and even straight-up vegetables, and the possibilities? If not endless, pretty darned expansive.\r\nSo what if the world was vegan? Your own cooking is the answer to that question; fire up the stove and make a green curry, simmer a seitan date tagine stew, or hold a freshly made corn tortilla piled high with chile-braised jackfruit in your hand. Chart your course in the great, growing map of vegan food history.\r\n\r\nAward-winning chef, author of Veganomicon, and author of Viva Vegan Terry Hope Romero continues the vegan food revolution with more than 300 bold, delicious recipes based on international favorites. With chapters devoted to essential basics such as Spice Blends; The Three Protein Amigos; and Pickles, Chutneys &amp; Saucier Sauces, you can make everything from salads to curries, dumplings and desserts. Vegan Eats World will help you map your way through a culinary world tour, whether you want to create a piergoi party or Thai feast, easy Indian chaat lunch or Your International House of Dinner Crepes","torrent":{"xt":"urn:btih:0d1955e0b300f6f54f6babf1ed975d63f51a105e","amp;dn":"Vegan+Eats+World+300+International+Recipes+for+Savoring+the+Plan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d1955e0b300f6f54f6babf1ed975d63f51a105e","infoHashBuffer":{"type":"Buffer","data":[13,25,85,224,179,0,246,245,79,107,171,241,237,151,93,99,245,26,16,94]},"announce":[],"urlList":[]}}