{"title":"The First Annual Grand Prairie Rabbit Festival.epub","uid":9198800,"size":413318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d8d86eba2f81b6fefb4615aca2080b796f3df02&amp;dn=The+First+Annual+Grand+Prairie+Rabbit+Festival.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384541808,"description":"Welcome to Grand Prairie, Louisiana -- land of confounding accents, hard-drinking senior citizens, and charming sinners -- brought to hilarious life in a bracing, heartfelt debut novel simmering with Cajun spice... \n\nFather Steve Sibille has come home to the bayou to take charge of St. Pete's church. Among his challenges are teenybopper altar girls, insomnia-curing confessions, and alarmingly alluring congregant Vicky Carrier. Then there's Miss Rita, an irrepressible centenarian with a taste for whiskey, cracklins, and sticking her nose in other people's business. \n\nWhen an outsider threatens to poach Father Steve's flock, Miss Rita suggests he fight back by staging an event that will keep St. Pete's parishioners loyal forever. As The First Annual Grand Prairie Rabbit Festival draws near, help comes from the strangest places. And while the road to the festival may be paved with good intentions-not to mention bake sales, an elephant, and the most bizarre cook-out ever-where it will lead is anyone's guess . . .\nQuote:","torrent":{"xt":"urn:btih:0d8d86eba2f81b6fefb4615aca2080b796f3df02","amp;dn":"The+First+Annual+Grand+Prairie+Rabbit+Festival.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8d86eba2f81b6fefb4615aca2080b796f3df02","infoHashBuffer":{"type":"Buffer","data":[13,141,134,235,162,248,27,111,239,180,97,90,202,32,128,183,150,243,223,2]},"announce":[],"urlList":[]}}