{"title":"Goldrake S1e27-32, [DVD5 - ITA JAP] DVD 5 of 12","uid":4898514,"size":4558321664,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0de8588dda3c2b127506a6cdb8506bbf13e5f034&amp;dn=Goldrake+S1e27-32%2C+%5BDVD5+-+ITA+JAP%5D+DVD+5+of+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Addoxx","files":15,"time":1242485862,"description":"Atlas Ufo Robot (a.k.a. Goldrake)\n\n\nTitolo originale [UFO Robo Grendizer]\nTitolo italiano Atlas Ufo Robot (a.k.a. Goldrake)\nNumero di episodi 74 (27 della prima serie, 47 della seconda)\nStudio di produzione Toei Doga\nAutore Go Nagai\nDirettore dell'animazione Toshio Ketsuta\nDisegnatori Kazuo Komatsubara (primi 48 episodi); Shingo Araki (i rimanenti)\nColonna sonora Shunsuke Kikuchi (gli arrangiamenti alle scene sono di Shozo Uehara e Keisuke Fujikawa)\nRegisti Tomoharu Katsumata, Masamune Ochiai and Masayuki Akemi\nAnni di produzione Dal 1975 al 1977\nCopyright Ã‚Â© Go Nagai/Dynamic Planning - Toei Animation\n\n\nTrama\n\nEpisodio 27: Il contrattacco di Goldrake\n\nGoldrake danneggiato dall'attacco dei mostri di Vega deve ritirarsi in una caverna per eseguire le riparazioni all'astronave, Hydargos con i suoi uomini occupa il centro di ricerche e sottopone il Dr. Procton a tortura per fargli rivelare il nascondiglio di Goldrake.. Venusia con grande sprezzo del pericolo riesce prima a portare ad Actarus un pezzo di ricambio per la riparazione del robot, e quindi attira con uno stratagemma le forze di Vega lontano dalla base. Gandal che frattanto ÃƒÂ¨ sceso sulla terra per seguire da vicino le operazioni capisce il trucco ma ormai ÃƒÂ¨ tardi, Goldrake attacca e distrugge le forze nemiche, Hydargos protegge la fuga del proprio comandante rimanendo ucciso nel rogo della sua astronave, Gandal con gravi ustioni al volto riesce a fuggire giurando vendetta.\n\nEpisodio 28: L'invasione degli umonoidi\n\nIl ministro delle scienze Zuril viene inviato da Vega sulla base lunare per sostituire Hydargos e collaborare con Gandal al piano di invasione della Terra, Zuril progetta un attacco a Goldrake da parte di piccoli robot umanoidi che possono riunirsi e formare un mostro da combattimento, la manovra sembra avere effetto ma Goldrake dopo un primo momento di difficoltÃƒÂ  riesce a spuntarla.\n\nEpisodio 29: Un amico dallo spazio\n\nIl capitano Aruk della stella Delta, si sottopone all'azione del convertitore biologico ed uno speciale processo lo trasforma in un bambino terrestre. Il suo compito ÃƒÂ¨ quello di stringere amicizia con Mizar per spiare il centro spaziale. Aruk che ama i colombi ÃƒÂ¨ costretto ad ucciderne uno per trasformarlo in un robot elettronico allo scopo di spiare i movimenti del centro, Mizar frattanto scopre il segreto di Aruk che perÃƒÂ² gli risparmia la vita e salito a bordo del suo disco da combattimento affronta Goldrake che dopo un duro scontro esce vittorioso.\n\nEpisodio 30: La cicatrice rossa\n\nUn mostro galattico proveniente dalla stella Goda viene inviato a distruggere Goldrake; frattanto Actarus rimane ferito ad un braccio a seguito di un incidente, il trauma provoca il risveglio di una vecchia ferita causata dallo scoppio di una bomba protonica durante l'invasione della stella Fleed. Actarus stoicamente si batte contro il mostro Goda dotato di una nuova potentissima arma,e nonostante il dolore al braccio riesce a distruggerlo.\n\nEpisodio 31: Un robot per Alcor\n\nBoss l'amico di Alcor decide di donargli il proprio robot per combattere contro le forze di Vega i due saranno protagonisti con Goldrake di una dura battaglia per respingere ancora una volta l'attacco degli spaziali.\n\nEpisodio 32: Un miraggio mortale\n\nGli scienziati di Vega hanno messo a punto una macchia in grado di produrre miraggi, cosÃƒÂ¬ facendo cercano di ingannare Actarus facendogli apparire la cittÃƒÂ  di Fleed e sua madre che in realtÃƒÂ  ÃƒÂ¨ una guerriera di Vega che deve ucciderlo, Actarus sta per cadere in trappola ma all'ultimo momento si accorge del trucco e distrugge i suoi nemici.","torrent":{"xt":"urn:btih:0de8588dda3c2b127506a6cdb8506bbf13e5f034","amp;dn":"Goldrake+S1e27-32%2C+%5BDVD5+-+ITA+JAP%5D+DVD+5+of+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0de8588dda3c2b127506a6cdb8506bbf13e5f034","infoHashBuffer":{"type":"Buffer","data":[13,232,88,141,218,60,43,18,117,6,166,205,184,80,107,191,19,229,240,52]},"announce":[],"urlList":[]}}