{"title":"The Holocaust Encyclopedia","uid":11775186,"size":10872542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f00110eaf48717989f43bda5a11155d9b4a5724&amp;dn=The+Holocaust+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427254251,"description":"The Holocaust has been the subject of countless books, works of art, and memorials. Fiftyfive years after the fact the world still ponders the enormity of this disaster. The Holocaust Encylopedia is the only comprehensive single-volume work of reference providing both a reflective overview of the subject and abundant detail concerning major events, policy, decisions, cities, and individuals, Up-to-date and designed for easy access, the encyclopedia presents information on the major aspects of the Holocaust in essays by scholars from eleven countries who draw on a number of sources - including recently uncovered evidence from the former Soviet bloc - to provide in-depth studies on the political, social, religious, and moral issues of the Holocaust as well as short entries identifying events, sites, and individuals. The book also has more than 250 photographs, many of them rare, and 19 maps. The volume includes: Raul Hilberg on concentration camps and Gypsies; Ruth Bondy, Israel Gutman, and Dina Porat on major ghettoes; Roger Greenspun on the Holocaust in cinema and television; Richard Breitman on American policy; Michael Berenbaum on theological and philosophical responses; Saul Friedlander on Nazi policy; Michael Hagemeister on the Protocols of the Elders of Zion; Michael R. Marrus on historiography; Christopher R. Browning on the Madagascar Plan; Robert S. Wistrich on Holocaust denial; James E. Young on Holocaust literature","torrent":{"xt":"urn:btih:0f00110eaf48717989f43bda5a11155d9b4a5724","amp;dn":"The+Holocaust+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f00110eaf48717989f43bda5a11155d9b4a5724","infoHashBuffer":{"type":"Buffer","data":[15,0,17,14,175,72,113,121,137,244,59,218,90,17,21,93,155,74,87,36]},"announce":[],"urlList":[]}}