{"title":"Harlem River Drive - Harlem River Drive (1971) V0","uid":8641234,"size":65118823,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:104dbbc29794d3377ae42f56a078376f39fcda01&amp;dn=Harlem+River+Drive+-+Harlem+River+Drive+%281971%29+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1372882283,"description":"2005 - Stateside / 0946 333986 2 7 / Stereo / CD\n\nmp3 V0\n\nA legendary Latin funk album -- spearheaded by Eddie Palmieri! The record is a landmark crossover album from the early 70s -- cut at the end of the Latin soul era, but featuring that genre's wonderful mix of Puerto Rican soul, Spanish Harlem Latin, and New York funk. The grooves are all nice and long -- with plenty of hard jamming, and soulful lyrics in English that have a very positive message. All tracks are great -- and titles include &quot;Seeds Of Life&quot;, &quot;Harlem River Drive&quot;, and &quot;Idle Hands&quot;. Eddie Palmieri plays piano, and the group grooves hard with a killer Latin funk sound!\n\n# Audio CD (May 29, 2006)\n# Original Release Date: 1971\n# Number of Discs: 1\n\nTrack Listings\n1. Harlem River Drive (Theme Song)\n2. If (We Had Peace Today)\n3. Idle Hands\n4. Broken Home\n5. Seeds of Life\n\nThe reason this record is &quot;legendary&quot; is because it marks the first recorded performances, in 1970, of Eddie and Charlie Palmieri as bandleaders. The reason it should be a near mythical recording (it has never been available in the U.S. on CD, and was long out of print on LP before CDs made the scene), is for its musical quality and innovation. The Palmieris formed a band of themselves, a couple of Latinos that included Andy Gonzales, jazz-funk great -- even then -- Bernard &quot;Pretty&quot; Purdie, and some white guys and taught them how to play a music that was equal parts Cuban mambo, American soul via Stax/Volt, blues, Funkadelic-style rock, pop-jazz, and harmonic and instrumental arrangements every bit as sophisticated as Burt Bacharach's or Henry Mancini's or even Stan Kenton's. One can hear in &quot;Harlem River Drive (Theme)&quot; and &quot;Idle Hands&quot; a sound akin to War's on World Is a Ghetto. Guess where War got it? &quot;If (We Had Peace)&quot; was even a model for Lee Oskar's &quot;City, Country, City.&quot; And as much as War modeled their later sound on this one record, as great as they were, they never reached this peak artistically. But there's so much here: the amazing vocals (Jimmy Noonan was in this band), the multi-dimensional percussion section, the tight, brass-heavy horn section, and the spaced-out guitar and keyboard work (give a listen to &quot;Broken Home&quot;) where vocal lines trade with a soprano saxophone and a guitar as snaky keyboards create their own mystical effect. One can bet that Chick Corea heard in Eddie's piano playing a stylistic possibility for Return to Forever's Light As a Feather and Romantic Warrior albums. The band seems endless, as if there are dozens of musicians playing seamlessly together live -- dig the percussion styling of Manny Oquendo on the cowbell and conga and the choral work of Marilyn Hirscher and Allan Taylor behind Noonan. Harlem River Drive is a classic because after 30-plus years, it still sounds as if listeners are the ones catching up to it. It's worth every dime you pay for it, so special order it today. ","torrent":{"xt":"urn:btih:104dbbc29794d3377ae42f56a078376f39fcda01","amp;dn":"Harlem+River+Drive+-+Harlem+River+Drive+%281971%29+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"104dbbc29794d3377ae42f56a078376f39fcda01","infoHashBuffer":{"type":"Buffer","data":[16,77,187,194,151,148,211,55,122,228,47,86,160,120,55,111,57,252,218,1]},"announce":[],"urlList":[]}}