{"title":"Mortal Kombat novels","uid":8004561,"size":2088059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:116bae63f50e84e1ccd27b2e9ec058c09923e452&amp;dn=Mortal+Kombat+novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MegaGeoff","files":12,"time":1357857321,"description":"This is a collection of Mortal Kombat novels in EPUB and MOBI formats.\n\n\nThe books included:\n\n\n\n*Mortal Kombat by Jeff Rovin*\n\nSummary - Finally, in this all-new, original novel, the unknown origins of your favorite heroes and villains - the brave Liu Kang, the lethal Sonya Blade, and the vile Shang Tsung. Now their stories can be told: who they are, where they came from, what secrets they hide. And how they fought for a mysterious amulet that held the key to their future. The future of Mortal Kombat!\n\n\n\n\n*Mortal Kombat: The Movie (novelezation) by Martin Delrio*\n\nSummary - Once every generation, the tournament is held: the ultimate martial arts competition in which mortal warriors must fight against many supernatural opponents to defend the earth from evil forces.\n\nNow three young mortals have come to compete in the tournament.\n\nThey are Liu Kang, raised as a fighting monk; Johnny Cage, an American movie star; and Sonya Blade, a beautiful U.S. Special Forces agent who seeks revenge on her deadly enemy Kano.\n\nWith the help of the immortal thunder god Rayden, the mortals must conquer their inner fears to defeat Goro, the four-armed warrior prince, and save humanity from the dreaded sorcerer Shang Tsung.\n\nWith over a dozen exciting photos from the hit movie!\n\n\n\n*Mortal Kombat: Annihilation (novelization) by Jerome Preisle\n\nSummary - Earth's champions won MORTAL KOMBAT, but Shao Kahn, the evil emperor of Outworld, refuses to accept defeat. He has invaded our world with his inhuman warriors, including the undead Queen Sindel and Sheeva, a beautiful, towering, four-armed fighting machine.\n\n\n","torrent":{"xt":"urn:btih:116bae63f50e84e1ccd27b2e9ec058c09923e452","amp;dn":"Mortal+Kombat+novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"116bae63f50e84e1ccd27b2e9ec058c09923e452","infoHashBuffer":{"type":"Buffer","data":[17,107,174,99,245,14,132,225,204,210,123,46,158,192,88,192,153,35,228,82]},"announce":[],"urlList":[]}}