{"title":"Various Artists - Absolutely Irish [flac]","uid":7660752,"size":392571418,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11e254f78055cdef22125d400a4aa3d9ee8c4b9b&amp;dn=Various+Artists+-+Absolutely+Irish+%5Bflac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"rambam1776","files":-1,"time":1348296996,"description":"As seen on public television.Absolutely Irish! brings together the brightest stars of traditional Irish music for a once-in-a-lifetime concert that will leave folk music fans stunned by the virtuoso performances.In April 2007 at the Irish Arts Center in the fabled Hell's Kitchen area of New York City, film maker Paul Wagner and musician and producer Mick Moloney brought some of the finest Irish musicians, singers and dancers in America together for a special one-off concert. All the artists had known one another and played together in various combinations for years, but this was a chance to meet up in an informal situation and simply have fun, make music and dance together. For two days they rehearsed and then put together a magical performance that was filmed for American Public Television and recorded for Compass Records. Absolutely Irish is the product of this astonishingly brilliant, exuberant and joyful celebration of the very best of Irish music, song and dance.\n\n\nFeaturing Mick Moloney, Susan McKeown, John Doyle, SÃƒÂ©amus Egan, Eileen Ivers, Karan Casey, Liz Carroll, Joanie Madden, Athena Tergis, Robbie O Connell, Niall O Leary, Darrah Carr, Jerry O Sullivan, Billy McComiskey, Brendan Dolan, Rhys Jones, Tim Collins, Mac Benford, Mike Rafferty and Jo McNamara.\n\n01 - The House in the Glen-The Bohola Jig-Josie McDermott's-Free and Easy\n02 - The King's Shilling\n03 - Before the Storm-The Black Rouge-The Lass of Ballintra- The (Other) High Reel\n04 - McNally's Row of Flats\n05 - The Green Hills of Tyrol-The Fermoy Lassies-The Pinch of Snuff\n06 - Jim O'Keefe's-The Clog-The Star Above the Garter-The Hare in the Corn\n07 - June Apple\n08 - The Flower of Kilkenny\n09 - Planxty Miss Maxwell\n10 - Lark in the Morning-Cannabahn Ban-Humours of Ballyloughlin\n11 - Fair London Town\n12 - Kitty O'Neill's Champion Jig\n13 - The Trip to Parliament-The Torn Jacket\n14 - Fiddle Extraveganza Never Was Piping So Gay-The Chandelier-Paddy Fahey's #25-Paddy Fahey's\n15 - The Leaving of Liverpool","torrent":{"xt":"urn:btih:11e254f78055cdef22125d400a4aa3d9ee8c4b9b","amp;dn":"Various+Artists+-+Absolutely+Irish+%5Bflac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e254f78055cdef22125d400a4aa3d9ee8c4b9b","infoHashBuffer":{"type":"Buffer","data":[17,226,84,247,128,85,205,239,34,18,93,64,10,74,163,217,238,140,75,155]},"announce":[],"urlList":[]}}