{"title":"Magnus Karlsson's Free Fall - Kingdom Of Rock (Japanese Edition)","uid":12628173,"size":143193073,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:125007be8fdbba39cffbd3577d5b2eff3c4eecd2&amp;dn=Magnus+Karlsson%27s+Free+Fall+-+Kingdom+Of+Rock+%28Japanese+Edition%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":13,"time":1445801300,"description":"\nMagnus Karlsson's Free Fall - Kingdom Of Rock (2015)320ak\r\n\r\nFree Fall is the first full-length studio album by Swedish heavy metal songwriter, guitarist, multi-instrumentalist and producer Magnus Karlsson.\r\n\r\nIt was released under the project name Magnus Karlsson's Free Fall on June 11 2013 in North America and June 14 in Europe by Frontiers Records and features many guest singers who worked with Magnus on his many previous projects, including Russell Allen (one of the singers of the duo Allen/Lande), Ralf Scheepers (vocalist of Primal Fear, Magnus current band), Tony Harnell (who worked with Magnus in the band Starbreaker), Rickard Bengtsson (former bandmate from Last Tribe), Mark Boals (who worked with Magnus in the project The Codex), Mike Andersson (who worked with Magnus in the project Planet Alliance) and some other famous friends like David Readman (Pink Cream 69, Voodoo Circle), Rick Altzi (At Vance, Masterplan) and Herman Saming (A.C.T).\r\n\r\nMagnus also sings three tracks on the album himself and Daniel Flores (who also worked with Magnus in the project The Codex) recorded the drums.\r\n\r\nALBUM: Kingdom Of Rock (Japanese Edition)\r\n\r\nYEAR: 2015\r\n\r\nCOUNTRY: Sweden\r\n\r\nSTYLE: Metal\r\nLABEL: Avalon - MICP-11248\r\n\r\nTime: 00:59:32\r\nFORMAT: MP3\r\nQUALITY: 320 kbps\r\n\r\nTracklist\r\n\r\n1. Kingdom Of Rock (feat. Jorn Lande) (5:25)\r\n2. Out Of The Dark (feat. Jakob Samuel) (4:23)\r\n3. No Control (feat. Joe Lynn Turner) (4:37)\r\n4. When The Sky Falls (feat. Tony Martin) (5:58)\r\n5. Angel Of The Night (feat. David Readman) (4:12)\r\n6. I Am Coming For You (feat. Magnus Karlsson) (5:29)\r\n7. Another Life (feat. Rick Altzi) (4:54)\r\n8. Never Look Away (feat. Tony Harnell) (5:06)\r\n9. A Heart So Cold (feat. Harry Hess) (4:40)\r\n10. The Right Moment (feat. Rebecca De La Motte) (4:48)\r\n11. Walk This Road Alone (feat. Magnus Karlsson) (5:16)\r\n12. No Control (Acoustic Version) (Japan Bonus Track) (4:44)\r\n\r\nPersonnel\r\n\r\nMagnus Karlsson - Guitar, Bass Guitar, Keyboards &amp; Producer, Backing vocals, Lead vocals on tracks 3, 8, 12 &amp; 13\r\nDaniel Flores - Drums, Mixing\r\n\r\nGuests Singers\r\n\r\nRussell Allen (Symphony X, Allen-Lande, Adrenaline Mob) - lead vocals on track 1\r\nRalf Scheepers (Primal Fear, ex-Gamma Ray) - lead vocals on track 2\r\nTony Harnell (Starbreaker, Westworld, ex-TNT) - lead vocals on track 4\r\nRick Altzi (At Vance, Masterplan, ex-Thunderstone) - lead vocals on track 5\r\nDavid Readman (Pink Cream 69, Voodoo Circle, ex-Adagio) - lead vocals on track 6\r\nMark Boals (The Codex, ex-Yngwie Malmsteen band, ex-Royal Hunt) - lead vocals on track 7\r\nRickard Bengtsson (Last Tribe) - lead vocals on track 9\r\nHerman Saming (A.C.T) - lead vocals on track 10\r\nMike Andersson (Planet Alliance, Cloudscape, Full Force) - lead vocals on track 11","torrent":{"xt":"urn:btih:125007be8fdbba39cffbd3577d5b2eff3c4eecd2","amp;dn":"Magnus+Karlsson%27s+Free+Fall+-+Kingdom+Of+Rock+%28Japanese+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"125007be8fdbba39cffbd3577d5b2eff3c4eecd2","infoHashBuffer":{"type":"Buffer","data":[18,80,7,190,143,219,186,57,207,251,211,87,125,91,46,255,60,78,236,210]},"announce":[],"urlList":[]}}