{"title":"[Norman_I._Badler]Simulating Humans Computer Graphics Animation ","uid":11047376,"size":2188437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:129e7ac44979dec73034e277ec628a2869f8e2a6&amp;dn=%5BNorman_I._Badler%5DSimulating+Humans+Computer+Graphics+Animation+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410968630,"description":"During the past decade, high-performance computer graphics have found application in an exciting and expanding range of new domains. Among the most dramatic developments has been the incorporation of real-time interactive manipulation and display for human figures. Though actively pursued by several research groups, the problem of providing a synthetic or surrogate human for engineers and designers already familiar with computer-aided design techniques was most comprehensively solved by Norman Badler's computer graphics laboratory at the University of Pennsylvania. The breadth of that effort as well as the details of its methodology and software environment are presented in this volume. The book is intended for human factors engineers interested in understanding how a computer-graphics surrogate human can augment their analyses of designed environments. It will also inform design engineers of the state of the art in human figure modeling, and hence of the human-centered design central to the emergent concept of concurrent engineering. In fulfilling these goals, the book additionally documents for the entire computer graphics community a major research effort in the interactive control of articulated human figures.\n\nPublisher: Oxford University Press (June 17, 1993)\nLanguage: English\nISBN-10: 0195073592\nISBN-13: 978-0195073591\n\nEditorial Reviews\nReview\n\n&quot;The book achieves [its] objectives.&quot; --SCS Simulator Quarterly\n\n\n&quot;Useful to human factors engineers . . . . Recommended.&quot; --Science &amp; Technology\n\n\n&quot;The book is both entertaining and informative. One can read it for a general overview, while noting the wealth of detail available for specific topics.&quot; --Computing Reviews\n\n\nAbout the Author\nNorman I. Badler, Cary B. Phillips, and Bonnie Lynn Webber are all at University of Pennsylvania. ","torrent":{"xt":"urn:btih:129e7ac44979dec73034e277ec628a2869f8e2a6","amp;dn":"%5BNorman_I._Badler%5DSimulating+Humans+Computer+Graphics+Animation+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129e7ac44979dec73034e277ec628a2869f8e2a6","infoHashBuffer":{"type":"Buffer","data":[18,158,122,196,73,121,222,199,48,52,226,119,236,98,138,40,105,248,226,166]},"announce":[],"urlList":[]}}