{"title":"07.11.30.Living.Landscapes.Costa.Rica.720p.WMV-HD@silu","uid":3914704,"size":4185305173,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:12ecd03c6c97aba212f92a2ad4d1d463519186b0&amp;dn=07.11.30.Living.Landscapes.Costa.Rica.720p.WMV-HD%40silu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"weiguo_x","files":7,"time":1196404260,"description":"Descend into the mists of Costa Rica&amp;#039;s cloud forest. Feel the swirling moisture nourish this lush ecosystem as a surround-sound symphony of life fills the room. Experience the Osa Peninsula&amp;#039;s lowland Rainforest where brilliant scarlet macaws and sleepy sloths dwell in one of the most bio-diverse places Earth. Feast your eyes on brilliant golds and reds against an infinite backdrop of lush green. Your senses become intoxicated with the sweet, heady nectar of the jungle. Catch bright strokes of color streaking across tropical skies! Iridescent butterflies flit through the air like flowers on wings.\n\nOsa Peninsula\nThis is one of the most bio-diverse locations on Earth. Experience the inhabitants of this diverse lowland rainforest, from the rare Scarlet Macaw to the strange and elusive sloth.\n\nMonte Verde Cloud Forest\nDescend into the life giving mist of the Costa Rican cloud forest. Feel the swirling moisture nourishing this lush ecosystem as a symphony of life fills the room.\n\nTropical Flowers\nFeast your eyes on an amazing diversity of brillant, vibrant colors against a backdrop of infinite green. Your senses become intoxicated with the sweet, heady scent of jungle nectar.\n\nBird and Butterflies\nCatch bright strokes of color streaking across tropical skies! Iridescent flashes of hummingbirds fill the air, like flowers with wings.","torrent":{"xt":"urn:btih:12ecd03c6c97aba212f92a2ad4d1d463519186b0","amp;dn":"07.11.30.Living.Landscapes.Costa.Rica.720p.WMV-HD%40silu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12ecd03c6c97aba212f92a2ad4d1d463519186b0","infoHashBuffer":{"type":"Buffer","data":[18,236,208,60,108,151,171,162,18,249,42,42,212,209,212,99,81,145,134,176]},"announce":[],"urlList":[]}}