{"title":"David Brat - 2005 - Philosophy of Economics (unpublished)","uid":10341325,"size":286359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12f44873844ff9bca4e1397f52dec73337862d4e&amp;dn=David+Brat+-+2005+-+Philosophy+of+Economics+%28unpublished%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WillKane","files":1,"time":1402544092,"description":"We have heard the propagandists on Professor Brat and his Tea Party defeat of establishment, pro-amnesty RiNO Eric Cantor, now let's read from the Professor himself!\n\n\nDavid Brat - Philosophy of Economics - History of Science Method and Ethics\n\nBook Abstract\nThe goal of this reader is to help you to understand the relation between the realm of philosophical ethics and the academic field of economics, within the context of the liberal arts education. Notice that the goal is not to teach any certain system of ethics. Nor is this a book on business ethics. Rather the goal is to explain whether ethics is possible at all within the field of economics as it has emerged over the past century.\nThe introduction at the beginning of the book as well as the introductions to the three sections of this book will also attempt to tie the material together as you progress through this line of economic thought. We will find that among these eminent economists, there are many definitions of what economics is and also of what economics should be. From these famous definitions of economics, these chapters will begin to make the logical connections between economics and the possibility of ethics.\nIntroduction\nI. Early Definitions and Methods for Political Economy\nTwo Treatises on Civil Government: The Rational and the Industrious\nJohn Locke - 1722\nThe Wealth of Nations: Self-Interest and the Common Good\nAdam Smith - 1776\nOn the definition and method of political economy.\nJohn Stuart Mill - 1836\nPrinciples of Economics: Book I The Social Context of Economics\nAlfred Marshall - 1890\nObjectivity and understanding in economics.\nMax Weber - 1904\nThe nature and significance of economic science.\nLionel Robbins - 1935\n2\nII. Logical Positivism as the Method for Economic Science\nA Logical Positivist - On Verification in Economics\nTerence Hutchison - 1956\nA Logical Empiricist with an Instrumentalist Twist - The Methodology of Positive Economics\nMilton Friedman 1953\nResponse:\nA Necessary Evil in Economic Science - Testability and Approximation\nHerbert Simon - 1963 A Critical Response to Friedman\nIII. Values, Conversations, Rhetoric and Ethics\nWhat is an Economic Fact? - Implicit Values in Economics\nGunnar Myrdal - 1954\nAn Assessment of Adam Smith, John Maynard Keynes &amp; Karl Marx: Science and Ideology.\nJoseph Schumpeter - 1949\nThe Rhetoric of Economics\nDonald McCloskey - 1983\nConversations with Economists - (Lucas 95, Tobin 81, Modigliani 85 &amp; Solow 87)\nArjo Klamer - 1984\nRhetoric and Ideology\nRobert Heilbroner - 1988\nEminent Economists: Their Life Philosophies.\nMichael Szenberg - 1992\n1) Kenneth Arrow -  I Know a Hawk from a Handsaw\n2) James M. Buchanan - From the Inside Looking Out\n3) Paul A. Samuelson - My Life Philosophy: Policy Credos and Working Ways\n\n","torrent":{"xt":"urn:btih:12f44873844ff9bca4e1397f52dec73337862d4e","amp;dn":"David+Brat+-+2005+-+Philosophy+of+Economics+%28unpublished%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f44873844ff9bca4e1397f52dec73337862d4e","infoHashBuffer":{"type":"Buffer","data":[18,244,72,115,132,79,249,188,164,225,57,127,82,222,199,51,55,134,45,78]},"announce":[],"urlList":[]}}