{"title":"ExploitedCollegeGirls - Bailey {First Scene}","uid":7420109,"size":961685153,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:13b760ae42eaec821e96d981a89f54b31533b1dc&amp;dn=ExploitedCollegeGirls+-+Bailey+%7BFirst+Scene%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Xavier461","files":1,"time":1341638557,"description":"Screenshots\n &lt;a href=&quot;\nhttp://imagetwitch.com/exploitedcollegegirls-bailey-first-scene/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagetwitch.com/exploitedcollegegirls-bailey-first-scene/&lt;/a&gt;\n\n\n\nSize: 961685153 bytes (917.13 MiB), duration: 01:25:04, avg.bitrate: 1507 kb/s\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\nVideo: wmv3, yuv420p, 576x324, 1400 kb/s, 29.97 fps\n\n\nSchool: University of Arizona\nYear: Freshman\nAge: 18\nHeight: 5-4&quot;\nFigure: 34B-28-32\nEyeColor: Hazel\nFavorite Sexual Position: On Top\nHobbies: Snowboarding, Hiking, Camping\nABOUT\n\nYou asked and you have now received...I've combined all the footage from the POV and the room cameras into one convenient movie for you. It's the best of both worlds, and edited for your maximum viewing pleasure. You will also find the Behind the Scenes movie and clips right on this page as well. Love to get feedback from you about it!\nMan, lately I'm having such amazing luck with the little sluts knocking at my door. Up today is Bailey, just 18 years old and currently enrolled at University of Arizona in Tucson. This girl is trouble, I tell you!\nI'm not kidding when I say that less than five minutes in my car Bailey is sucking my cock. The girl really, truly loves sex. Luckily the cop that pulled by didn't pay attention. We're then doing the interview portion outside (all the personal details you wanna hear - and then some!). I make her masturbate a little but then can't help it and I just gotta have her suck me off. She gets me rock hard and I shove my cock in her pussy - and promptly cum on her face. No girl has ever made me cum that quick. She's walking back to the car with me, covered in cum and buck naked. And that's just the first few minutes of the day with Bailey. Oh it gets much kinkier...\nThe interview and chit chat bullshit out of the way, the actual movie starts with Bailey being introduced to her new best friend, the Rabbit. She loves the fucking vibrator and keeps having one orgasm after another. Having gotten a taste of her pussy earlier I lick her pussy some more and then shove my cock in her moist snatch, then have her masturbate with the vibrator some more while she's giving me head. And we're not gonna stop there - Bailey is such a great little cock sucker I have her do it again, and she even takes my infamous deep throat antics (pretty) well. A bit o' tears, that's it. LOL!And Bailey has absolutely zero problems licking my ass either, and I'm talking deep tongue and everything. Unfuckingbelievable!\nI fuck the shit out of the little whore and she keeps cumming back for more. She orgasms again when she rides my cock (watch the grinding!) and then it's time for me to unload cum load number two on her pretty face.\nSeriously, Bailey was one great fuck and I know you'll enjoy her as much as I did! ","torrent":{"xt":"urn:btih:13b760ae42eaec821e96d981a89f54b31533b1dc","amp;dn":"ExploitedCollegeGirls+-+Bailey+%7BFirst+Scene%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b760ae42eaec821e96d981a89f54b31533b1dc","infoHashBuffer":{"type":"Buffer","data":[19,183,96,174,66,234,236,130,30,150,217,129,168,159,84,179,21,51,177,220]},"announce":[],"urlList":[]}}