{"title":"The Withered Vine: Logistics and the Communist Insurgency in Gre","uid":8622288,"size":3366102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:143e053e46d134cf60a49c0609d7852681c7573d&amp;dn=The+Withered+Vine%3A+Logistics+and+the+Communist+Insurgency+in+Gre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1372408880,"description":"\n\nAn explanation of the failure of the Communist insurgency in Greece between 1945 and 1949, this study provides a striking lesson in what happens to an armed revolutionary movement when it lacks adequate manpower and logistical resources, and is divided against itself on such basic matters as foreign policy and the employment of its military capabilities. During the period of 1945-1949, the Greek Communist Party was split into competing factions, each with its own idea of which course the rebellion should take. The Stalinist faction, led by Secretary-General Nikos Zachariades, was pitted against the more pragmatic nationalist wing led by the commander of the Greek Democratic Army, Markos Vafiades. Shrader provides a detailed examination of the logistical aspects of the war, particularly the impact of political decisions and the aid provided to the Greek Communists by outside supporters on logistics and operations.\n\nAt each successive stage of the conflict, Zachariades outmaneuvered his rivals and imposed policies that both reduced the resources available to the Communist-led insurgents and sought to turn an effective guerrilla force into a conventional army employing conventional operational methods. The decisions taken by the Greek Communist Party under Zachariades' leadership alienated both the domestic supporters of the Communist rebellion and its key external supporters, such as Marshal Tito of Yugoslavia. Ultimately, the conventionally organized Greek Democratic Army proved unable to sustain itself logistically, and it was defeated in August 1949 by the constantly improving Greek National forces aided by the United States.\n\n# Hardcover: 352 pages\n# Publisher: Praeger (December 30, 1999)\n# Language: English\n# ISBN-10: 0275965449\n# ISBN-13: 978-0275965440","torrent":{"xt":"urn:btih:143e053e46d134cf60a49c0609d7852681c7573d","amp;dn":"The+Withered+Vine%3A+Logistics+and+the+Communist+Insurgency+in+Gre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"143e053e46d134cf60a49c0609d7852681c7573d","infoHashBuffer":{"type":"Buffer","data":[20,62,5,62,70,209,52,207,96,164,156,6,9,215,133,38,129,199,87,61]},"announce":[],"urlList":[]}}