{"title":"Japanese For Busy People - Workbook","uid":6723529,"size":48459562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14d66138911e8aee9300d5bd69e56c89f0c3b022&amp;dn=Japanese+For+Busy+People+-+Workbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kraxXen01","files":99,"time":1317872616,"description":"Japanese for Busy People is the most popular Japanese language textbook series in the world. With over 20 components including texts, workbooks, CDs, videos and teacher\\'s manuals, it is also one of the most comprehensive. Now, a decade after its first revision, the entire series is being redesigned, updated and consolidated to meet the needs of 21st-century students and businesspeople who want to learn natural, spoken Japanese as effectively as possible in a limited amount of time.\n\nThe book features not only a sleek, new design but also a unit structure that groups thematically linked lessons together, making it easier than ever to learn Japanese.\nMoreover, it now comes with a CD containing audio for the dialogues and listening exercises from the text. The exercises in the book have also been thoroughly revised to incorporate more comprehension and production tasks. Many of these exercises are illustrated, making for a stimulating learning experience, and the purpose of each one is clearly stated.\n\nThis first of three volumes introduces \\&quot;survival Japanese\\&quot;-the absolute minimum amount of Japanese needed to live in Japan. Thus, the vocabulary and grammatical items it introduces are limited to about a third of what is typically introduced in a first-year course. In addition, the book features notes on Japanese culture intended to expand the learner\\'s understanding of Japan, its customs and people.\n\nJapanese for Busy People I is available in two formats: romanized and kana.\nThe Romanized Version uses romanized Japanese throughout, with kana in the Opening Dialogues of each lesson.\nThe Kana Version-exposing students to hiragana and katakana from the very beginning-uses only kana.The content of the two books is otherwise exactly the same.\n\nThe companion volume, Japanese for Busy People 1: The Workbook for the Revised 3rd Edition contains a variety of illustrated exercises for mastering the basic sentence patterns presented in the main text. \n\n\n\nFree knowledge. Enjoy.","torrent":{"xt":"urn:btih:14d66138911e8aee9300d5bd69e56c89f0c3b022","amp;dn":"Japanese+For+Busy+People+-+Workbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d66138911e8aee9300d5bd69e56c89f0c3b022","infoHashBuffer":{"type":"Buffer","data":[20,214,97,56,145,30,138,238,147,0,213,189,105,229,108,137,240,195,176,34]},"announce":[],"urlList":[]}}