{"title":"Taxi.Driver.1976.1080p.BluRay.x264.DTS-SARTRE","uid":13576658,"size":5015975713,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:15c03dfec4e9393dfc19a93d114a8b7233ef0e4a&amp;dn=Taxi.Driver.1976.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sartre7","files":9,"time":1455716266,"description":"&quot;All the animals come out at night&quot; -- and one of them is a cabby about to snap. In Martin Scorsese's classic 1970s drama, insomniac ex-Marine Travis Bickle (Robert De Niro) works the nightshift, driving his cab throughout decaying mid-'70s New York City, wishing for a &quot;real rain&quot; to wash the &quot;scum&quot; off the neon-lit streets. Chronically alone, Travis cannot connect with anyone, not even with such other cabbies as blowhard Wizard (Peter Boyle). \r\n\r\nHe becomes infatuated with vapid blonde presidential campaign worker Betsy (Cybill Shepherd), who agrees to a date and then spurns Travis when he cluelessly takes her to a porno movie. After an encounter with a malevolent fare (played by Scorsese), the increasingly paranoid Travis begins to condition (and arm) himself for his imagined destiny, a mission that mutates from assassinating Betsy's candidate, Charles Palatine (Leonard Harris), to violently &quot;saving&quot; teen hooker Iris (Jodie Foster) from her pimp, Sport (Harvey Keitel). \r\n\r\nTravis' bloodbath turns him into a media hero; but has it truly calmed his mind? Written by Paul Schrader, Taxi Driver is an homage to and reworking of cinematic influences, a study of individual psychosis, and an acute diagnosis of the latently violent, media-fixated Vietnam era. Scorsese and Schrader structure Travis' mission to save Iris as a film noir version of John Ford's late Western The Searchers (1956), aligning Travis with a mythology of American heroism while exposing that myth's obsessively violent underpinnings. Yet Travis' military record and assassination attempt, as well as Palatine's political platitudes, also ground Taxi Driver in its historical moment of American in the 1970s. \r\n\r\nEmploying such techniques as Godardian jump cuts and ellipses, expressive camera moves and angles, and garish colors, all punctuated by Bernard Herrmann's eerie final score (finished the day he died), Scorsese presents a Manhattan skewed through Travis' point-of-view, where De Niro's now-famous &quot;You talkin' to me&quot; improv becomes one more sign of Travis' madness. Shot during a New York summer heat wave and garbage strike, Taxi Driver got into trouble with the MPAA for its violence. \r\n\r\nScorsese desaturated the color in the final shoot-out and got an R, and Taxi Driver surprised its unenthusiastic studio by becoming a box-office hit. Released in the Bicentennial year, after Vietnam, Watergate, and attention-getting attempts on President Ford's life, Taxi Driver's intense portrait of a man and a society unhinged spoke resonantly to the mid-'70s audience -- too resonantly in the case of attempted Reagan assassin and Foster fan John W. Hinckley. \r\n\r\nTaxi Driver went on to win the Palme d'Or at the Cannes Film Festival, but it lost the Best Picture Oscar to the more comforting Rocky. Anchored by De Niro's disturbing embodiment of &quot;God's lonely man,&quot; Taxi Driver remains a striking milestone of both Scorsese's career and 1970s Hollywood.\r\n\r\n\r\n\r\n\r\nSTARS.........: Robert De Niro, Jodie Foster, Cybill Shepherd\r\nDIRECTOR......: Martin Scorsese\r\nWRITERS.......: Paul Schrader\r\nGENRE.........: Crime | Drama\r\nRATING........: 8.4/10  480,413 votes\r\nMETASCORE.....: 93/100\r\nIMDB link.....: http://www.imdb.com/title/tt0075314\r\nRUNTIME.......: 1h 53mn\r\nSIZE..........: 4.65GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1036p\r\nBITRATE.......: 5000 Kbps (3-pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English DTS 5.1 768kbps\r\nSOURCE........: Taxi Driver Blu Ray 4K Remaster\r\nSUBTITLES.....: ENG (SRT/PGS)\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-02-16\r\n\r\n\r\n\r\n \nhttp://i.imgur.com/acNcRho.jpg \nhttp://i.imgur.com/p5J5UoO.jpg \nhttp://i.imgur.com/PFxio5Q.jpg","torrent":{"xt":"urn:btih:15c03dfec4e9393dfc19a93d114a8b7233ef0e4a","amp;dn":"Taxi.Driver.1976.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c03dfec4e9393dfc19a93d114a8b7233ef0e4a","infoHashBuffer":{"type":"Buffer","data":[21,192,61,254,196,233,57,61,252,25,169,61,17,74,139,114,51,239,14,74]},"announce":[],"urlList":[]}}