{"title":"Dungeon Quest v2.2.0.5 mod [apkpita]","uid":14813649,"size":42341680,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:163bc271356dce15a50dc0505dcb237cd9300d19&amp;dn=Dungeon+Quest+v2.2.0.5+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1465216319,"description":"Embark on a journey to find the best loot and defeat all challengers in this truly free-to-play Offline Action RPG.\r\n\r\nFeaturing randomized loot, dynamically generated dungeons, and 4 acts each with their own legendary boss awaiting. Journey through unlimited floors of increasingly difficult enemies while collecting the best items possible while competing with your friends in our Battle Arena competitive leagues.\r\n\r\nEquip your Wizard, Warrior, or Rogue with infinitely customizable weapons and armor to help destroy the elemental evils plaguing the land. There are always new ways to vanquish your foes! Upgrade your gear with our Crystal and Mythstone crafting system. Make your character even more powerful using our Gear-Based Skill and Talent system.\r\n\r\nTired of playing alone? Bring your other characters into combat with you to gain experience and loot alongside your hero using our Hireling system. Or maybe you'll come across one of the many endearing companions included in our Pet system!\r\n\r\nFeatures Include:\r\n• Play for as long as you want not content or pay walls\r\n• Equip your Wizard, Warrior, or Rogue with amazing randomized loot you find on your adventure!\r\n• Never fight in the same dungeon twice! Climb your way through more than unlimited randomly generated floors.\r\n• Test your skill against one of 4 Legendary bosses at the end of every Act!\r\n• Bring your other characters into your adventures using the new Hireling System! \r\n• Manage your player AI to create your own army of adventures! \r\n• Native Controller integration for iOS7 with full HUD support!\r\n• Customize the dungeon's difficulty and rewards by choose between 8 enemy power levels.\r\n• New Pet System that lets you choose a follower to aid in your journey.\r\n\r\nAscension Gameplay Mode added! \r\nTake your characters even further with the addition of this new mode. Once your character reaches level 99\r\nyou can choose your first Ascension Perk for your character! (purchase this with in game gold from the Shop)\r\nWith 6 Ascension Perks to choose from there will always be more powerful loot and gear to find!\r\n\r\nNow supporting Google Play Games: Quests! Make sure you are logged into your Google Play Games account when you start Dungeon Quest\r\nto access to these new quests and the gifts you can get by completing them!\r\n\r\nUpdated Battle Arena System:\r\nLeague and Division placement is now based entirely on your matchmaking rating\r\nAll new Arena Level system is used to unlock new vanity Auras. Each match played earns you experience!\r\nRemoved League Points\r\nChests earned from Arena now have a chance to be Rare, Epic, Legend or Eternal.\r\n\r\nNew Item Affix Types: \r\nDependent Affix - Gain a bonus once you reach the requirement described on the item. This will reward players who like to use \r\nbuilds not typically seen or used in the various game modes for DQ.\r\n\r\nNegative Affix - Collect the new Seven Deadly Sins set to benefit from extremely powerful items....only if you can overcome their\r\nrequirements!\r\n\r\nOther Additions:\r\nAdded Random Pet's back to the game for Purchase\r\nAdded 45 new Legend Items\r\nAdded 9 new Item Sets\r\nNew 31 new Item Affixes\r\nVarious UI updates to Player Stat screens\r\nBalance updates\r\n\r\nWe are dedicated to making Dungeon Quest the best ARPG on mobile! New content will be added regularly, so follow us on either our forums, Twitter, orto get the latest news!\r\n\r\n\r\n\r\nPlease give us your feedback or comments, and help us make Dungeon Quest even BETTER!\r\n\r\nWebsite: www.shinyboxgames.com/blog/\r\n\r\nEmail us for support:   \r\n\r\nTalk with us and other players on our Forums: http://forums.dungeon-quest.com\r\n\r\nFollow our updates on FB: https://www. fb .com/pages/Dungeon-Quest/532814623416543\r\n\r\nIf you have any problems with our game send us a Tweet @DungeonQuest_SB! https:// tw .com/DungeonQuest_SB\r\n\r\n*FB and TW@ links not allowed in the torrent description\r\n\r\n\r\n\r\nThanks for playing Dungeon Quest!\r\n\r\nWhat’s new:\r\nBattle Arena Season 2!\r\nNew vanity items to collect for each character type.\r\nBug fix: Gold Quests in google play games should now award correct gold amounts\r\nNew vanity items to collect for each character type.\r\n\r\nMod Info:\r\nFree Shopping (In-App Purchases + In game items)\r\nUnlimited Mana\r\n\r\nRequires Android OS: Varies with device","torrent":{"xt":"urn:btih:163bc271356dce15a50dc0505dcb237cd9300d19","amp;dn":"Dungeon+Quest+v2.2.0.5+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"163bc271356dce15a50dc0505dcb237cd9300d19","infoHashBuffer":{"type":"Buffer","data":[22,59,194,113,53,109,206,21,165,13,192,80,93,203,35,124,217,48,13,25]},"announce":[],"urlList":[]}}