{"title":"Eric Clapton - Wonderful  Tonight  (Live) (Xvid-2nafish)","uid":6013644,"size":95501482,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:16d632fab81754caa75ffa3adfbfee1de9ce0685&amp;dn=Eric+Clapton+-+Wonderful++Tonight++%28Live%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291547815,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:06:10\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1932 Kbps\nQuality Factor : 0.38 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Wonderful Tonight&quot; is a song written by Eric Clapton. It was included on Clapton's 1977 album Slowhand and released as a single the following year. Clapton wrote the song about Pattie Boyd, and it is mentioned in her autobiographical book Wonderful Tonight: George Harrison, Eric Clapton, and Me.\n\nOn 7 September 1976, Clapton wrote &quot;Wonderful Tonight&quot; for Boyd while waiting for her to get ready to attend Paul and Linda McCartney's annual Buddy Holly party. Of &quot;Wonderful Tonight,&quot; Boyd would say: &quot;For years it tore at me. To have inspired Eric, and George before him, to write such music was so flattering. 'Wonderful Tonight' was the most poignant reminder of all that was good in our relationship, and when things went wrong it was torture to hear it.&quot;\n\nIn 1988, Clapton appeared in the Nelson Mandela 70th Birthday Tribute concert as a guest guitarist for Dire Straits. The group became his backing musicians for a surprise performance of &quot;Wonderful Tonight&quot; during their set.\n\nThe song appeared in a 2005 SBC commercial.\n\nSlowhand is an album by Eric Clapton, released in 1977. It contained three of his most popular singles, the bluesy &quot;Cocaine&quot;, the ballad &quot;Wonderful Tonight&quot; and the country-flavoured #3 U.S. hit &quot;Lay Down Sally&quot;, as well as other songs that became Clapton classics on their own like &quot;The Core&quot; and &quot;Next Time You See Her&quot;. The title of the album is Eric's nickname which was given to him by Giorgio Gomelsky. The album proved to be a big success and a step forward after the relative failure of Clapton's previous album, No Reason to Cry. It was both critically and commercially well received, reaching #2 on the Billboard Album Charts, only surpassed by the blockbuster Saturday Night Fever soundtrack. In 2003, the album was ranked number 325 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nEric Patrick Clapton, CBE (born 30 March 1945) is a highly regarded and influential English blues-rock guitarist as well as a singer-songwriter. He has singularly been inducted three times into the Rock and Roll Hall of Fame as a solo performer, as well as a band member of The Yardbirds and Cream. Clapton was ranked fourth in Rolling Stone magazine's list of the &quot;100 Greatest Guitarists of All Time&quot; and #53 on their list of the &quot;Immortals: 100 Greatest Artists of All Time&quot;. In 2010, Clapton was ranked #4 on Gibson's Top 50 Guitarists of All Time.\n\nAlthough Clapton has varied his musical style throughout his career, it has always remained grounded in the blues; despite this focus, he is credited as an innovator in a wide variety of genres including blues-rock (with John Mayall &amp; the Bluesbreakers and The Yardbirds) and psychedelic rock (with Cream). Clapton's chart success was not limited to the blues, with chart-toppers in Adult contemporary (&quot;Tears in Heaven&quot;) and reggae (Bob Marley's &quot;I Shot the Sheriff&quot;; he is often credited for bringing reggae and Bob Marley to the mainstream). Two of his most successful recordings were the hit love song &quot;Layla&quot;, which he played with the band Derek and the Dominos, and Robert Johnson's &quot;Crossroads&quot;, which has been his staple song since his days with Cream.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:16d632fab81754caa75ffa3adfbfee1de9ce0685","amp;dn":"Eric+Clapton+-+Wonderful++Tonight++%28Live%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d632fab81754caa75ffa3adfbfee1de9ce0685","infoHashBuffer":{"type":"Buffer","data":[22,214,50,250,184,23,84,202,167,95,250,58,223,191,238,29,233,206,6,133]},"announce":[],"urlList":[]}}