{"title":"The Human League - Human [promo].VOB","uid":6041803,"size":207087616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:176ad916ba6cd43d1f61952164b250ba76792c8d&amp;dn=The+Human+League+-+Human+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1292409252,"description":"The Human League - Human [promo].VOB\n\n\n\nHQ promo music video. &quot;Human&quot; is a song recorded by British synthpop band The Human League. It was released as the first single from their 1986 album Crash. The track was written and produced by US producers Jimmy Jam and Terry Lewis.\n\nIn 1985 the recording sessions for the Human League's fifth album were not going well; and the band did not like the results which was causing internal conflict. Virgin Records executives, worried by the lack of progress from their at-the-time most-profitable signing, suggested the band accept an offer to work with producers Jimmy Jam and Terry Lewis who already had material to work with; and had expressed an interest in the band from their U.S. releases. Jam and Lewis had recently emerged as in-demand talent due to their success with Janet Jackson and her Control album.\n\nOf the ten songs on Crash, Jam and Lewis wrote three, &quot;Human&quot; being one of them. It is a mid-tempo ballad which lyrically is an exchange between a man and a woman in a relationship who have reunited after a separation. In the first two verses Philip Oakey is apologizing to his partner for being unfaithful during her absence, and in the song's breakdown Joanne Catherall's spoken-word confession reveals that she too was unfaithful. The song's title is derived from the chorus, in which both parties in the relationship explain that they are &quot;only human&quot; and &quot;born to make mistakes&quot;.\n\n&quot;Human&quot; became the second million-selling number-one single for The Human League on the U.S. Billboard Hot 100 (after &quot;Don't You Want Me&quot;) and their second chart-topper on the U.S. Hot Dance Club Play chart (after &quot;(Keep Feeling) Fascination&quot;).\n\nThis music video for &quot;Human&quot; was filmed in London during June 1986, in a studio using Chroma key overlay. It is heavily stylized to give a 'water reflective' effect and blue hue throughout. In the first time that the band had been presented as a &quot;Phil and the girls&quot; trio, images of Oakey, Catherall and Sulley are constantly layered and blended. The video was conceived and directed by Andy Morahan.\n(video does not have any logos)\n\n\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Human_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Human_(song)&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/FAbAeAAdH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/FAbAeAAdH&lt;/a&gt; \n\n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:03:45\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*      &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:176ad916ba6cd43d1f61952164b250ba76792c8d","amp;dn":"The+Human+League+-+Human+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"176ad916ba6cd43d1f61952164b250ba76792c8d","infoHashBuffer":{"type":"Buffer","data":[23,106,217,22,186,108,212,61,31,97,149,33,100,178,80,186,118,121,44,141]},"announce":[],"urlList":[]}}