{"title":"Gretchen Wilson - Right on Time [2013][EAC,log,cue. FLAC]","uid":8513739,"size":325799216,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:18a73119dd6d57b5e5e2d2076fbc4eee8ff59ac1&amp;dn=Gretchen+Wilson+-+Right+on+Time+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1369653677,"description":"Artist: Gretchen Wilson\nRelease: Right on Time\nReleased: 2013\nLabel: Redneck \nCatalog#: JANSEN026 \nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: country\n\n1. Get Outta My Yard (3:02)\n2. Still Rollin' (4:41)\n3. Grandma (4:20)\n4. Crazy (3:34)\n5. The Well Run Dry (3:07)\n6. The Gypsy In Me (4:49)\n7. Dust &amp; Bone (2:52)\n8. Right On Time (3:45)\n9. My Truck (feat. Josh Malter) (2:51)\n10. One Good Friend (3:28)\n11. I've Been In Love (3:41)\n12. Hey Love (4:17)\n13. Birds of a Feather (2:23)\n\nIt was the kind of back-story that country music loves: a young girl who never got past the eighth grade, grew up in trailer parks, waitressed and bartended in bars and clubs to get by, and sang on the side when she could bursts onto the country scene and becomes an instant star with a single song. Released in 2004, &quot;Redneck Woman,&quot; an iconic song that celebrated just such a ragged trailer park life and did it with resilient pride, instantly put Gretchen Wilson on the superstar celebrity fast track, and she handled it as well as anyone could have when all was said and done. Yeah, Sony dropped her in 2009 when she failed to generate another million-seller like &quot;Redneck Woman,&quot; but Wilson has rebounded nicely, starting her own label, Redneck Records, and with three albums due in 2013, she's firmly in charge of her own career for the first time. The aptly named Right on Time shows that Wilson is capable of much more than just country honky tonk anthems, and in fact, this set is way more garage rock blues than it is country, with some late-night jazz, soul, and funk thrown in as well, and it's clearly a statement that Wilson isn't about to sit still musically. Only the lead track here, &quot;Get Outta My Yard,&quot; really sounds country, actually, and even this song roars along on garage rock guitars, while the monstrous-sounding &quot;My Truck&quot; certainly seems country, although it's more like country on heavy dance-pop steroids. The real surprise, if there is one, is the diversity of Wilson's voice, which belts out the barroom truth on one song, goes hushed and hoarse on another, and then emulates Etta James doing uptown blues in a late-night jazz club on yet another. Right on Time is all about showcasing Wilson's range, and she is a revelation on songs like the bluesy and brutally honest &quot;Crazy,&quot; the relentless cautionary tale &quot;The Well Run Dry,&quot; the Eagles-like ballad &quot;Right on Time,&quot; the swampy and electric &quot;Dust &amp; Bone,&quot; and the delightful &quot;I've Been in Love,&quot; a bright, breezy bit of jazz-funk-pop that sounds closer to Bette Midler than Dolly Parton, although Wilson seems to channel a little of both of these icons (along with Etta James) on this strong, confident, and diverse album. This may not be country, but it's how Wilson sees it, and it's difficult to say that she's wrong, not with an album as varied and good as this.","torrent":{"xt":"urn:btih:18a73119dd6d57b5e5e2d2076fbc4eee8ff59ac1","amp;dn":"Gretchen+Wilson+-+Right+on+Time+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18a73119dd6d57b5e5e2d2076fbc4eee8ff59ac1","infoHashBuffer":{"type":"Buffer","data":[24,167,49,25,221,109,87,181,229,226,210,7,111,188,78,238,143,245,154,193]},"announce":[],"urlList":[]}}