{"title":"Girl with the Dragon Tattoo (Eng.Subs.Ioz-of-Mer_edit.4.Sabelma","uid":6318795,"size":32971,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1951cefd9d449ed21d7a7eae98fdffb9aa110b0a&amp;dn=Girl+with+the+Dragon+Tattoo+%28Eng.Subs.Ioz-of-Mer_edit.4.Sabelma+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ioz-of-Mer","files":1,"time":1302795366,"description":"English (.srt) subtitles for the Sabelma 2 CD Swedish language DVDrip release of the 2009 film &quot;The Girl with the Dragon Tattoo&quot; aka &quot;MÃƒÂ¤n som hatar kvinnor&quot; (original Swedish title).\n\nLink: http://www.imdb.com/title/tt1132620/\n\n\nThis post is an edited version of the subs that were meant to go with the Sabelma release, which is a Swedish language DVD rip. These subs also go with the unhelpfully labelled 2 disc &quot;The Girl with the Dragon Tattoo (2009) DVDRIP, Eng. Sub&quot; release (which I suspect may have been taken and relabelled from the Sabelma release).\n\nThe subs I worked with - which were the best I could find that were timed correctly - claimed to be edited and checked by the original poster, but they still had many distracting, and occasionally confusing, mistakes. Some of the errors included typos, misplaced words, the use of quotation marks (&quot;&quot;) in place of where an ellipses should go (...), or writing &quot;Lt&quot; instead the word &quot;It&quot;, or missing periods at the end of sentences (this was FREQUENT), or failing to separate exchanges between two or more characters into two separate lines (example below).\n\nUnedited version: \n- How will you celebrate? - No comment. \n\nEdited Version: \n- How will you celebrate?\n- No comment.\n\n\nI checked the CD1 and CD2 SRT subs line by line and used the movie and the NODLABS 720p BluRay.x264 subs (which were excellent) as a reference. Aside from that, the subs were not modified in any way because the sync timing was perfect.\n\nHere are few examples of some of the changes. (Please note, that these examples represent only a small portion of the total edits.)\n\nOriginal text: &quot;Till this things blown oven&quot;\nMy Edit: &quot;Till this thing blows over.&quot;\n\nOriginal text: &quot;You like you think you\nsmell just took a shower?&quot;\nMy Edit: &quot;You think you smell\nlike you just took a shower?&quot;\n\nOriginal text: &quot;He found this Elm\nand had the photo blown up.&quot;\nMy Edit: &quot;He found this film\nand had the photo blown up.&quot;\n\nOriginal text: &quot;No. So I went to his house\nto see if I could End anything.&quot;\nMy Edit: &quot;No. So I went to his house\nto see if I could find anything.&quot;\n\nLong story short, all these edits should make it easier for viewers to enjoy this great movie.","torrent":{"xt":"urn:btih:1951cefd9d449ed21d7a7eae98fdffb9aa110b0a","amp;dn":"Girl+with+the+Dragon+Tattoo+%28Eng.Subs.Ioz-of-Mer_edit.4.Sabelma+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1951cefd9d449ed21d7a7eae98fdffb9aa110b0a","infoHashBuffer":{"type":"Buffer","data":[25,81,206,253,157,68,158,210,29,122,126,174,152,253,255,185,170,17,11,10]},"announce":[],"urlList":[]}}