{"title":"I Puritani Opera DVD9 NTSC Version 2 Italia audio MultiSubs","uid":7868362,"size":8366604914,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:199bab9386c0e66274bf5180697192c28e9fd826&amp;dn=I+Puritani+Opera+DVD9+NTSC+Version+2+Italia+audio+MultiSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Marjanb","files":-1,"time":1354122355,"description":"I Puritani Opera DVD9 NTSC Version 2 Italia audio MultiSubs\n\n[IMG]http://i845.photobucket.com/albums/ab16/hortencia9/opslag%20plaatjes/I_PURITANI-02.jpg[/IMG]\n\nNederlands Philharmonisch Orkest\nKoor van De Nederlandse Opera\nDir. Giuliano Carella\n\nLord Gualtiero Valton - Daniel Borowski\nSir Giorgio - Riccardo Zanellato\nLord Arturo Talbo - John Osborn\nSir Riccardo Forth - Scott Hendricks\nSir Bruno Roberton - Gregorio Gonzalez\nEnrichetta di Francia - Fredrika Brillembourg\nElvira - Mariola Cantarero\n\nAct 1\n\nA fortress near Plymouth, commanded by Lord Gualtiero Valton\n\nAt daybreak, the Puritan soldiers anticipate victory over the Royalists. Riccardo had been promised Elvira's hand in marriage by Lord Valton but, returning to Plymouth, he finds that she is in love with Arturo (a Royalist), and will marry him instead. He confides in Bruno (&quot;Ah! Per sempre ... Bel sogno beato&quot;).\n\nIn Elvira's apartments, Giorgio reveals that it was he who persuaded Lord Valton to grant Elvira's wish. She is overjoyed.\n\nArturo arrives for the wedding and celebrates his new-found happiness (&quot;A te, o cara&quot;). Valton is to take a mysterious lady (suspected of being a Royalist spy) to appear before Parliament. Arturo discovers that she is Enrichetta (Henrietta Maria), widow of the executed King Charles I. Elvira appears singing a joyful polonaise (&quot;Son vergin vezzosa&quot;), but drops her wedding veil as she departs to make ready for the wedding. Arturo uses the veil to disguise Enrichetta as Elvira and so enabling her to escape. On the way, they encounter Riccardo and, when he discovers that the woman with Arturo is not Elvira, he is content to let them pass. When the escape is discovered, Elvira believes herself deserted and loses her reason (&quot;Oh, vieni al tempio, fedele Arturo&quot;).\nAct 2\n\nAnother part of the fortress\n\nGiorgio describes Elvira's madness (&quot;Cinta di fiori&quot;). Riccardo brings the news that Arturo is now a fugitive who has been condemned to death for allowing Enrichetta to escape. Elvira now appears, still deranged but longing for Arturo (&quot;Qui la voce ...Vien, diletto&quot;). Giorgio and Riccardo argue over whether Arturo's death will mean that Elvira will die of grief, but eventually agree that he must die if he is found fighting for the Royalists in the impending battle (&quot;Il rival salvar tu dei ... Suoni la tromba&quot;).\nAct 3\n\nThe countryside near the fortress, three months later\n\nArturo is still on the run, but has returned to see Elvira. He hears her singing (&quot;A una fonte afflitto e solo&quot;) and they are reunited (&quot;Vieni fra le mie braccie&quot;). But Elvira fears that they will again be parted, and when Riccardo arrives, with Giorgio and the soldiers, to announce Arturo's death sentence, she finally comes to her senses. An ensemble (&quot;Credeasi, misera&quot;) develops, during which Bellini writes a High F-natural above High C for Arturo, and even Riccardo is moved by the plight of the lovers. The soldiers demand Arturo's execution, but word is brought that, although the Royalists have been defeated, Oliver Cromwell has pardoned all prisoners. The lovers are finally united for good.\n\n[IMG]http://i845.photobucket.com/albums/ab16/hortencia9/plaatjes%20film/marjan/extrainfoplain.png[/IMG]\n\t\nCategory: Video\nFormat: DVD\nSource:Retail\nSubtitle: English Dutch German French  Spanish  Italia optional\nGenre: Music\nLanguage: Italia audio \nStandard:NTSC\nFormat version  : Version 2\nBit rate mode: Variable\nWidth: 720 pixels\nHeight: 480 pixels\nDisplay aspect ratio: 16:9\nFrame rate: 29.970 fps\n\nEnjoy the Music/Opera\n\nDon`t quit after you finished the download, but keep seeding.  [img]http://i845.photobucket.com/albums/ab16/hortencia9/plaatjes%20film/011.gif[/img]","torrent":{"xt":"urn:btih:199bab9386c0e66274bf5180697192c28e9fd826","amp;dn":"I+Puritani+Opera+DVD9+NTSC+Version+2+Italia+audio+MultiSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199bab9386c0e66274bf5180697192c28e9fd826","infoHashBuffer":{"type":"Buffer","data":[25,155,171,147,134,192,230,98,116,191,81,128,105,113,146,194,142,159,216,38]},"announce":[],"urlList":[]}}