{"title":"Cinema PortuguÃƒÂªs - O Patio das Cantigas.avi","uid":6355406,"size":1467640268,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1c4d036c73730e31de9c86fb15492f1f4d0c2e11&amp;dn=Cinema+Portugu%C3%83%C2%AAs+-+O+Patio+das+Cantigas.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alrendio","files":1,"time":1304131605,"description":"Mais um torrent da Vilatorrents: &lt;a href=&quot;\nhttp://groups.google.com/group/vilatorrents?hl=pt-PT?hl=pt-PT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://groups.google.com/group/vilatorrents?hl=pt-PT?hl=pt-PT&lt;/a&gt;\nAderir no endereÃƒÂ§o acima.\n \n\nO PÃƒÂ¡tio das Cantigas ÃƒÂ© um filme portuguÃƒÂªs de 1942, realizado por Francisco Ribeiro que tem lugar num tÃƒÂ­pico bairro lisboeta por ocasiÃƒÂ£o das festas dos Santos Populares, atravÃƒÂ©s de um fabuloso jogo de equÃƒÂ­vocos e duplos sentidos numa comÃƒÂ©dia inesquecÃƒÂ­vel, com Vasco Santana, AntÃƒÂ³nio Silva e Ribeirinho.\n\nCom AntÃƒÂ³nio Silva (Evaristo), AntÃƒÂ³nio Vilar (Carlos Bonito), Armando Chagas, Barroso Lopes (JoÃƒÂ£o Magrinho), Carlos Alves (Engenhocas), Carlos Otero (Alfredo), Eliezer Kamenesky, Francisco de Castro, Francisco Ribeiro (Rufino), GraÃƒÂ§a Maria (Susana), Laura Alves (Celeste), Maria da GraÃƒÂ§a (Maria da GraÃƒÂ§a), Maria das Neves (Dona Rosa) e Vasco Santana (Narciso).\n\nO PÃƒÂ¡tio das Cantigas de 1941, ÃƒÂ© uma das mais cÃƒÂ©lebres e amadas comÃƒÂ©dias populares do cinema portuguÃƒÂªs. ConvergÃƒÂªncia de grandes talentos da ÃƒÂ©poca o filme de Ribeirinho, produzido pelo seu irmÃƒÂ£o AntÃƒÂ³nio Lopes Ribeiro e pelos dois escrito de parceria com Vasco Santana, assenta acima de tudo num primoroso jogo de diÃƒÂ¡logos, com duplos sentidos e um irresistÃƒÂ­vel sabor revisteiro, bem como num lote admirÃƒÂ¡vel de grandes comediantes. Ribeirinho, A. Lopes Ribeiro e Vasco Santana captaram e registaram com humor e sensibilidade toda a atmosfera lisboeta, bairrista e popular por ocasiÃƒÂ£o das festas dos Santos Populares, a partir de um punhado exemplar de personagens tipificadas, envolvidas nas suas querelas, confrontos e desejos pessoais. Tudo isto, servido por uma realizaÃƒÂ§ÃƒÂ£o discreta e eficaz num filme que conta com gags memorÃƒÂ¡veis, como o de Vasco Santana regressando a casa bÃƒÂªbado e tentando obter lume de um candeeiro da via pÃƒÂºblica, que lhe vai servir de \\&quot;guia\\&quot; atÃƒÂ© chegar ÃƒÂ  cama. Mas o que hÃƒÂ¡ de mais notÃƒÂ¡vel em O PÃƒÂ¡tio das Cantigas ÃƒÂ© sem dÃƒÂºvida o espantoso jogo da representaÃƒÂ§ÃƒÂ£o, do mau gÃƒÂ©nio e arrogÃƒÂ¢ncia de AntÃƒÂ³nio Silva ÃƒÂ s atribulaÃƒÂ§ÃƒÂµes do tÃƒÂ­mido Ribeirinho, passando pelas calinadas, verbais e melÃƒÂ³dicas (Ã‚Â«Evaristo tens cÃƒÂ¡ distoÃ‚Â», ficou cÃƒÂ©lebre), de Laura Alves e, acima de tudo, pela alegria ÃƒÂ©bria e pela insolÃƒÂªncia provocadora de Vasco Santana.\n\n \nNum tÃƒÂ­pico pÃƒÂ¡tio lisboeta, por altura das festas dos Santos Populares, um punhado de gente simples vive o seu quotidiano, os seus sonhos, desilusÃƒÂµes, paixÃƒÂµes, ciÃƒÂºmes e alegrias numa atmosfera quase encantada. Alfredo ÃƒÂ© um bom rapaz cujo irmÃƒÂ£o Carlos, um estouvado, namora a frÃƒÂ­vola AmÃƒÂ¡lia. A irmÃƒÂ£ desta, Suzana, ama por sua vez Alfredo. Narciso, o pai de Rufino e seu sÃƒÂ³cio na leitaria do bairro, ÃƒÂ© um bÃƒÂªbado crÃƒÂ³nico e um virtuoso da guitarra. Rosa, uma bem disposta viÃƒÂºva que vende flores, ÃƒÂ© por sua vez cortejada por Narciso e pelo intratÃƒÂ¡vel e arrogante Evaristo, o merceeiro, pai da invejosa e mimada Celeste. A rivalidade entre Narciso e Evaristo vai ao rubro numa noite de bailarico no pÃƒÂ¡tio que termina numa autÃƒÂªntica batalha campal. Por fim tudo se compÃƒÂµe entre os vÃƒÂ¡rios pares amorosos e no pÃƒÂ¡tio a vida segue serenamente.\n \n \nO PÃƒÂ¡tio das Cantigas em Amor de PerdiÃƒÂ§ÃƒÂ£o.\n \n","torrent":{"xt":"urn:btih:1c4d036c73730e31de9c86fb15492f1f4d0c2e11","amp;dn":"Cinema+Portugu%C3%83%C2%AAs+-+O+Patio+das+Cantigas.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4d036c73730e31de9c86fb15492f1f4d0c2e11","infoHashBuffer":{"type":"Buffer","data":[28,77,3,108,115,115,14,49,222,156,134,251,21,73,47,31,77,12,46,17]},"announce":[],"urlList":[]}}