{"title":"Was Am Ende Zahlt aka Nothing Else Matters 2007 Sonata Premiere","uid":7692235,"size":741593612,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c5f82e06e98ee8b27978bb45f382a4533cd35fe&amp;dn=Was+Am+Ende+Zahlt+aka+Nothing+Else+Matters+2007+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":4,"time":1349272780,"description":"Two teenage girls struggle to get by on their own until they discover a third person will be joining them in this drama from writer and director Julia von Heinz. Carla (Paula Kalenberg) is fifteen years old and dreams of becoming a successful fashion designer. Unhappy at home, Carla decides to run away and move to France, but while in Berlin, a thief makes off with all her savings. With no money, Carla is left stranded, but soon makes friends with Lucie (Marie Luise Schramm), another teenager who is living on the streets and shows her the ropes. With Lucie's help, Carla lands a job, but one night she meets a man and after a night of lovemaking she finds herself pregnant. Certain her parents will find her if she goes to a doctor, Carla isn't sure what to do until Lucie hatches a plan -- Carla will pose as Lucie, and under German welfare laws they'll be able to get an apartment financed by the state, which they can share along with the baby and Lucie's brother Michael (Benjamin Kramme). Once they settle in, Carla can move on to France, and Lucie and Michael will look after the child. Carla is thrilled with the plan, but Lucie soon realizes for the scheme to work, she'll have to persuade her employers she's pregnant, and once the baby arrives, Carla finds leaving her child behind is more difficult than she ever imagined. Was am Ende zaehlt (aka Nothing Else Matters premiered at the 2007 Berlin Film Festival. ~ Mark Deming, Rovi\n\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:1c5f82e06e98ee8b27978bb45f382a4533cd35fe","amp;dn":"Was+Am+Ende+Zahlt+aka+Nothing+Else+Matters+2007+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c5f82e06e98ee8b27978bb45f382a4533cd35fe","infoHashBuffer":{"type":"Buffer","data":[28,95,130,224,110,152,238,139,39,151,139,180,95,56,42,69,51,205,53,254]},"announce":[],"urlList":[]}}