{"title":"Enki Bilal: The Chaos Effect","uid":8675794,"size":109185731,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:1c60c0d145e849d375ae21f736350766302bf958&amp;dn=Enki+Bilal%3A+The+Chaos+Effect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":1,"time":1373587189,"description":"Enki Bilal\nThe Chaos Effect\n\nEnglish edition published by Humanoids 2005\n192 pages\n\nYugoslavian cartoonist Bilal's gritty pen-and-paint artwork has made him a star of European comics, and this book collects two of his collaborations with writer Christin about the violent ghosts of Old Europe: 1979's The Black Order Brigade and 1983's The Hunting Party. The first work is a bleak inversion of the &quot;team gets back together for one more adventure&quot; archetype: in response to terrorist aftershocks of the Spanish Civil War, a newspaper editor reunites his old Communist/anarchist crew to do something about the problem. What they're going to do and how they're going to do it becomes increasingly less clear, though, and their mission rapidly disintegrates into aimlessness punctuated by horrific violence. The second novel is an even darker, bloodier assessment of the precollapse eastern bloc: representatives from Warsaw Pact nations gather around a dying Soviet bigwig who's seen the rise and slow fall of his country. The summit turns into the pretense for multiple acts of brutal, quasi-legal revenge. Its symbolism is a bit more heavy-handed, but Bilal's artwork captures the desolate colors and concrete wastelands of Eastern Europe with cruel precision. Christin's stories can be nearly impenetrable, especially if readers aren't intimately familiar with 20th-century European politics, and their pace is all tension and distraction with little release. But the artwork in both pieces is ideal for its cold, bitter tone.","torrent":{"xt":"urn:btih:1c60c0d145e849d375ae21f736350766302bf958","amp;dn":"Enki+Bilal%3A+The+Chaos+Effect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c60c0d145e849d375ae21f736350766302bf958","infoHashBuffer":{"type":"Buffer","data":[28,96,192,209,69,232,73,211,117,174,33,247,54,53,7,102,48,43,249,88]},"announce":[],"urlList":[]}}