{"title":"What Would Google Do - Jeff Jarvis (2009 - English - Unabridged)","uid":5151186,"size":228149712,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1e121e6b7d050e487c1a44f4335e27da3524817c&amp;dn=What+Would+Google+Do+-+Jeff+Jarvis+%282009+-+English+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"transpar3nt","files":-1,"time":1257564427,"description":"What Would Google Do?\nBy Jeff Jarvis\n\nEnglish\n2009\n\n56kbps, 12kHz\n\n\n\n\nA bold and vital book that asks and answers the most urgent question of today: What Would Google Do?\n\nIn a book that's one part prophecy, one part thought experiment, one part manifesto, and one part survival manual, Internet impresario and blogging pioneer Jeff Jarvis reverse-engineers Google, the fastest-growing company in history, to discover 40 clear and straightforward rules to manage and live by.\n\nAt the same time, he illuminates the new worldview of the internet generation: how it challenges and destroys, but also opens up vast new opportunities. His findings are counterintuitive, imaginative, practical, and above all, visionary, giving readers a glimpse of how everyone and everything, from corporations to governments, nations to individuals, must evolve in the Google era.\n\nAlong the way, he looks under the hood of a car designed by its drivers, ponders a worldwide university where the students design their curriculum, envisions an airline fueled by a social network, imagines the open-source restaurant, and examines a series of industries and institutions that will soon benefit from this book's central question.\n\nThe result is an astonishing, mind-opening book that, in the end, is not about Google. It's about you.\n\n\n\n\nPLEASE CONTRIBUTE BY SEEDING WHEN FINISHED\n\nFor more great, high-quality audio books, check out Audible.com!\n\n\nThanks for sharing!","torrent":{"xt":"urn:btih:1e121e6b7d050e487c1a44f4335e27da3524817c","amp;dn":"What+Would+Google+Do+-+Jeff+Jarvis+%282009+-+English+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e121e6b7d050e487c1a44f4335e27da3524817c","infoHashBuffer":{"type":"Buffer","data":[30,18,30,107,125,5,14,72,124,26,68,244,51,94,39,218,53,36,129,124]},"announce":[],"urlList":[]}}