{"title":"Tom Russell Band - Poor Man's Dream (1989) (MP3@VBR) [FrankFoo]","uid":11297229,"size":69539952,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1ecf077c33459b625827e781f2c2d3d64b3b1446&amp;dn=Tom+Russell+Band+-+Poor+Man%27s+Dream+%281989%29+%28MP3%40VBR%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1414390783,"description":"\nTom Russell Band - Poor Man's Dream (1989)\n\n\n &quot;..inspired Folk/Rock performances..&quot;\n\n\nTom Russell rivals Springsteen and Mellencamp as he chronicles the dreams and heartaches of working people, immigrants, and society's outcasts. From touching ballads to hard country rockers, every cut makes listening worthwhile. \n\nThis is a record that greatly deserves wider exposure.\nThese songs offer Tom Russell's acute and often poetic observations on the lives of ordinary and extraordinary people the world over, laced with convincing little real-life details, backed by one of the toughest roots-rock bands you'll ever hear. Russell's popular among his fellow songwriters, too: co-writers on this album include Nanci Griffith, Ian Tyson, Dan Zanes (of the Del Fuegos) and Katy Moffatt.\n\n&quot;Tell my family don't worry, I will not return to cause them shame&quot;\nGallo del Ciello - Not only one of the best songs you'll ever hear about cock-fighting, one of the best ever.\n\nIncluded NFO, PLS, M3U\nCovers: Front \nTags: ID3 v1.1, ID3 v2.3, APE v2,000\n\n\nCD\n\n01. Blue Wing\n02. The Heart Of The Working Man\n03. Veteran's Day\n04. Walkin' On The Moon\n05. Outbound Plane\n06. Bergenfield\n07. Spanish Burgundy\n08. Gallo Del Cielo\n09. La Frontera\n10. Navajo Rug\n11. Under The Gun\n12. The White Trash Song\n\nPlaying Time.........: 46:40\n\n\nOne of Russell's best albums, Poor Man's Dream is dominated by inspired folk/rock performances and by songs that sound like classics that have been around forever. \nIn fact, Russell wrote 11 of the dozen tracks within a few years of the disc's release (though he had help on a few numbers from the likes of Katy Moffatt, Nancy Griffith, and Ian Tyson). \nPicking standouts on an album this strong isn't easy, but if pressed you might name &quot;Walkin on the Moon,&quot; which is about falling in love; the melancholy &quot;Spanish Burgundy&quot;; &quot;Gallo del Cielo,&quot; about a man trying to win the money to buy back his father's land; and &quot;Navajo Rug,&quot; a nostalgic look at old times and an old love. \nToday many of these songs sound like standards; someday, one suspects, they will be. ~ Jeff Burger, AMG.\n\nDave Alvin was supposed to have been ready to quit the music business, but hearing Blue Wing inspired him to soldier on in the hope that one day he'd write a song like that.\n\nMultiTracker @ FrankFoo","torrent":{"xt":"urn:btih:1ecf077c33459b625827e781f2c2d3d64b3b1446","amp;dn":"Tom+Russell+Band+-+Poor+Man%27s+Dream+%281989%29+%28MP3%40VBR%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ecf077c33459b625827e781f2c2d3d64b3b1446","infoHashBuffer":{"type":"Buffer","data":[30,207,7,124,51,69,155,98,88,39,231,129,242,194,211,214,75,59,20,70]},"announce":[],"urlList":[]}}