{"title":"Osho Fluctuation Meditation 01 - Be Still and Know, Full compact","uid":5484240,"size":462289107,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:203c5a35ea6e1f5a36c40988e95d080b1423007a&amp;dn=Osho+Fluctuation+Meditation+01+-+Be+Still+and+Know%2C+Full+compact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"veerenski","files":10,"time":1270613827,"description":"Osho Fluctuation Meditation - Be Still and Know, Full compact version\nThis is a preferred version from the standpoint of total size.\nOtherwise, it is the same version as Full.\n\n\nOsho Fluctuation Meditations contain the best audio quality Osho\ndiscourses accompanied with a background music by Osho\nmusicians and the best of ethnic music played by the most\noutstanding musicians.\n\nUsually, when you just listen to the discourse by itself,\nyour mind tends to wonder away on all sorts of mind trips\nand you are not even aware when it does it. All you recognize is when\nit came back to the source and become aware of the discourse again.\n\nWith Fluctuation meditation, the background music is specifically\nselected to be beautiful and conductive to you remaining with it.\nYou will be taken through different spaces, world traditions,\nand musical styles from ancient to modern. The best of the best.\n\nThe chance of you staying with the discourse is much higher.\nIf your mind wonders away from the discourse,\nif becomes occupied with the beauty of music,\nand so it becomes much easier to become aware\nof how your mind wonders away from the present moment.\n\nYou can create these meditations by yourself by playing the discourse\nusing one media player, such as VLC player (http://www.videolan.org/vlc/)\nor some other player and playing a song list with beautiful meditative music\nat the same time using a different player, such as Winamp and playing\na song list with it. So you have two players playing simultaneously.\n\nThe music volume should be set much quieter than the discourse\nand it should be overshadowed when the voice gets loud. The only purpose\nof music is to provide you an additional hook to this very moment.\nWhen your mind wonders away on its trips, the first choice it is going\nto have is that beautiful music. It becomes easier to see how your mind flickers.\nIt bounces back and forth. That is the whole point. Since music is barely\naudible and is beautiful, it creates a certain tension, trying to hear\nthe music, which brings you back to the present moment again and again.\n\nOsho musicians produced a large collection of meditative music.\nSo, this would be a very good choice. But you can also play the ethnic\nmusic that you like. It works fine. But do not play any aggressive\nor complicated music such as rock or jazz. That won't work.\n\nJust lay back, close your eyes and enjoy this space of silence.\nThere is nothing to do.\nEverything is in a perfect shape, as perfect as it gets.\n\nFinally, you can search on anything you want to know in Osho books\non line from: &lt;a href=&quot;\nhttp://oshosearch.net/Convert/search.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://oshosearch.net/Convert/search.php&lt;/a&gt;\n\nor view the entire collection at: &lt;a href=&quot;\nhttp://oshosearch.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://oshosearch.net&lt;/a&gt;","torrent":{"xt":"urn:btih:203c5a35ea6e1f5a36c40988e95d080b1423007a","amp;dn":"Osho+Fluctuation+Meditation+01+-+Be+Still+and+Know%2C+Full+compact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203c5a35ea6e1f5a36c40988e95d080b1423007a","infoHashBuffer":{"type":"Buffer","data":[32,60,90,53,234,110,31,90,54,196,9,136,233,93,8,11,20,35,0,122]},"announce":[],"urlList":[]}}