{"title":"Windows Tiny7 Unattended Activated CD (x86)","uid":6699986,"size":733134479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:207ae1569b3925081c6c906caa4afa1101d765ce&amp;dn=Windows+Tiny7+Unattended+Activated+CD+%28x86%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kadavul","files":17,"time":1316936025,"description":"Windows Tiny7 Unattended Activated CD (x86)\n\n\n\nInfo\n\n\nThank you for trying the very first edition of Windows Tiny7\n\nBased on: Windows 7 Ultimate x86 build 6.1.7600.16385 RTM\n\nTo install Windows Tiny7 from this CD, set your PC\nup so it will boot from the CD-ROM in the PC's BIOS.\n\nThere is no upgrade option available in Tiny7, because the option\nis removed.\n\nOnly install Tiny7 onto a freshly formatted partition or hard disk.\n\nYou do not need any product key in this release - the installation\nof Tiny7 is unattended, apart from in the very beginning where you\nchoose which drive or partition to install to.\n\nAll installations are set to US English. If you do not want the US\nkeyboard settings, you will have to change this in Windows when it\nhas installed (as opposed to choosing it at install time), its easy\nenough, just open the &quot;Keyboard Settings&quot; folder in the desktop\neXPerience folder and read the included ReadMe.txt that is there.\n\n__________________________________________________ ______________________\n\nThis guide is split into the following sections:\n\n- Statistics\n- General Windows components that are kept\n- Included Features\n- Installed programs\n- Desktop eXPerience Folder\n- Quick Launch Enabler\n- Whats added to the right-click of &quot;Computer&quot;\n- Kept components\n- Removed components (in 3 stages)\n- Special note from eXPerience\n- Forum url\n\n__________________________________________________ ______________________\n\nStatistics:\n\n- ISO File Size.............................. 699 Mb\n- RAM Usage On First Installation............ 145 Mb (idle for 5 mins)\n- Entire Installation Size................... 2.46 Gb\n- WINDOWS Folder Size........................ 2.40 Gb\n- Running Processes, total................... 24\n- Running Processes, Windows................. 22\n- Install Time In VMware..................... 10 to 15 minutes*\n\n*The operating system takes 10 minutes to get to first logon, but on\nfirst logon the activation process takes a few minutes and in total\nit all adds up to about 15 minutes.\n\n__________________________________________________ ______________________\n\nGeneral Windows components that are kept:\n\nThis installation still includes, but is not limited to:\n\n- Aero Theme\n- Fax Support\n- Internet Explorer 8\n- Modem Support\n- Most Languages (only Chinese, Japanese and Korean are removed)\n- Printer Support\n- Smart Card Support\n- Windows Sounds\n- Windows Update\n\n(See the complete list below of what is kept in vLite)\n\n__________________________________________________ ______________________\n\nIncluded Features:\n\n- eXPerience Desktop folder with vital essentials\n- eXPerience Wallpaper\n- Quick Launch enabler on desktop (Thanks to ntoskrnl)\n- Dozens of tweaks to improve Windows\n- Watermark &quot;Test Mode&quot; removed\n- Windows is activated offline (Thanks to Hazar)\n\n__________________________________________________ ______________________\n\nInstalled programs:\n\n- DirectX 9c DLL Files (some standalone/ripped games might need these)\n- Everything Search v1.2.1.371 (find files and folders without waiting)\n- Flash v10.0.22.87 for IE (player for YouTube and Google Video etc)\n- Foxit PDF Reader Pro v3.0.1301 (open PDF files from the web in IE)\n- HashTab v2.1.1 (adds a tab on file properties to see file checksum)\n- WinRAR v3.80 (compression tool to handle various archive formats)\n\n__________________________________________________ ______________________\n\nDesktop eXPerience Folder\n\nMost of these folders contain quick solutions to things that otherwise\nwould be buried away in the Windows GUI, or you would have to know the\ncommand to run the item, like &quot;control userpasswords2&quot; will open the\nscreen to change your Windows 7 login password, or &quot;intl.cpl&quot; runs the\n&quot;Regional and Language Options&quot; from Control Panel.\n\n[eXPerience folder contents]\n- Comodo Firewall - Download link to Comodo Firewall.\n- Desktop Icon Layout - Allows you to save your desktop icon setup.\n- Hibernation - Turns Hibernation on/off with one double click.\n- Keyboard Settings - Quick way to open &quot;Regional and language Options&quot;\n- Registry Backup - Easily backup your registry in one double click.\n- TCPIP Patcher - Patch your tcpip.sys to allow 255 connections, not 10.\n- User Password - Easily change your password for Windows.\n\n[+ Links to useful items in Windows]\n- Add Remove Programs\n- Disk Management (diskmgmt.msc)\n- Event Viewer (eventvwr.exe)\n- Group Policy (gpedit.msc)\n\n__________________________________________________ ______________________\n\nQuick Launch Enabler\n\nOn the desktop is a tool that can enable Quick Launch in just one\nclick. You should run this ONCE only, if you want Quick Launch\nlike on XP/Vista.\n\nIf the program doesn't make Quick Launch the first time, just remove\nthe Quick Launch toolbar and run the enabler again.\n\nProgram created by ntoskrnl.\n\n__________________________________________________ ______________________\n\nOn the right click of &quot;Computer&quot; you have the following added:\n\n- Advanced System Properties\n- Device Manager\n- Edit Registry\n- MSCONFIG\n- Services\n\n__________________________________________________ ______________________\n\nTHE FOLLOWING COMPONENTS HAVE BEEN KEPT IN vLite:\n\nKEPT - [Accessories]\nCharacter Map, Disk Cleanup, Game Explorer, Notepad, Paint, Snipping\nTool, System Information, Welcome Center, Wordpad.\n\nKEPT - [Drivers]\nGeneric printer, QLogic Fibre Channel Adapter, Storage controllers.\n\nKEPT - [Hardware Support] (everything is kept)\nDynamic Volume Manager, Fax Support, Firewire (1394), Floppy Disk\nSupport, Infrared Support, Internet Small Computer System Interface,\nMicrosoft Multi-Path Bus, Modem Support, Printer Support, Smartcards,\nTV Tuner support, Windows HotStart, Windows Image Acquisition, Windows\nPortable Devices, WLAN Support, XBOX 360 Controller.\n\nKEPT - [Languages]\nArabic, Brazillian, Bulgarian, Croatian, Czech, Danish, Dutch,\nEstonian, Finnish, French, German, Greek, Hebrew, Hungarian,\nItalian, Latvian, Lithuanian, Norwegian, Polish, Portuguese,\nRomanian, Russian, Serbian, Slovak, Slovenian, Spanish,\nSwedish, Thai, Turkish, Ukrainian.\n\nKEPT - [Multimedia]\nIntel Indeo, Media Metadata Handler, Photo Metadata Handler, Shell\nevent sounds, Wallpapers, Windows Aero Theme.\n\nKEPT - [Network]\nDistributed File System, File and printer sharing (Server), Internet\nExplorer, Link-Layer Topology Discovery, Network and Sharing Center,\nNetwork Explorer, Quality of Service, RIP Listener, Windows Firewall.\n\nKEPT - [Services]\nApplication Experience, Background Intelligent Transfer Service,\nComputer Browser, Desktop Window Manager, DHCP, Distributed Link\nTracking Client, Distributed Transaction Coordinator, DNS Client,\nExtensible Authentication Protocol, Interactive Services Detection,\nInternet Connection Sharing, IP Helper, IPsec Policy Agent,\nMultimedia Class Scheduler, Network Access Protection Agent, Network\nList Service, Network Location Awareness, Protected Storage, Quality\nWindows Audio Video Experience, Remote Access Auto Connection Manager,\nRemote Access Connection Manager, Secondary Logon, Secure Socket\nTunneling Protocol, SSDP Discovery, SuperFetch, Task Scheduler,\nTCP/IP NetBios Helper, Telephony, TPM Base Services, Universal Plug\nand Play, User-mode Driver Framework, Volume Shadow Copy, WebDAV\n(WebClient), Windows Color System (WCS/ICM), Windows Connect Now,\nWindows Event Log, Windows Remote Management, Windows Time,\nWindows Update.\n\nKEPT - [System]\n16-bit Support, Beep, Component Cache, Disk Quota, Jet Database Engine,\nMDAC, Microsoft Client For NFS, Microsoft HTML engine, Run a legacy\nCPL elevated, Subsystem for UNIX-based Applications (SUA), User Account\nControl (UAC), Windows Picture and Fax Viewer (Shimgvw), Zip Folder.\n\n__________________________________________________ ______________________\n\nREMOVED ITEMS PART 1/3:\nDISM\n\nWith DISM the following packages were REMOVED:\n\nHyper V Common Drivers, Hyper V Guest Integration Drivers, Anytime\nUpgrade Results, Backup, BLB Client, Business Scanning Feature,\nClips In The Library, Client Wired Network Drivers, Common Modem\nDrivers, Printer Drivers, Tuner Drivers, Win Ocr, Gadget Platform,\nGroup Policy Client Extensions, IIS Web Server Add On, IIS Web\nServer Add On 2, Indexing Service, IE Troubleshooters, Links,\nLocalPack AU/CA/GB/ZA/US, Mobile PC Client Sensors, Optical Media\nDisc, PeerDist Client, Printing XPS Services, RasCMAK, RecDisc SDP,\nSample Content Ringtones, Secure Startup, ShareMedia Control Panel,\nShell HomeGroup, Shell Inbox Games, Sidebar Killbits SDP, Snipping\nTool, Sticky Notes, Terminal Services Command Line Tools, Terminal\nServices Misc Redirection, Terminal Services Publishing WMI Provider,\nTerminal Services Remote Applications Client, Terminal Services USB\nRedirector, Terminal Services WMI Provider, Windows Media Player\nTroubleshooters, WMP Network Sharing Service, XPS Foundation Client,\nNetworking MPSSVC Rules Ultimate Edition.\n\n___________________________________\n\nREMOVED ITEMS PART 2/3:\n\nDELETED DIRECTLY FROM MOUNTED IMAGE:\n\nAbout 550Mb was removed from:\nWindows\\System32\\DriverStore\\FileRepository\\\n\nAbout 585Mb was removed from:\nWindows\\winsxs\\\n\nThese items were: Printer Drivers, Modem Drivers and Camera Drivers.\n\nOther miscellaneous items were removed like the contents of the\nRecovery folder and certain folders from the Web folder.\n\n___________________________________\n\nREMOVED ITEMS PART 3/3:\nvLite\n\nIn vLite the following items were REMOVED:\n\n(vLite &quot;Last Session.ini&quot; is included in the sources folder)\n\nREMOVED - [Accessories]\nAccessibility, Inbox Games, Premium Inbox Games, Mobility\nCenter, Speech Support, Windows Sidebar and Gadgets.\n\nREMOVED - [Drivers]\nDiva Server, Modems, Scanners, TV Tuners.\n\nREMOVED - [Languages]\nChinese, Japanese, Korean.\n\nREMOVED - [Multimedia]\nMedia Center, Music and Video samples, Sample Pictures,\nScreensavers, SideShow, Sound Recorder, Windows Media\nCodecs, Windows Media Player.\n\nREMOVED - [Network]\nConnect to a Network Projector, Internet Information\nServices (IIS), Remote Desktop and Assistance, Remote\nDesktop Client, Simple Network Management Protocol\n(SNMP), Simple TCPIP services, Telnet Client, Telnet\nServer, TFTP Client, Windows Collaboration, Windows\nMail.\n\nREMOVED - [Services]\nDiagnostics, Error Reporting, Offline Files, Remote Registry,\nRouting and Remote Access, TPM Base Services, Windows Search.\n\nREMOVED - [System]\nBitLocker Drive Encryption, Crash Dump Support, Digital\nRights Management (DRM), Help, IMAPIv2 Burning Support,\nManual Install (Setup.exe), Microsoft Message Queue (MSMQ),\nNatural Language, Parental Controls, Performance Counters,\nReliability and Performance Monitor, Remote Differential\nCompression, Security Center, Software Quality Management\n(SQM), Sync Center, System Restore, Tablet PC, Windows\nDefender, Windows Easy Transfer, Windows SAT (Performance\nIndex).\n\n__________________________________________________ ______________________\n\nSpecial note:\n\nI have used this modded OS for a few days and it seems every bit as fast\nas Windows XP. If you have always wanted to use Vista, but were holding\nout for Windows 7 - its worth it! This slimmed edition boots up fast,\nshuts down fast, opens applications fast, even VMware v5.5 runs fast\non it once its started up. File copying seems no slower than XP. All\nin all this new Windows really blows away XP because of all the new\nfeatures. You have to remember XP is from 2001 when no one even had\nsuch a thing as &quot;Wireless&quot; or a SATA drive. Now all this new hardware\nruns on Windows XP but the OS was never designed to run it really.\nYou might wonder why not just use Vista - don't even go there. Lets\njust pretend Vista never existed. In fact Microsoft should have not\never released it but I guess they had to in order to improve on it\nand eventually get it right - with Windows 7.\n\n__________________________________________________ ______________________\n\n\nEnjoy this fine release\n\nBuild Date: 3rd August 2009\n\nRelease Date : Summer 2009\n\n\n\n\n\nCredits: To Orginal Source Provider!\n\n","torrent":{"xt":"urn:btih:207ae1569b3925081c6c906caa4afa1101d765ce","amp;dn":"Windows+Tiny7+Unattended+Activated+CD+%28x86%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"207ae1569b3925081c6c906caa4afa1101d765ce","infoHashBuffer":{"type":"Buffer","data":[32,122,225,86,155,57,37,8,28,108,144,108,170,74,250,17,1,215,101,206]},"announce":[],"urlList":[]}}