{"title":"KELLY BROOK TOPLESS CANDIDS - CANCUN, MEXICO June 16, 2013","uid":8585937,"size":113320209,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:208700cfdea576a2eb71b41a57aa239cd6e83df1&amp;dn=KELLY+BROOK+TOPLESS+CANDIDS+-+CANCUN%2C+MEXICO+June+16%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1371525407,"description":"144 JPG\nup to 2800x4500 pixels\n108 mb\n\nBritish model, TV personality and actress\n\nKelly Brook was born on 23 November 1979, in England in the town of Chatham, Kent. Kelly is a model, TV personality and actress. This hot young star began her career by winning a beauty contest that her mother had entered her in. Kelly ended up working as a model, initially for a local flooring company and supplemented her income working as a waitress.\n\nDiscovered by the Daily Star, Kelly started to appear in various British men's magazines like &quot;Loaded&quot;. The British tabloids were also not slow to catch on to her alluring looks and she became a favourite, particularly with male magazines, which became interested in her obvious qualities. Kelly's career really took off when she was announced as the successor to Denise Van Outen alongside Johnny Vaugn on the &quot;The Big Breakfast&quot;.\n\nWhile on vacation, Kelly learned of news reports circulating that her position as presenter on the &quot;Big Breakfast&quot; was to be terminated. Kelly elected to quit the show instead of being fired. Kelly, now out looking for a job, took the opportunity to become a model for Triumph International Underwear. A provocative image of her was placed on advertisements in London, which went on record for being the largest and most popular billboard in England, if not the world.","torrent":{"xt":"urn:btih:208700cfdea576a2eb71b41a57aa239cd6e83df1","amp;dn":"KELLY+BROOK+TOPLESS+CANDIDS+-+CANCUN%2C+MEXICO+June+16%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208700cfdea576a2eb71b41a57aa239cd6e83df1","infoHashBuffer":{"type":"Buffer","data":[32,135,0,207,222,165,118,162,235,113,180,26,87,170,35,156,214,232,61,241]},"announce":[],"urlList":[]}}