{"title":"Nicola Sturgeon - A Political Life (2015).epub Gooner","uid":12628170,"size":1778148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21691f56eafe222df6afdbbedd38bacf63bf8f50&amp;dn=Nicola+Sturgeon+-+A+Political+Life+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445801211,"description":"Publisher: Birlinn Ltd (March 18, 2015)\r\nLanguage: English\r\nISBN-10: 1780272960\r\nISBN-13: 978-1780272962\r\n\r\nBorn in Irvine in 1970 Nicola Sturgeon joined the SNP aged only 16 and devoted her teenage years to Glasgow University's Scottish Nationalist Association, after graduating in law she worked as a solicitor at the Drumchapel Law Centre in Glasgow. Sturgeon became the party's Youth Affairs Vice Convener and Publicity Vice Convener and first stood for Parliament at the 1992 general election - Scotland's youngest parliamentary candidate. In 1997 she contested Glasgow Govan, an urban working-class constituency that was to form the nucleus of her political career thereafter. Only in 2007 did Sturgeon manage to win the constituency from Labour, having secured a place in the Scottish Parliament via the Glasgow list in 1999 and 2003. Self-evidently a rising star within the SNP, she stood aside as a leadership candidate in 2004 to become Alex Salmond's running mate, quickly establishing herself as the party's leader at Holyrood. When the SNP formed its first (minority) administration in 2007 Sturgeon became Deputy First Minister and Cabinet Secretary for Health and Wellbeing, and swiftly became one of the Scottish Government's most successful ministers.Her reputation for efficiency and shrewd political judgement grew even more during the referendum negotiations of 2012 and the subsequent independence campaign. By the time Alex Salmond resigned as First Minister and SNP leader in the wake of a No vote Sturgeon was viewed as his inevitable successor. Ten years earlier she'd been perceived as what some called a 'nippy sweetie', a street-fighting Glaswegian politician lacking Salmond's broad populist appeal. But in the intervening period she had softened her image and even begun to outstrip her mentor and boss in terms of voter approval","torrent":{"xt":"urn:btih:21691f56eafe222df6afdbbedd38bacf63bf8f50","amp;dn":"Nicola+Sturgeon+-+A+Political+Life+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21691f56eafe222df6afdbbedd38bacf63bf8f50","infoHashBuffer":{"type":"Buffer","data":[33,105,31,86,234,254,34,45,246,175,219,190,221,56,186,207,99,191,143,80]},"announce":[],"urlList":[]}}