{"title":"Marc Ford - Holy Ghost [2013][320 KBPS]","uid":12126669,"size":126283112,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:21ec30390613b808b91d788491c8e774678436cf&amp;dn=Marc+Ford+-+Holy+Ghost+%5B2013%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":19,"time":1436939122,"description":"---------------------------------------\nMarc Ford - Holy Ghost [2013][320 KBPS]\n---------------------------------------\n\n01 If I'd Waited\n02 Blue Sky\n03 Dancing Shoes\n04 Dream #26\n05 In You\n06 I'm Free\n07 Just A Girl\n08 You Know What I Mean\n09 Turquoise Blue\n10 Sometimes\n11 Badge Of Descension\n12 Call Me Faithful\n-----------------------\n**320 KBPS [CBR]\n**Cover Art\n-----------------------\nMarc Ford (born April 13, 1966), is an American blues-rock guitarist. He's a former lead guitarist of the rock and roll jam band The Black Crowes and the leader of his own bands: Burning Tree, Marc Ford &amp; The Neptune Blues Club, Jefferson Steelflex, Fuzz Machine, Marc Ford &amp; The Sinners.\n\nFord was born in Long Beach, California, United States.\n\nFord began his career with the blues-rock outfit Burning Tree in the late 1980s. A power trio featuring Ford on guitars and vocals, Mark Dutton on bass and Doni Gray on drums, Burning Tree released their self-titled debut album on Epic Records in 1990. A commercial failure but a critical success, Burning Tree allowed Ford and Co. to tour extensively throughout most of 1990 and 1991. The band's career was cut short when Ford left to join The Black Crowes, whom Burning Tree had opened for on its first (and only) tour.\n\nIn mid-1991, Marc Ford sat in a couple of times with The Black Crowes in-concert, performing The Allman Brothers Band's classic hit, &quot;Dreams&quot;. When The Black Crowes severed their relationship with their original guitarist Jeff Cease, Ford was asked to fill the vacancy, stepping into the lineup just in time for the band to record their 1992 sophomore album, The Southern Harmony and Musical Companion. The album would go on to reach Number 1 on the Billboard charts and earn a double platinum certificate for sales. Ford would go on to perform on the next two Black Crowes releases, Amorica (1994) and Three Snakes and One Charm (1996) and is also credited for tracks from the band's two unreleased albums (1993's Tall and 1997's Band; later released together as The Lost Crowes). His addition to the Black Crowes sound, which consisted primarily of slide guitar and southern twang, helped define the band at the time. Ford's ability to adapt to core songwriter, Rich Robinson's music and crunchy rhythm guitar sound, solidified him and Robinson, as arguably, the preeminent guitar duo of the 1990s.\n\nFord was dismissed from the Black Crowes in the Fall of 1997, following the band's stint on the summer-long Furthur Festival tour, leaving fans wondering what direction the Crowes might be headed. Black Crowes leaders Chris and Rich Robinson cited Ford's excessive drug use as the reason for his firing, a reason that was confirmed by the guitarist entering a rehab facility soon after his \ndismissal.\n\nAfter producing Phantom Limb's The Pines album, he asked the band to return the favour by backing for his own next solo project. Ford has now sided with the Naim record label in the UK to release his next album, Holy Ghost on 14 April 2014. Ford recently announced the new album in Country Music magazine, where he discussed his story towards the new album","torrent":{"xt":"urn:btih:21ec30390613b808b91d788491c8e774678436cf","amp;dn":"Marc+Ford+-+Holy+Ghost+%5B2013%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21ec30390613b808b91d788491c8e774678436cf","infoHashBuffer":{"type":"Buffer","data":[33,236,48,57,6,19,184,8,185,29,120,132,145,200,231,116,103,132,54,207]},"announce":[],"urlList":[]}}