{"title":"Zooper Widget Pro + Ultra Pack for Zooper Widget","uid":13109964,"size":43932497,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:220d7713e4323073ac085045a7b846ba7132f89d&amp;dn=Zooper+Widget+Pro+%2B+Ultra+Pack+for+Zooper+Widget&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":2,"time":1451458948,"description":"Zooper Widget Pro v2.60\r\n\r\nMinimal, classy, extremely customizable, and battery friendly &quot;Do It Yourself&quot; widget with almost limitless possibilities!\r\n\r\nFREE FEATURES\r\n\r\n- Sample templates included, no need to download anything else\r\n- Some custom fonts already included, additional can be added on sdcard/fonts\r\n- Create your templates easily, no functional limit, tons of variables and controls\r\n- WYSIWYG editor with layers like Photoshop / Gimp\r\n- Build your style and change everything: color, text, shapes, position and more!\r\n- Completely customizable date and time (day of the year, week number, number to text...)\r\n- Date calculations (countdown, time to or from any date, calendar event or system attribute)\r\n- Full Math expressions supported (like Star Trek stardate)\r\n- Battery info (remaining time, percentage, temperature, voltage)\r\n- World clock (multiple timezones on the same widget)\r\n- Weather for current or multiple locations on the same widget\r\n- Up to 5 days forecast from multiple providers (Open Weather Map, YR.NO)\r\n- Calendar info with free customization\r\n- System info, like uptime, next alarm, SD card space\r\n- WiFi network name, cell operator, signal strength, connection type\r\n- Network traffic data stats for current day, week, month and more\r\n- Missed calls, unread SMS, unread GMail (multiple accounts and labels)\r\n- Sunrise, Sunset and Astrological Nautical or Civil twilight\r\n- Moon Rise, Set and Illumination percentage\r\n- Series for days, months and more!\r\n- Completely dynamic and customizable TTF and PNG iconsets\r\n- Static Bitmaps (PNG with alpha and JPG)\r\n- Progress Bars customizable with any numeric variable such as min/max and value\r\n- Tasker integration (see website)\r\n- Jelly Bean lock screen support\r\n\r\nPRO ONLY\r\n\r\n- No Ads\r\n- Widget on tap action / config lock (and &quot;module&quot; click action)\r\n- Load and Save templates on SD card\r\n- APK themes support\r\n- Buzz launcher support\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=org.zooper.zwpro\r\n\r\n\r\nUltra Pack for Zooper Widget v1.9\r\n\r\nUltra Zooper Pack is a collection of 108 extremely customizable skin templates for Zooper Widget Pro. This theme works with the stock launcher app and most third-party Home Screen replacement apps.\r\n\r\nTheme Features\r\n\r\n• 20 Weather Icon Sets;\r\n• 108 varying styled widgets including the popular S6/Edge+ long shadow widgets and G3 Smart Notice Widgets and more;\r\n• Dynamic widgets that automatically switches between Day and Night;\r\n• Scalable icon fonts which are vector and resolution independent. You can easily adjust icon style, such as color, size, shadows and more to suit your needs.\r\n\r\nInstallation\r\n\r\n1. Zooper Theme Ultra Pack isn't a standalone widget, make sure you have Zooper Widget Pro installed before applying this theme. Please note that free version of Zooper Widget doesn't allow you to install third-party skins.\r\n2. Launch Ultra Pack from your app drawer to install the Custom Fonts and Bitmaps.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.na.zwskin.ultratheme","torrent":{"xt":"urn:btih:220d7713e4323073ac085045a7b846ba7132f89d","amp;dn":"Zooper+Widget+Pro+%2B+Ultra+Pack+for+Zooper+Widget","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220d7713e4323073ac085045a7b846ba7132f89d","infoHashBuffer":{"type":"Buffer","data":[34,13,119,19,228,50,48,115,172,8,80,69,167,184,70,186,113,50,248,157]},"announce":[],"urlList":[]}}