{"title":"Namor-The Sub Mariner Part 1","uid":4238800,"size":1059919243,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:232c90ed6f40202088f2804fd867221dd51516b0&amp;dn=Namor-The+Sub+Mariner+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rishab","files":79,"time":1213434466,"description":"Namor the Sub-Mariner is a fictional, comic-book character in the Marvel Comics universe, and one of the first superheroes, debuting in Spring 1939. The character was created by writer-artist Bill Everett for Funnies, Inc., one of the first &quot;packagers&quot; in the early days of comic books that supplied comics on demand to publishers looking to enter the new medium. Initially created for the unreleased comic Motion Picture Funnies Weekly, the Sub-Mariner first appeared publicly in Marvel Comics #1 (Oct. 1939) ? the first comic book from Timely Comics, the 1930s-1940s predecessor of the company Marvel Comics. During that period, known to historians and fans as the Golden Age of Comic Books, the Sub-Mariner was one of Timely&amp;#039;s top three characters, along with Captain America and the original Human Torch. Everett said the character&amp;#039;s name was inspired by Samuel Coleridge&amp;#039;s poem, &quot;The Rime of the Ancient Mariner&quot;.\n\nPart 1 contains the Sub Mariner which ran from 1968 to 1974, a total of 72 issues and 2 Annuals. This torrent also contains a 4 issue Limited series by Marvel in 1984. Now Marvel has really goofed up with Vol nos. as Limited series is mentioned as vol. 1 and earlier series had no vol. label. And the golden age is completely forgotten. I havent posted the Golden Age Sub Mariner has I didnt had all the issues. Maybe Citaltras can post them here. He has a lot of Golden Age comics.\n\nNamor, along with the Hulk are two of the most widely recognised Anti Heroes of the comic world. Pointed ears of Namor perhaps point to his short temper furious nature.I personally like Namor a lot along with the Hulk. \n\nPart 2 contians Saga of Sub Mariner and other two run ups of Namor, which will be posted after this is well seeded. So download it, enjoy it and also seed it well.","torrent":{"xt":"urn:btih:232c90ed6f40202088f2804fd867221dd51516b0","amp;dn":"Namor-The+Sub+Mariner+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"232c90ed6f40202088f2804fd867221dd51516b0","infoHashBuffer":{"type":"Buffer","data":[35,44,144,237,111,64,32,32,136,242,128,79,216,103,34,29,213,21,22,176]},"announce":[],"urlList":[]}}