{"title":"EXPLOITED COLLEGE GIRLS - Sunny - 19yo Her First Hard Fuck","uid":9304273,"size":509498520,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:24b2d4f3b02b4873ff893442db06438f9eb0cd99&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Sunny+-+19yo+Her+First+Hard+Fuck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1386290136,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=mgeb4_ceg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=mgeb4_ceg.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=qtoaf_ceg2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=qtoaf_ceg2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=qvb2i_ecg_sunny_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=qvb2i_ecg_sunny_s.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=71c15_suu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=71c15_suu.jpg&lt;/a&gt;\n\n\nBlonde hair, blue eyes, totally uninhibited, expert blowjob skills and a banging' body? That's what Sunny brings to the party and let me tell you, it's enough. From the start of this update Sunny seems giggly and nervous, but it doesn't stop her from performing. She's extremely sexual and totally comfortable in front of the camera and it shows.\n\nAs usual, we start off in the bathroom where Sunny confesses her sexual sins to me while applying her make up when she brags about her BJ skills, you know what happens: put up or shut up. I have her drop to her knees on the spot and start sucking. Whenever a girl tells me that she's &quot;never gotten any complaints&quot; about her BJ skills I always shake my head because, seriously ladies, who is going to complain about even a terrible BJ? Hello? My dick is in your mouth, unless you are getting toothy even a bad BJ is pretty damn good. In Sunny's case, however, she's telling the truth, she's got fantastic oral skills.\n\nBefore I blow my load in her mouth, I usher her to the bed so we can get this update started for real. She isn't wearing much, but I have her strip anyway to show off her perky, tiny titties and long pale legs. I try to get her off with my fingers and while we almost get there, Sunny tells me that all she needs to get off is penetration. I grab a dildo to grant her wish and she thanks me with a huge, vocal orgasm.\n\nSeeing how turned on Sunny is, I definitely want to fuck her, so I have her drop to her knees and suck me some more until I'm hard and then I throw her face down on the bed and climb on her to give her the D. She wasn't lying when she said she likes penetration, as soon as I'm inside her she goes crazy and totally loses herself in the sex. I fuck her face down, doggy, cowgirl and in every position she cums at least once. Finally I can't hold out any longer and I have her drop to her knees so I can facialize her.\n\nI admit it took me a while to get over Sunny's nonstop icicle-in-the-ear giggling, but I found out that there's an easy way to get her to stop giggling: stick my cock in her throat or fuck her hard enough so all she can do is moan as she cums over and over. That's a deal I can live with, especially since her BJ skills are so above and beyond and her &quot;O&quot;&quot; face is so damn sexy.\n","torrent":{"xt":"urn:btih:24b2d4f3b02b4873ff893442db06438f9eb0cd99","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Sunny+-+19yo+Her+First+Hard+Fuck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b2d4f3b02b4873ff893442db06438f9eb0cd99","infoHashBuffer":{"type":"Buffer","data":[36,178,212,243,176,43,72,115,255,137,52,66,219,6,67,143,158,176,205,153]},"announce":[],"urlList":[]}}