{"title":"Diana Jones - Museum of Appalachia Recordings [2013] [EAC.Log,Cu","uid":9504979,"size":187439456,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:25e48994c7a2281f2adb7e4f632601a11c0f200e&amp;dn=Diana+Jones+-+Museum+of+Appalachia+Recordings+%5B2013%5D+%5BEAC.Log%2CCu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1390301786,"description":"Artist: Diana Jones\nRelease: Museum of Appalachia Recordings \nReleased: 2013\nLabel: Proper \nCatalog#: PRPCD111\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: country,folk,americana\n\nimage\n\n\n\n1. O Sinner\n2. Drunkard's Daughter\n3. Song for a Worker\n4. Sparrow\n5. Ohio\n6. Love O Love\n7. Orphan's Home\n8. Goldmine\n9. Satan\n10. Tennessee\n11. The Other Side)\n\n\n\n\nSinger-songwriter Diana Jones brings the inspiring sounds of old-time Appalachia music to her new album, recorded at The Museum of Appalachia in Clinton, Tennessee. Featuring 11 original songs recorded live with two musicians and a crackling fireplace in the background, 'Museum of Appalachia Recordings', due for release on the 8th July, harkens back to a day when music was played and recorded live, and not adorned with the latest tricks in recording technology.\n\nAccompanied by fellow musicians Matt Combs and Shad Cobb, Diana Jones offers an astonishing set of original material. Widely known for her songwriting expertise (Pony, Henry Russell's Last Words), Diana Jones's storytelling reaches new heights as she explores timeless subjects that are as relevant today as they were in the last century. And her singing is that rarest of gifts: a pure and original voice that is unmistakably her own.\n\nIn Diana's own words, &quot;Songs tell us how they need to be arranged and recorded if we listen closely. Some need a studio with isolation booths for a variety of musicians to overdub parts and some need a cabin with a few good pickers and a fireplace big enough to sit in. The songs I recorded at the Peters Homestead Cabin at the Museum of Appalachia were scratched out of my head and mined from my heart over the years since my grandfather passed on his love and tradition of old time mountain music to me. They were insistent and came to me during a busy few years on tour buses, in airplanes, hotel rooms and back stage dressing rooms. These songs had been waiting patiently for a quiet room with old time musicians gathered to let their simplicity shine in real time. Bringing them to The Museum of Appalachia in east Tennesse, an institution sanctioned by the Smithsonian Museum in Washington, DC, guardian of the recordings that had changed my musical life, was a full circle for me.&quot;\n\n&quot;The fire at the Peter's cabin was lit the morning of December 3rd, 2012 as sound engineer Joe DeJarenette set up his equipment and the mikes were set in place. Matt Combs, Shad Cobb and I took our seats in a circle facing each other and began to play the first song in my black and white marble composition book. Fiddles, mandolins, guitars, banjos and a mandola were strewn around the room. We traveled from song to song and trusted that the feeling was there, along with the crackling sound of the wood burning in the fireplace. After two days of playing these special songs it was hard to imagine all that had happened as the last of the fire died down. We had made a record of the time we spent in the Peters Cabin on Dec 3rd and 4th at the Museum of Appalachia. I hope you enjoy listening as much as we did recording it.&quot;..","torrent":{"xt":"urn:btih:25e48994c7a2281f2adb7e4f632601a11c0f200e","amp;dn":"Diana+Jones+-+Museum+of+Appalachia+Recordings+%5B2013%5D+%5BEAC.Log%2CCu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25e48994c7a2281f2adb7e4f632601a11c0f200e","infoHashBuffer":{"type":"Buffer","data":[37,228,137,148,199,162,40,31,42,219,126,79,99,38,1,161,28,15,32,14]},"announce":[],"urlList":[]}}