{"title":"In-N-Out Burger - Perman, Stacy","uid":9238482,"size":1702342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26a29564a0a966c064a19cee81a2e448bc6c9eb4&amp;dn=In-N-Out+Burger+-+Perman%2C+Stacy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1385226143,"description":"Overview: , BusinessWeek writer Stacy Perman presents a chronicle of how a family-run California hamburger joint went on to become an American pop culture icon. Founded in 1948 by Harry Snyder and his wife Esther in Baldwin Park, CA, In-N-Out Burger attracted a cult-like fanbase of cruising teens, surfers, and celebrities alike (who developed a secret shorthand for custom orders). As they expanded slowly over the years across California and into Nevada, Arizona, and Utah, they never sacrificed their core customer-service values and commitment to quality. Their made-to-order success story packs enough family drama to fuel an HBO miniseries. After Harry died in 1976, his son Rich took over the business (and was responsible for adding discreet Bible verses to In-N-Out cups and wrappers) until his death in a 1993 plane crash. His brother Guy, a drag-racing rebel with a dark side, stepped in to helm the business until his accidental overdose in 1999. If you've never had an In-N-Out burger, Perman's book just might inspire you to find a good reason to get yourself to Southern California and seek out an off-the-menu 3x3 with a side of Animal Style fries\n","torrent":{"xt":"urn:btih:26a29564a0a966c064a19cee81a2e448bc6c9eb4","amp;dn":"In-N-Out+Burger+-+Perman%2C+Stacy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26a29564a0a966c064a19cee81a2e448bc6c9eb4","infoHashBuffer":{"type":"Buffer","data":[38,162,149,100,160,169,102,192,100,161,156,238,129,162,228,72,188,108,158,180]},"announce":[],"urlList":[]}}