{"title":"B-C-N Nanotubes and Related Nanostructures - Yoke Khin Yap","uid":15520720,"size":12220448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26febc7e60c2b8465b52778dc07c9a8fd14aed70&amp;dn=B-C-N+Nanotubes+and+Related+Nanostructures+-+Yoke+Khin+Yap&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1470748774,"description":"B-C-N Nanotubes and Related Nanostructures - Yoke Khin Yap (Springer, 2009).pdf\r\n\r\nCarbon nanotubes (CNTs) and Boron nitride nanotubes (BNNTs) are part of the so-called B-C-N material system, which includes novel nanostructures of carbon (C), doped-carbon, boron (B), boron nitride (BN), carbon nitride (CNx), boron-carbon nitride (BxCyNz), and boron carbide (BxCy). BNNTs and CNTs are structurally similar and share extraordinary mechanical properties, but they differ in chemical, biological, optical, and electrical properties. Therefore, hybrid nanotubes constructed of B, C, N elements are expected to form a new class of nanotubes with tunable properties between those of CNTs and BNNTs. In addition, these B-C-N nanostructures will further enhance and complement the applications of CNTs and BNNTs. With contributions from leading experts, B-C-N Nanotubes and Related Nanostructures is the first book to cover all theoretical and experimental aspects of this emerging material system, and meets the need for a comprehensive summary of the tremendous advances in research on B-C-N materials in recent years","torrent":{"xt":"urn:btih:26febc7e60c2b8465b52778dc07c9a8fd14aed70","amp;dn":"B-C-N+Nanotubes+and+Related+Nanostructures+-+Yoke+Khin+Yap","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26febc7e60c2b8465b52778dc07c9a8fd14aed70","infoHashBuffer":{"type":"Buffer","data":[38,254,188,126,96,194,184,70,91,82,119,141,192,124,154,143,209,74,237,112]},"announce":[],"urlList":[]}}