{"title":"Adobe_Photoshop_CS5_En-Ru-Ukr_12.0.1_by_MarioLast.exe","uid":11632078,"size":134056134,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2774df1d6421957722c87a668615efa9195be191&amp;dn=Adobe_Photoshop_CS5_En-Ru-Ukr_12.0.1_by_MarioLast.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lissa222","files":1,"time":1417690055,"description":"[img[https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQtQeCi89li3DxBclde6qgfzFxMbvEKP5qPCS5cKgnsQTtsUwkt&quot; /&gt;\nAdobe Photoshop has been the industry-standard image editing software for two decades now, and is used by professional photographers, artists and designers all over the world. Despite the best efforts of competitors such as Corel Paint Shop Pro, Apple's iPhoto, and the open source GIMP, there really isn't anything that comes close to Adobe's flagship product in terms of features, performance or quality. \nThere isn't much that comes close to the price either; the full version of Photoshop CS5 for Windows PCs costs over Â£600, while Photoshop CS5 Extended (which adds video and 3D handling functions) costs close to Â£900, and the whole Creative Suite 5 package, which includes Photoshop, Illustrator, InDesign, Dreamweaver, Acrobat, Fireworks and more, can cost over Â£1,600 depending on which version you choose. If you already have Photoshop CS2, CS3 or CS4 you can get the upgrade package for around Â£185, which is still expensive but slightly more affordable. Since it is always an issue that gets mentioned in the comments section, I'll also register my protest at the usual Dollars-for-Pounds price equivalence. In the USA the PC version of Photoshop CS5 costs around $600, which is roughly Â£400 in real money. I've read Adobe's official explanation for the massive price differential, but it doesn't take any of the sting out of being charged 50 percent more for the same product","torrent":{"xt":"urn:btih:2774df1d6421957722c87a668615efa9195be191","amp;dn":"Adobe_Photoshop_CS5_En-Ru-Ukr_12.0.1_by_MarioLast.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2774df1d6421957722c87a668615efa9195be191","infoHashBuffer":{"type":"Buffer","data":[39,116,223,29,100,33,149,119,34,200,122,102,134,21,239,169,25,91,225,145]},"announce":[],"urlList":[]}}