{"title":"The Fight: A Secret Service Agents Inside Account by Dan Bongino","uid":14469321,"size":883124,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:286baee800ae94b9af9032decf2387cad50d76d8&amp;dn=The+Fight%3A+A+Secret+Service+Agents+Inside+Account+by+Dan+Bongino&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":3,"time":1461887809,"description":"The Fight: A Secret Service Agent's Inside Account of Security Failings and the Political Machine by Dan Bongino\r\nHardcover: 240 pages\r\nPublisher: St. Martin's Press (January 12, 2016)\r\nLanguage: English\r\nISBN-10: 1250082986\r\nISBN-13: 978-1250082985\r\n\r\nThe New York Times bestseller!\r\n\r\nIn The Fight, Dan Bongino picks up the story where his New York Times bestselling book Life Inside the Bubble ends, tackling current political and security issues and offering new solutions. From Hillary's emails to the security failings at the White House (including the drone crash and the fence jumper); from Charlie Hebdo to Bowe Bergdahl--the author examines how our current administration has allowed our security efforts to lapse both at home and abroad. He also offers solutions to the growing terrorist threat and how we can protect American citizens while also deconstructing what's wrong with our political process and what his experience running for office has taught him.\r\n\r\nAs a former member of the elite Presidential Protection Division who served three Presidents, Bongino is uniquely qualified to provide a view from behind the curtain to warn readers about the political system that is failing them, and the security future that won't protect them. The majority of Americans only come into contact with security when they fly or enter their workplace. They are rarely able to become acquainted with the politicians they know from robo-calls and TV ads. Bongino has experienced the inner-workings of the national security apparatus and the failed political theater that we all feel but rarely understand. Using a mix of current events, an insider's analysis, and tales from his time protecting the president, he shows where clear and foreseeable leadership failures from our current administration led to grave consequences. From a broken political process to a president who consistently misreads the American people, he shows us where America has gone wrong and how we can fight back","torrent":{"xt":"urn:btih:286baee800ae94b9af9032decf2387cad50d76d8","amp;dn":"The+Fight%3A+A+Secret+Service+Agents+Inside+Account+by+Dan+Bongino","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286baee800ae94b9af9032decf2387cad50d76d8","infoHashBuffer":{"type":"Buffer","data":[40,107,174,232,0,174,148,185,175,144,50,222,207,35,135,202,213,13,118,216]},"announce":[],"urlList":[]}}