{"title":"GPS Speedometer for Android","uid":8000714,"size":1244790,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2875588b1f112f9840856b64dae05a113bedd643&amp;dn=GPS+Speedometer+for+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kaloyan78","files":-1,"time":1357749831,"description":"GPS speed application is a free software for Android devices with built-in GPS antena. It acts as a normal speed gauge, which you may find in any car, showing the velocity of the vehicle you are in.\n\nFacebook page:\n\nSite: &lt;a href=&quot;\nhttp://gps-android-speedometer-test.eu.pn/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://gps-android-speedometer-test.eu.pn/&lt;/a&gt;\n\nThere is also a flashlight available in GSpeed. You turn it on and off by simply clicking the green button, located in the top right corner of the app.\n\nNOTE: It works with most Android devices, but not all.\n\n\nIn miles per hour (MPH)\n\nDSpeed: https://play.google.com/store/apps/details?id=dspeed.speedo.speedometer.klb\n\n\nSome features of the speed app include:\nGPS Coordinates\n-Shows you your current GPS position - Longitude, Latitude and Altitude, as well as your top speed.\n\nGPS Speed\n-Your current speed and your maximum velocity, according to the sattelites.\n\nVehicle position\n-The pitch and roll of the vehicle you are in (the device must be in upright position according to the vehicle)\n\nUnits\n-The analog speedometer dial can be either in miles or kilometers per hour.\n\nHUD - heads up display\n-You can switch to HUD mode, which will show you your velocity digitally with large green numbers.\n\nMirror HUD mode\n-A mirror view of the digits, allowing you to put your phone on the dash of the vehicle, so that the readings of your speed in kilometers per hour can be reflected from the windshield at night.\n\n*Tested both on Samsung Galaxy S III and a Chinese phone with Android 2.3.4\n\n\nVideo of the HUD mode of the application:\n\n\n\nKeywords: GPS speed, GPS speedo, android GPS speedometer, digital speedometer, android speedometer, GPS, speed, speedometer, GPS test, gpsspeed, fast, rapid, slow, car GPS, GPS car, auto, GPS auto, GPS online, gps tracking, my speed, mileage, chainage, odometer, milage, car gps speedometer, speed car, gps speedometer android, gps android, android gps test","torrent":{"xt":"urn:btih:2875588b1f112f9840856b64dae05a113bedd643","amp;dn":"GPS+Speedometer+for+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2875588b1f112f9840856b64dae05a113bedd643","infoHashBuffer":{"type":"Buffer","data":[40,117,88,139,31,17,47,152,64,133,107,100,218,224,90,17,59,237,214,67]},"announce":[],"urlList":[]}}