{"title":"Dr Batcher v2.3.3 Portable","uid":8762321,"size":5955076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29d3b83d451999d94a2e9037032d0ca9d008730f&amp;dn=Dr+Batcher+v2.3.3+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nic25magg","files":-1,"time":1375266994,"description":"Portable Version of Dr Batcher:\n\nWhat is Doctor Batcher and why should you use it?\n\nDr.Batcher is the utility helping you to create and edit batch files in fast and simple way. Dr.Batcher is designed both for users that have never created BAT files before and for those who know their syntax very well. It provides you with two different modes of the batch file editor: simple and professional. In the first mode you can edit batch script with visual editors and wizards. The second mode provides you with a professional script editor supporting code tooltips, syntax highlighting and bookmarks. You can switch between different modes at any time you need. Creating new BAT scripts and editing the existing ones have never been easier! \n\n\nFeatures of Dr.Batcher \n - Simple mode: create BAT files with visual editors and wizards  \n - Professional mode: create BAT files with full-featured and highly customizable text editor with syntax highlighting, code tooltips, lines numbering and bookmarks  \n - Easy switching between different modes of batch file editor  \n - Built-in support for most commonly used standard Windows and DOS commands  \n - Support for easy search of additional information on commands in the Web via Google, Yahoo, MSN Search  \n - Support for looking through environment variables and copying their values  \n - Expandability: easy to add new commands through XML files with their descriptions\n - Support for BAT scripts in Windows and DOS encoding, fast conversion of text from one encoding to another  \nÂ· Exporting BAT files to HTML, RTF (Microsoft Word), TeX and printing them with syntax highlight \n - Support for changing language of Dr.Batcher's user interface  \n - Windows 7 support  \n - Templates and examples (special packs of examples and ready-to-use BAT files for registered users)  \n \n","torrent":{"xt":"urn:btih:29d3b83d451999d94a2e9037032d0ca9d008730f","amp;dn":"Dr+Batcher+v2.3.3+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d3b83d451999d94a2e9037032d0ca9d008730f","infoHashBuffer":{"type":"Buffer","data":[41,211,184,61,69,25,153,217,74,46,144,55,3,45,12,169,208,8,115,15]},"announce":[],"urlList":[]}}