{"title":"The Anthony Cumia Show 2015-06-01 Matt Iseman MP4 MP3","uid":11982795,"size":350422254,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:29ed39fbfa524d1cdf2e0063a3455e5b1befcd6b&amp;dn=The+Anthony+Cumia+Show+2015-06-01+Matt+Iseman+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1433267322,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Matt Iseman\n\nEpisode 171 - Monday begins with a recap of Anthony's weekend in the city that included an interview with HuffPost Live, checking out the (hopefully) new TACS studio, and an appearance on Red Eye. Ant then talks about the new Sam Roberts show, his room at the Waldorf, Caitlyn Jenner, we watch abortion PSA's from Chile, a video of a &quot;flight lieutenant&quot; from Zimbabwe, see Enrique Igelsias failing to touch a drone, and talk about future drone use. We find out about Pierre Bernard's doll collection from Conan O'Brien, hear about a Mila Kunis stalker, attempt to breakdown the mentality of stalkers, and read about Silk Road founder Ross Ulbricht getting sentenced to life in prison. Ant joins Matt Iseman at the poker table to talk about inadvertently changing speech patterns when interviewed, Alex Jones, unimportant stories people get distracted by, Jim Norton's weight loss, the comics that Opie and Anthony launched, and drug use in the industry. They also discuss Sam Roberts and his new show, the Hallmark Channel, Jerry Seinfeld, PBA cards, shooting guns for fun, old jobs, and the old Universal Studios tour. The show wraps with Matt admitting he enjoys acting like a jackass, learning about his gig on Home and Family, getting (and not getting) emotional during movies, and Matt gives us a teaser story from American Ninja Warrior.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:29ed39fbfa524d1cdf2e0063a3455e5b1befcd6b","amp;dn":"The+Anthony+Cumia+Show+2015-06-01+Matt+Iseman+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29ed39fbfa524d1cdf2e0063a3455e5b1befcd6b","infoHashBuffer":{"type":"Buffer","data":[41,237,57,251,250,82,77,28,223,46,0,99,163,69,94,91,27,239,205,107]},"announce":[],"urlList":[]}}