{"title":"The Moth","uid":4725968,"size":69185095,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2ae6fd7188010d53fa2cf78a45179062df65a481&amp;dn=The+Moth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":7,"time":1234752211,"description":"This torrent contains a complete set of Steve Rude's The Moth comic.\n\nThe Moth (real name Jack Mahoney) is a fictional superhero published by Dark Horse Comics. Created by Steve Rude, he first appeared in Steve Rude's The Moth #1 (April 2004).\n\nThe Moth is secretly circus performer Jack Mahoney. Mahoney developed the Moth costume for his high wire act, but instead uses it catch criminals who have bounty's out on them. During the 4 issue stint he encounter's a biker gang, who's lead member has a bounty on his head The Moth catches and turns him in. A Supernatural Lion creature who go's on a kill spree. That includes his mentor, the ringmaster of the circus he's part of. He then Inherits the circus not before inlisting the gang of bikers he butted heads with earlyer. To help track down the creature and stop the rampage it's on. After that story finishes The Moth in a homage to the fims 'Yojimbo' and 'A Fist Full Of Dollers'. Go's on to play two rival mob's against each other and collects bounty's on both of them. After that theres a story where your intoduced to The Moth's Corrupt and rival bounty hunter Nestor Delgado. This story also brings in a reoccurring character called American Liberty. A young, attractive TV superhero who's father was a war hero of had the same moniker back in WW2. continued soon.... \n\nOf course soon for our good friend Steve Rude is a relative term. He is known for taking the time it takes to render his quality and style of artwork, and he has historically been unwilling to compromise. That's what we love about him, and it \nmakes his work well worth the wait.\n\nThanks to the scanners and the original sources who shall remain nameless.\n\nPlease seed. Please enjoy.\n","torrent":{"xt":"urn:btih:2ae6fd7188010d53fa2cf78a45179062df65a481","amp;dn":"The+Moth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae6fd7188010d53fa2cf78a45179062df65a481","infoHashBuffer":{"type":"Buffer","data":[42,230,253,113,136,1,13,83,250,44,247,138,69,23,144,98,223,101,164,129]},"announce":[],"urlList":[]}}