{"title":"Shrek the Third(2007)DVDRip.AC3(ENG)-DROCK","uid":6667982,"size":734605312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2bc0e3d11cba4fd9bec96e745b951415e777833f&amp;dn=Shrek+the+Third%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1315766408,"description":"Shrek and Fiona's (Mike Myers and Cameron Diaz, respectively) fairy-tale wedding has gone off without a hitch, yet just as the beaming newlyweds prepare to enjoy their blissful &quot;happily ever after,&quot; the sudden death of King Harold (John Cleese) finds everyone's favorite ornery ogre being reluctantly fitted for the royal crown. Troubled to learn that not only will he be compelled to rule Far Far Away, but that he and Fiona are also expecting a little ogre, Shrek determines to track down his new bride's rebellious cousin, Artie (Justin Timberlake) -- the one true heir to the throne -- in order to focus on fatherhood without the added distraction of having to preside over the kingdom. As Shrek sets out with faithful companions Donkey (Eddie Murphy) and Puss in Boots (Antonio Banderas) to locate the medieval high-school slacker and bring him back to become the reigning sovereign of Far Far Away, handsome snake Prince Charming (Rupert Everett) slithers back to the castle in the company of the dreaded Captain Hook (Ian McShane) to stage a diabolically timed coup and assume control of the throne. Now, as Shrek, Donkey, and Puss in Boots do their best to wrangle up the feisty Artie, Fiona must enlist the aid of fighting princesses Snow White (Amy Poehler), Sleeping Beauty (Cheri Oteri), Rapunzel (Maya Rudolph), and Cinderella (Amy Sedaris) to barricade the castle and fend off Prince Charming's invading army of fairy-tale villains until her beloved husband can return with the cavalry to save the day. \n\nRipped with Autogk.\n\nLength: 1 Hour 32 Minutes\n\nFile Type: AVI\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 30fps\n\nAudio\n\nBit Rate: 113kbps","torrent":{"xt":"urn:btih:2bc0e3d11cba4fd9bec96e745b951415e777833f","amp;dn":"Shrek+the+Third%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bc0e3d11cba4fd9bec96e745b951415e777833f","infoHashBuffer":{"type":"Buffer","data":[43,192,227,209,28,186,79,217,190,201,110,116,91,149,20,21,231,119,131,63]},"announce":[],"urlList":[]}}