{"title":"JT 09.HEADSTONE.Ken Bruen.mb4","uid":8840400,"size":149735373,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2bcc49a4ee770e07654ebc14acdfb43b9dd2052e&amp;dn=JT+09.HEADSTONE.Ken+Bruen.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1377227642,"description":"Some people help the less fortunate. Others kill them. Welcome to Headstone - Jack Taylor's darkest nightmare.\n\nAn elderly priest is viciously beaten until nearly dead. A special needs boy is brutally attacked. Evil has many guises. Jack Taylor has encountered most of them but nothing before has ever truly terrified him until a group called Headstone rears its ugly head. A series of seemingly random, insane, violent events has even the national police, the Guards, shaken.\n\nMost would see a headstone as a marker of the dead, but this coterie of evil intends to act as a death knell to every aspect of Jack's life as an act of appalling violence alerts him to the horror enveloping Galway.\n\nAccepting the power of Headstone, Jack realizes that in order to fight back he must relinquish the remaining shreds of what has made him human--knowledge that may have come too late to prevent an act of such ferocious evil that the whole country would be changed forever--and in the worst way.\n\nWith awful clarity, Jack knows that not only might he be powerless to stop it but that he may not have the grit needed to even face it.","torrent":{"xt":"urn:btih:2bcc49a4ee770e07654ebc14acdfb43b9dd2052e","amp;dn":"JT+09.HEADSTONE.Ken+Bruen.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bcc49a4ee770e07654ebc14acdfb43b9dd2052e","infoHashBuffer":{"type":"Buffer","data":[43,204,73,164,238,119,14,7,101,78,188,20,172,223,180,59,157,210,5,46]},"announce":[],"urlList":[]}}