{"title":"Dark Spectrum - Whisper (2011)","uid":6835149,"size":34204737,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c0318f29cff707b466ebb19dbbe95764d227568&amp;dn=Dark+Spectrum+-+Whisper+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"unhallowedblood","files":6,"time":1322002193,"description":"All five tracks ripped from the master disc at 192kbs.  Included is the cover art.\n\nEnjoy and pass it along, we're releasing this for free!\n\n&quot;Whisper&quot;, the new album from Chicago metallers DARK SPECTRUM, will be released for free download on November 22 via Bit Torrent and the band's official Reverb Nation page.  The CD was recorded at Apothica Studios in Batavia, Illinois.  Joe Tiberi of MECHINA once again handled production and recording duties, as well as the mixing and mastering.\n\nThe track listing is as follows:\n\n01. Whisper\n02. The Soil Is Sour\n03. Perplexed In Chaos\n04. Sociopath\n05. Blood Of The Lambs\n\nCommented DARK SPECTRUM bassist Thatcher Markham:  &quot;We had a full blown concept for an album cover but it had to be scrapped for two reasons, contractual obligations and money.  We disbanded and wanted to release the album  for free but the fact that we weren't going to sell it went against the contract signed with the artist.  So what you see, this isn't what it was meant to be, but it serves its purpose.  Fitting that this was the last photo ever taken of us as a band.\n\n&quot;All the time, effort, work, heart, and soul, to just let these songs disappear and fade away without a release of any sort is just completely unacceptable to us.  Even though we will probably never be a band again the four of us are extremely proud of what we wrote and recorded.  At this point its just about getting the music out there for free to anyone that wants it and about closure and solace for us.\n\n&quot;People allegedly don't pay for music anymore anyway, so consider this an offering out to the metal world so to speak.\n\nCommented DARK SPECTRUM lead guitarist Dennis Franco:  &quot;Although the band did not go as far as it could have, I feel as though I am entirely 100% accomplished with the album.  The album itself is the biggest reward to me that came out of this journey with DARK SPECTRUM.\n\nCommented DARK SPECTRUM drummer Nick Whitmore:  &quot;Making Whisper was one of the most enlightening experiences in my life. The music speaks for itself, it's a real power coming into it's own sound and displaying a message that makes it, in my mind, a one of a kind work of art. Dark Spectrum was a journey of great success in my opinion, the release of this album the final proof. In my parting words of Whisper and Dark Spectrum; please listen to our album as a one time experience into a world that was built and and destroyed, so like the theme Whisper in itself was written about","torrent":{"xt":"urn:btih:2c0318f29cff707b466ebb19dbbe95764d227568","amp;dn":"Dark+Spectrum+-+Whisper+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c0318f29cff707b466ebb19dbbe95764d227568","infoHashBuffer":{"type":"Buffer","data":[44,3,24,242,156,255,112,123,70,110,187,25,219,190,149,118,77,34,117,104]},"announce":[],"urlList":[]}}