{"title":"The Walking Dead 2x08 - Nebraska Spanish HD by Belakorr","uid":7029711,"size":379192930,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c912955229eea10a0aa8534720109b79ca67f47&amp;dn=The+Walking+Dead+2x08+-+Nebraska+Spanish+HD+by+Belakorr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Belakorr","files":1,"time":1329189150,"description":"Este es el episodio 8 de la temporada 2 de The Walking Dead en idioma espaÃƒÂ±ol en HD. El unico problema es que el video dura 50min y el capitulo son 45 el resto es repetido, mis disculpas.\n\nMe presento puesto que es el primer torrent que subo, mi apodo es Belakorr.\nDebido a los acontecimientos recientes de cierre de pÃƒÂ¡ginas web comoy por consiguiente efecto dominÃƒÂ³ de todas sus compaÃƒÂ±eras \npor miedo a sufrir el mismo castigo, creo que la salida mÃƒÂ¡s conveniente para seguir compartiendo series tan buenas como esta es explotar \nel tan querido por todos P2P, el cual en idioma castellano carece de torrents o si los hay de semillas.\nDependiendo de la acogida de este torrent, me plantearÃƒÂ© de esto algo habitual por el bien de todos.\n\nSaludos - Belakorr\n\n\n-----------------------------------------------------------------------------------\n\n\n\nThis is the episode 8 from season 2 of The Walking Dead on Spanish language on HD. The only problem is the video's length is 50min aprox but the episode is only the first 45min as you will see, the rest is repeated, sorry for that.\n\nGreetings! I'm Belakorr and this is my first torrent.\nSince all the problems we're having withclosing, and all the other filesharing pages following it I've decided it's time to\nstart focusing on P2P, which is awesome but not well known in Spanish language, and so I'll do my best for it.\nDepending on how shared this torrent takes I may take this as a routine.\n\nSincerily - Belakorr","torrent":{"xt":"urn:btih:2c912955229eea10a0aa8534720109b79ca67f47","amp;dn":"The+Walking+Dead+2x08+-+Nebraska+Spanish+HD+by+Belakorr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c912955229eea10a0aa8534720109b79ca67f47","infoHashBuffer":{"type":"Buffer","data":[44,145,41,85,34,158,234,16,160,170,133,52,114,1,9,183,156,166,127,71]},"announce":[],"urlList":[]}}