{"title":"Convenience Store Girl Uses Anus For Public Convenience","uid":8714704,"size":841775937,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2cb63cd81af8726beb925a38f5e480c459b6aa85&amp;dn=Convenience+Store+Girl+Uses+Anus+For+Public+Convenience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1374310431,"description":"Small tits and blue finger nails, Tien works in the seven eleven convenience store. Another of these cute young birds with a dead end job, and a wish for excitement. Not that she has got much prospect of a more interesting career, but she is willing to provide the customers with what they need at seven in the morning. A small tube of toothpaste and a hotdog in a bun, is there anything else I need? So she gets off her shift at seven thirty and I escort her straight to my room. She thinks she is now living the high life. She gets her kit off easily enough and has got a good firm figure. And do you believe it, she takes it straight up the bum hole. There she is, an anal assholed bum fucked botty bimbo, willingly spreading her cheeks high up for my easy access, with the face pressed against my fake parquet flooring. I am sure she was impressed. She did not say much, but she was using her sphincter muscles for a little grip of my wanger, each time I gave a her a thrust. I got right up her guts, I must have come my load two thirds the way round her small intestine. Next time you get something at the convenience store, look out for Tien, and buy some toothpaste. Either that or watch the sodding video. ","torrent":{"xt":"urn:btih:2cb63cd81af8726beb925a38f5e480c459b6aa85","amp;dn":"Convenience+Store+Girl+Uses+Anus+For+Public+Convenience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cb63cd81af8726beb925a38f5e480c459b6aa85","infoHashBuffer":{"type":"Buffer","data":[44,182,60,216,26,248,114,107,235,146,90,56,245,228,128,196,89,182,170,133]},"announce":[],"urlList":[]}}