{"title":"(1969) Laura Nyro - New York Tendaberry (Remastered + Bonus) [FL","uid":8920014,"size":316369696,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2cd8ff6defb8407fd6869a0f62f60b3c3d5c51d0&amp;dn=%281969%29+Laura+Nyro+-+New+York+Tendaberry+%28Remastered+%2B+Bonus%29+%5BFL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"100.XY","files":-1,"time":1379231317,"description":"Laura Nyro - New York Tendaberry\n\n\nWikipedia:\nNew York Tendaberry is an album by New York-born singer, songwriter and pianist Laura Nyro. It was released in the autumn of 1969 on Columbia Records, some eighteen months after its predecessor, Eli and the Thirteenth Confession. The album is generally considered by rock critics and Laura Nyro aficionados to be her greatest musical achievement. It was helmed by her, with the assistance of producer and engineer Roy Halee.\nNew York Tendaberry is also considered to be the second in a trilogy of classic original Nyro records, with Eli and Christmas and the Beads of Sweat on either side. They are all considered musically and thematically similar, although New York Tendaberry is by far the most intense and stark.\n\n\nReview:\nWith 6,400 volumes in my music collection, there are many artists I love. Laura Nyro is my VERY favorite. And of her work, &quot;New York Tendaberry&quot; is my all-time favorite, #1 out of 6400. I think back to 1969, 17 years old, living in Japan, depressed beyond depression, I picked this LP up because I'd heard about Nyro as a writer ... and hated it, what a waste. A week later I figured, &quot;You're already depressed; you spent the money on this LP, might as well put on the headphones and give it one more listen.&quot; REVELATION! I think you have to be in a certain head space to click with NYT; and once you do, it never leaves you.\n\nSo how does one review the music that kept them on the planet? &quot;I don't want to say goodbye, baby goodbye.&quot; Holding on and letting go at the same time. &quot;You Don't Love Me When I Cry&quot; is one of the most incredible songs ever recorded. It's softness and fierceness mixed, blended seemlessly. &quot;I am soft and silly &amp; my name is Lillianaloo&quot; &quot;Captain for Dark Mornings&quot; sings lightheartedly juxtaposed with &quot;My daddy's a ravin crazy gambler.&quot; Nyro uses her piano like a weapon, emotionally disarming and light one minute then pounding and raw the next as on &quot;Tom Cat Goodbye,&quot; &quot;Tom Cat, you ole rat, where you been to?&quot; &quot;Mercy on Broadway&quot; starts with a piano line Gershwin would've been proud of and then shifts time signitures abruptly that would've put a smile on John Coltrane's face, &quot;In the doom swept the band away.&quot; &quot;Come on down to the glory river...gonna lay that devil down,&quot; Nyro rages on the stirring &quot;Save the Country.&quot; The dissonant piano on &quot;Gibson Street&quot; made this the least accessible track on NYT for me; but the arrangement with its chimes and horn flourishes make it one I marvel at for its shear instrumental diversity, &quot;Oh my sorrow, oh my mourning.&quot; &quot;Time &amp; Love&quot; is pure pop heaven. Phoebe Snow did a terrific version on the Time &amp; Love Tribute CD. &quot;The Man Who Sends Me Home&quot; is the essence of sadness, reflection and hope. &quot;I belong to the man&quot; Nyro sings on &quot;Sweet Lovin' Baby&quot; only to change the lyric years later to &quot;I belong to myself&quot; on her Season of Lights live CD, Japanese version. When she sings, &quot;Grace &amp; the preacher, blown fleets of sweet eyed dreams tonight,&quot; it is with such a wild abandon that it is totally touching. &quot;Captain Saint Lucifer&quot; is Nyro's &quot;Devil or Angel,&quot; the sometimes conflicting combination of physical and emotional love. &quot;The Urantia Book&quot; talks about how beauty relies on the variety of contrasts which Nyro does exquisitely on that track. &quot;New York Tendaberry&quot; is the sweet coda that concluded the original release, &quot;Firecrackers break and they cross and they dust and they skate and the night comes...&quot; For me, this is the most exquiste set ever recorded, my desert island CD.\n\nThe 2002 rerelease cleans up the sound a bit, although there's still more hiss on the softer parts than I expected. The single version of &quot;Save the Country&quot; reads well, although the longer album version is my favorite. &quot;In the Country Way&quot; seems out of place on this most urban of CD's, but is a welcome as a previously unreleased track, &quot;My old man is Peter Pan.&quot; &quot;New York Tendaberry&quot; is quintessential artistry, emotionally powerful, unable to be forgotten as is this incredible singer, Laura Nyro.\nReview By Lee Armstrong\n\n\nTrack List:\n1. You Don't Love Me When I Cry 4:19\n2. Captain For Dark Mornings 4:32\n3. Tom Cat Goodby 5:26\n4. Mercy On Broadway 2:12\n5. Save The Country 4:32\n6. Gibsom Street 4:41\n7. Time And Love 4:19\n8. The Man Who Sends Me Home 2:47\n9. Sweet Lovin' Baby 3:50\n10. Captain Saint Lucifer 3:12\n11. New York Tendaberry 5:33\n12. Save The Country (Single Version) 2:25\n13. In The Country Way 2:10\n\n\nSummary:\nCountry: USA\nGenre: Pop\nStyles: jazz, gospel, rhythm and blues, show tunes, rock, and soul.\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec\nBit rate mode : Variable\nBit rate : ~700-900 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits\n\n\n\n\n\n","torrent":{"xt":"urn:btih:2cd8ff6defb8407fd6869a0f62f60b3c3d5c51d0","amp;dn":"%281969%29+Laura+Nyro+-+New+York+Tendaberry+%28Remastered+%2B+Bonus%29+%5BFL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd8ff6defb8407fd6869a0f62f60b3c3d5c51d0","infoHashBuffer":{"type":"Buffer","data":[44,216,255,109,239,184,64,127,214,134,154,15,98,246,11,60,61,92,81,208]},"announce":[],"urlList":[]}}