{"title":"Lucky You; Carl Hiaasen","uid":7591628,"size":909694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2db024fd20b8a015cb4e3c2fc942cb563dc9e0d8&amp;dn=Lucky+You%3B+Carl+Hiaasen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lynnrlou","files":1,"time":1346560053,"description":"Downloaded from another source on the internet..keeping it alive!\n\nGrange, Florida, is, famous for its miracles-the weeping fiberglass Madonna, the Road-Stain Jesus, the stigmata man. And now it has JoLayne Lucks, unlikely winner of the state lottery. Unfortunately, JoLayne's winning ticket isn't the only one. The other belongs to Bodean Gazzer and his raunchy sidekick, Chub, who want the whole $28 million jackpot to start their own underground militia.But JoLayne Lucks has her own plans for the Lotto money, and when Bode and Chub brutally assault her and steal her ticket, she vows to track them down, take it back-and get revenge. The only one who can help is Tom Krome, a big-city investigative journalist now writing frothy features for a mid-sized newspaper. He is about to become part of a story that's bigger and more bizarre than anything he's ever covered. Chasing two heavily armed psychopaths is reckless enough, but Tom's got other problems-including his fugitive wife and his own growing fondness for the future millionairess with whom he's risking his neck.The pursuit takes them to a buzzard-infested island deep in Florida Bay, where they finally catch up with the fledgling militia-and their baffled hostage, a Hooters waitress. The climax explodes with the hilarious mayhem that is Carl Hiaasen's hallmark. Lucky You is his funniest, most deliriously gripping novel yet.\n\nKeep Seeding!!!","torrent":{"xt":"urn:btih:2db024fd20b8a015cb4e3c2fc942cb563dc9e0d8","amp;dn":"Lucky+You%3B+Carl+Hiaasen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db024fd20b8a015cb4e3c2fc942cb563dc9e0d8","infoHashBuffer":{"type":"Buffer","data":[45,176,36,253,32,184,160,21,203,78,60,47,201,66,203,86,61,201,224,216]},"announce":[],"urlList":[]}}