{"title":"Chris Andrews - 25 Classics Hits From The Sixties (1965-72) [Yes","uid":4819663,"size":102684310,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e02cb5ed7de730e94220bad9784b69afeb46cea&amp;dn=Chris+Andrews+-+25+Classics+Hits+From+The+Sixties+%281965-72%29+%5BYes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Iron_Horse","files":30,"time":1238718283,"description":"Chris Andrews - 25 Classics Hits From The Sixties (1965-72) [Yesterday Man]\nCD (1993) To Mp3 192 mbit/s\nIncluded: CD Covers and this Info\n\nChris Andrews (born Christopher Frederick Andrews, 15 October 1942, Romford, East London, United Kingdom) is a singer-songwriter, whose musical career started in the 1960s.\n\nCareer\nAndrews, by his mid teens, had formed his own group, and was playing at Soho venues which included The 2i's Coffee Bar (pronounced two eyes) and Flamingo Nightclub.On 14 March 1959, he made his UK television debut, performing on the &quot;Oh, Boy!&quot; show. He would later return in April to perform a cover of Cliff Richard's, &quot;Move It&quot;.\n\nAndrews wrote &quot;The First Time&quot; for Adam Faith (number 5, 1963), and then a string of hits for Sandie Shaw. They included &quot;Girl Don't Come&quot; (number 3, 1964/65), &quot;I'll Stop at Nothing&quot; (number 4, 1965), &quot;Message Understood&quot; (number 6, 1965) and &quot;Long Live Love&quot; (number one, 1965). It remained a chart topper in the UK Singles Chart for three weeks.\n\n&quot;Girl Don't Come&quot; was covered by Cher on her debut album, All I Really Want to Do.\n\nAlso in 1965, Andrews as a solo artist, got to number 3 in the same listings with &quot;Yesterday Man&quot;; followed up with a number 13 hit &quot;To Whom It Concerns&quot;. The instrumental section of this song was used on RTE's long-running TV programme, The Late, Late Show. As well as obtaining a high placing in the UK chart with &quot;Yesterday Man&quot;, it also climbed to number one in Ireland and Germany. Later releases were not as successful, but his own hits are seen as early examples of reggae influenced white pop music. Although his chart appearances dwindled in the UK by 1966, his chart topping success continued in mainland Europe for a number of years, particularly in Germany, and Andrews often recorded in foreign languages. The best representation of his 1960s English language recordings is on Repertoire's 20 Greatest Hits CD.\n\nToday Andrews is still active in his career as a singer/songwriter, working primarily in mainland Europe as well as the United Kingdom. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Chris_Andrews_(singer)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Chris_Andrews_(singer)&lt;/a&gt;\n\nBiography\tby Richie Unterberger on allmusic.com\nThough he is virtually unknown in the United States, Chris Andrews had a fair amount of success in the UK in the mid-1960s as both a performer and a songwriter for other acts. He might be best known as the author of three British Top Ten hits for Sandie Shaw in 1965, &quot;Girl Don't Come,&quot; &quot;Long Live Love,&quot; and &quot;Message Understood&quot;; he wrote quite a bit of Shaw's other mid-'60s recordings as well. He also wrote Adam Faith's 1963 Top Ten hit &quot;The First Time,&quot; and penned some pretty good Merseybeatish singles for Faith's backup group, the Roulettes, in 1963 and 1964.\n\nThough he'd initially come to prominence in the industry as a songwriter, Andrews became a hit singer under his own name in late 1965 with &quot;Yesterday Man,&quot; which made #3 in Britain. That was followed at the end of the same year with the Top Twenty single &quot;To Whom It Concerns,&quot; and 1966 saw him score three additional, smaller Top Fifty entries with &quot;Something on My Mind,&quot; &quot;What'cha Gonna Do Now,&quot; and &quot;Stop That Girl.&quot;\n\nAs is the case with numerous other British mid-'60s pop acts that had significant overseas success without making a dent in the States -- like Chris Farlowe, Long John Baldry, Marmalade, and Dave Dee, Dozy, Beaky, Mick and Tich -- American British Invasion fans eager to hear hit material that never got exposure in the US might be disappointed by the music. His big hits, and quite a few of his non-hit tracks, were relentlessly happy-go-lucky, lightweight pop tunes with hints of soul and bubblegum, as well as arrangements that fell, as ludicrous as it might seem, between ska and oom-pah marching music. Like Sandie Shaw, he employed Ken Woodman as musical arranger, yet many of his singles were similar-sounding to the point of monotony, much more so than the songs he wrote for others. His high voice was pleasant and shaded with a bit of blue-eyed soul, yet had little opportunity to explore much expressive range given the limited scope of his material. And that material couldn't be blamed on someone else, as it was written by Andrews himself.\n\nAlthough Andrews didn't have a British hit after 1966, he was extremely popular in Continental Europe in the 1960s, particularly in Germany, and recorded often in foreign languages. The best representation of his 1960s English-language recordings is on Repertoire's 20 Greatest Hits CD. \n\nTracklist:\n01. Yesterday Man\n02. To Whom it Concerns\n03. Pretty Belinda\n04. Carol OK\n05. Stop That Girl\n06. IÃ‚Â´ll Walk To You\n07. Do You Wanna Love Me\n08. Yo Yo\n09. Hello Honey Pie\n10. Something On My Mind\n11. Brown Eyes\n12. Sugar Daddy\n13. TheyÃ‚Â´ve All Got Their Yes On You\n14. Too Bad You DonÃ‚Â´t Want Me\n15. WhatÃ‚Â´cha Gonna Do Now\n16. ItÃ‚Â´s All Coming Back To Me\n17. I Love Ya\n18. Michigan River\n19. Lady Oh Lady\n20. Silver Lining\n21. Lazy Days\n22. Write it Down\n23. Girl DonÃ‚Â´t Come\n24. SomeoneÃ‚Â´s Taken Maria Away\t\n25. Long Live Love","torrent":{"xt":"urn:btih:2e02cb5ed7de730e94220bad9784b69afeb46cea","amp;dn":"Chris+Andrews+-+25+Classics+Hits+From+The+Sixties+%281965-72%29+%5BYes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e02cb5ed7de730e94220bad9784b69afeb46cea","infoHashBuffer":{"type":"Buffer","data":[46,2,203,94,215,222,115,14,148,34,11,173,151,132,182,154,254,180,108,234]},"announce":[],"urlList":[]}}