{"title":"Platoon.1986.ITA-ENG.SubITA.DVD9-LiFE [Ultima Frontiera]","uid":4860876,"size":6839928832,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2e0629b752416de215a88b862b23068d0d077912&amp;dn=Platoon.1986.ITA-ENG.SubITA.DVD9-LiFE+%5BUltima+Frontiera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"qu3ll0","files":-1,"time":1240264720,"description":"Titolo originale: Platoon\nNazione: Usa\nAnno: 1986\nGenere: Drammatico / Guerra\nDurata: 120'\nRegia: Oliver Stone\n\nProduzione: Arnold Kopelson\nDistribuzione: CDI\n\n\n\nTom Berenger, Willem Dafoe, Charlie Sheen, Forest Whitaker, Francesco Quinn, John C. McGinley, Richard Edson, Kevin Dillon, Johnny Depp, Oliver Stone\n\n\n[b]Chris, un giovane americano, parte volontario per la guerra del Vietnam non trovando giusto che tocchi sempre agli uomini economicamente svantaggiati e alle minoranze di colore rischiare la vita per la patria. Capitato in un plotone, pittoresco per varietÃƒÂ  di composizione, disumanizzato dall'esperienza brutale della guerra nella giungla, in breve tempo Chris viene spietatamente iniziato alle esigenze di quella vita violenta, non escluso l'uso della droga per difendersi dalla nostalgia. Durante una ricognizione nella giungla, il disumano sergente Barnes, che comanda il plotone, scopre un villaggio abitato e ne decide il massacro e la distruzione. La strage ÃƒÂ¨ violentemente esecrata dal sergente Elias, che aggredisce Barnes e gli assicura un rapporto ai superiori sulle atrocitÃƒÂ  da lui commesse. Sconvolto dagli orrori del massacro cui ha assistito, Chris si trova in marcia col plotone per un'azione contro un bunker dei vietcong, sotto una pioggia torrenziale. Per l'errore di un tenente americano che dÃƒÂ  coordinate sbagliate, il plotone viene semidistrutto. Mentre Chris porta in salvo i feriti, Barnes incontra Elias isolato nella giungla e lo colpisce per vendetta. Dall'alto dell'elicottero di soccorso, Chris e i sopravvissuti scorgono inorriditi Elias ferito, in fuga davanti ai vietcong, che lo uccidono successivamente. Nell'ultima azione di guerra della sua ferma di volontario, scampato a un micidiale agguato dei vietcong che hanno completamente annientato il plotone, Chris, imbattendosi nello spietato Barnes, che ferito tenta di mettersi in salvo, lo uccide con lucida determinazione.[/b]\n\n\nSource: DVD9\nRegion: PAL\nImage: .iso\nSize: 1 x 6,37 GB\nMenu: Untouched\nVideo: Untouched\nExtra: All Included\nAspect Ratio: 1.85:1\nAudio: DD 5.1 / DTS\nLanguage: English / Italian\nSubtitle: Italian\n","torrent":{"xt":"urn:btih:2e0629b752416de215a88b862b23068d0d077912","amp;dn":"Platoon.1986.ITA-ENG.SubITA.DVD9-LiFE+%5BUltima+Frontiera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e0629b752416de215a88b862b23068d0d077912","infoHashBuffer":{"type":"Buffer","data":[46,6,41,183,82,65,109,226,21,168,139,134,43,35,6,141,13,7,121,18]},"announce":[],"urlList":[]}}