{"title":"Might And Magic Heroes VI [English][BETA][PC][sneak_shot]","uid":6501581,"size":4275826429,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2e1c8d78e143efb9a8fd2e19c83d8fb541ff4fee&amp;dn=Might+And+Magic+Heroes+VI+%5BEnglish%5D%5BBETA%5D%5BPC%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sneak_shot","files":46,"time":1309222382,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:27-06-2011\n\n\n\ndescription:\n\nMight &amp; Magic Heroes VI is an upcoming turn-based strategy video game for Microsoft Windows, the sixth installment of the Heroes of Might and Magic series. Currently scheduled for release on September 8, 2011[2] it is being developed by Black Hole Entertainment and published by Ubisoft. It was announced on 17 August 2010 and was featured at Gamescom\n\nGameplay\n\nProducer Erwan Le Breton has stated that while the gameplay of Heroes VI will remain largely faithful to the Heroes series and retain most of its fundamental elements, it will involve a mix of familiarity and new innovation, including boss fights, a town conversion functionality and a reputation system. Four rare resources obtainable in all previous instalments will be replaced by blue crystals which came from dragon blood. Roughly 50% of units present in the game will be new introductions to the series, including the Radiant Glories of Haven, the Fate Spinners of Necropolis and the Breeders of Inferno.[1][4][5] Multiplayer will be present.\n\n\n\nPlot\n\nHeroes VI is a prequel to the main campaigns of Heroes of Might and Magic V, taking place four centuries earlier in the world of Ashan. A legendary Archangel general, revived hundreds of years after perishing during the Elder Wars, plots to recover his powers and take control of Ashan while battling a supposed Demon invasion, but is impeded by the Griffin dynasty. The campaign protagonists of the five factions are members of the Griffin family, the children of Duke Slava.[4][5] A hero named Sveltana has been prominently featured in screenshots to date.[6] The campaigns can be played in any order, and are interconnected.\n\n\n\nseed comment n enjoy!!!...\n\n","torrent":{"xt":"urn:btih:2e1c8d78e143efb9a8fd2e19c83d8fb541ff4fee","amp;dn":"Might+And+Magic+Heroes+VI+%5BEnglish%5D%5BBETA%5D%5BPC%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e1c8d78e143efb9a8fd2e19c83d8fb541ff4fee","infoHashBuffer":{"type":"Buffer","data":[46,28,141,120,225,67,239,185,168,253,46,25,200,61,143,181,65,255,79,238]},"announce":[],"urlList":[]}}