{"title":"Shavasana Unproduceable Play PDF Book by Price Geoffrey 072313","uid":8732114,"size":716281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e2cce45a642b8f92b73c3edc0b1c30f2c185732&amp;dn=Shavasana+Unproduceable+Play+PDF+Book+by+Price+Geoffrey+072313&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pricegeoffrey","files":3,"time":1374623536,"description":"SHAVASANA: Unproduceable Play is a three-act play, really more a teleplay or a clearly delineated novel. Forget about all that. It's a story of Price Geoffrey and his wife, who relocate to Primrose Hill, a tony suburb of London, and the story follows events after the events chronicled in &quot;Errors in Space &amp; Time&quot;. It is not necessary t have read the other text. SHAVASANA explores art and celebrity culture.\n\nThis is a PDF book. You can easily download it into your iPad or other device. If you torrent, you can always say that you were torrenting this file, which is entirely my own production and which I hope you will torrent, if your ISP sends you a DCMA letter or if anyone asks if yoga re torrenting. You can say, &quot;Yes, I torrent original non-copyright Price Geoffrey work.&quot; I hope you do this because 1) you can help me seed this file, and 2) you might want to kill a few minutes and look at it. You might even read it. I bought a lot of books when I was a kid and I didn't read them all. Some I gave away un-read. I write for you, the torrenting community. I hope you enjoy what I write. ","torrent":{"xt":"urn:btih:2e2cce45a642b8f92b73c3edc0b1c30f2c185732","amp;dn":"Shavasana+Unproduceable+Play+PDF+Book+by+Price+Geoffrey+072313","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e2cce45a642b8f92b73c3edc0b1c30f2c185732","infoHashBuffer":{"type":"Buffer","data":[46,44,206,69,166,66,184,249,43,115,195,237,192,177,195,15,44,24,87,50]},"announce":[],"urlList":[]}}