{"title":"Art Decade (2014) [FLAC]","uid":9654735,"size":276361457,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2ecfb1fe6b8f8522286e5d8fca8caafd121b7509&amp;dn=Art+Decade+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1393165371,"description":"\n  Art Decade (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44.1 KHz\n\n  01 No One's Waiting \n  02 Walking Together \n  03 Harbor Light\n  04 Idle Tallk \n  05 So I Thought \n  06 Numberless Dreams \n  07 Need You Yesterday\n  08 Boredom \n  09 Greylock Hill \n  10 All That's Left\n\n  Following up 2012's hammering, orchestral-adorned debut Western Sunrise, Boston's Art Decade return with their equally grand self-titled second album. Some bands dream big and for bandleader Ben Talmi, this comes in the form of complex indie guitar pop riding a tsunami of lush orchestration with medium-to-maximum levels of pomp. Knowing their M.O. from the start makes it easier to get on board with songs like the anthemic opener &quot;No One's Waiting&quot; and the massive &quot;Harbor Light,&quot; both of which are relentlessly dense, but well-made, melodic rock songs. It's a grandeur you might expect from a band named after a Bowie-Eno song, but fortunately, full-on is not their only speed. The lovely pop-prog &quot;So I Thought&quot; mixes classic '60s sunshine pop elements with dense E.L.O./Beatlesque sections and the shuffling &quot;Boredom&quot; explores an almost Pet Sounds style with its languid, harmonic shifts. It's clear that Talmi and his bandmates are scholars of classic pop and if they sometimes overshoot, their ambition is still commendable. Refreshingly, Art Decade eschew the self-conscious, folky trappings that doom so many other well-meaning indie acts who've cobbled together an old cello, trombone, and glockenspiel and call it &quot;chamber pop.&quot; Their sound is truly symphonic rock sounding more like some millennial hybrid of Muse and the Moody Blues. It's an intellectual record that is well-played, well-produced, and like so many classic prog-minded albums of yesteryear, sequenced together for a full sit-down listen. Some future subtlety might not be a bad idea, but their career is still young and this artistic quartet shows a lot of promise.","torrent":{"xt":"urn:btih:2ecfb1fe6b8f8522286e5d8fca8caafd121b7509","amp;dn":"Art+Decade+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ecfb1fe6b8f8522286e5d8fca8caafd121b7509","infoHashBuffer":{"type":"Buffer","data":[46,207,177,254,107,143,133,34,40,110,93,143,202,140,170,253,18,27,117,9]},"announce":[],"urlList":[]}}