{"title":"KISS - Alive! (resequenced &amp; expanded by }{eywood)","uid":9274060,"size":632512755,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2ecf44b065cc577467e2643547bd61236b9dd4f9&amp;dn=KISS+-+Alive%21+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":22,"time":1385827593,"description":"KISS Alive!  One of the five greatest live albums ever made.  But now its even better.\n\nLet's put aside any arguments about whether it was really live or not.  From the five songs available on King Biscuit it shows that not a lot was altered.  The vocals were fixed.  Some bad notes were repaired.  But it seems pretty close to the unaltered tape to me.  The biggest difference is that they beefed up the audience to sound bigger.  Well it works for me.\n\nSo what is different here?  Well for the most part it is the same album.  I did add a few things, however.  There is additional dialogue preceding both Hotter Than Hell and Rock And Roll All Nite.  Let Me Know has now been added as the first song of the encore.  I also moved Black Diamond to the end of the main set.  It seems to me that they must have put it at the end of side 3 to make the album sides similar in length, because although they do say goodnight at the end of it, Rock Bottom and Cold Gin are not really encore material, and are quite anticlimactic after Black Diamond.  Black Diamond was always the closer of the main set.  So now that's where it is, at the end of the set.  I moved Paul's &quot;Goodnight!&quot; from the end of Cold Gin to the end of the show, and I smoothed out the transitions between the album sides where you could hear the fades in the audience noise. And I swapped the channels so that Ace is on the right where he should be.  I threw in the Rock And Roll All Nite single from the end of the Alive II disc in the box, because it really belongs here.\n\nThe source disc for the main album was the &quot;Alive 1975-2000&quot; box set, but I softened the brickwall limiting with a nice plugin called Relife.\n\nI did this after several requests were made in my other Demonoid threads.  I hope everyone likes it.\n\n01 Deuce\n02 Strutter\n03 Got To Choose\n04 Hotter than Hell\n05 Firehouse\n06 Nothin' To Lose\n07 C'mon And Love Me\n08 Parasite\n09 She\n10 Watchin' You\n11 100,000 Years\n12 Rock Bottom\n13 Cold Gin\n14 Black Diamond\n15 Let Me Know\n16 Rock And Roll All Nite\n17 Let Me Go Rock 'n' Roll\n18 Rock And Roll All Nite (single version)\n\n--}{eywood 3-16-11","torrent":{"xt":"urn:btih:2ecf44b065cc577467e2643547bd61236b9dd4f9","amp;dn":"KISS+-+Alive%21+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ecf44b065cc577467e2643547bd61236b9dd4f9","infoHashBuffer":{"type":"Buffer","data":[46,207,68,176,101,204,87,116,103,226,100,53,71,189,97,35,107,157,212,249]},"announce":[],"urlList":[]}}