{"title":"I Am Soldier of Fortune: Dancing with Devils","uid":8964306,"size":6449640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2efa74203943da9432de5f73837c1276bec49218&amp;dn=I+Am+Soldier+of+Fortune%3A+Dancing+with+Devils&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1380179728,"description":"I Am Soldier of Fortune: Dancing with Devils\nby Robert K. Brown, Vann Spencer\n\nDESCRIPTION:\n\nRobert K. Brown, former Green Beret, after a bizarre military career that succeeded in getting him kicked out of Special Forces not once but twice, and completing the Command and General Staff College without a security clearance, while meantime being wounded in Nam, finally found his true calling as a publisher. Thirty-eight years ago he launched an upstart magazine from his basement called Soldier of Fortune, which pushed the bounds of journalism to its limits with his untamed brand of reporting - a camera in one hand, a gun in the other, and soon thereafter he discovered that he'd established a worldwide community. His wildly popular, notorious magazine became an icon for action-seekers in the U.S. and around the world. In this long-awaited book, Brown tells his own story, taking the readers into combat zones where he and his daring combat journalists, or fearless &quot;dogs of war,&quot; trotted across the globe. His rogue warrior journalists embedded themselves with anti-Communist guerillas or freedom fighters, often training and fighting with rebels against oppressive regimes. In their revolutionary journalistic style, they created the action and then wrote about it. Brown himself accompanied teams to work and fight with the Rhodesians; the Afghans during the Afghan-Russo war, Christian Phalange in Lebanon; ethnic minority Karens in Burma; the ethnic tribes fighting the Communist government of Laos; the army of El Salvador; and the armed forces of struggling Croatia. Brown sent medical teams, often into the jaws of danger, to Burma, Guatemala, the Dominican Republic, Afghanistan, Bosnia, El Salvador and Nicaragua, and also into Peru after a devastating earthquake. In short, the &quot;Soldiers of Fortune&quot; went where even the U.S. government feared to tread, and they did it with gallant style, not fearing risk but welcoming the challenge, as long as they felt the cause was right and needed to be reported. In this book the exploits of Brown and his veteran teams are revealed for the first time in all their gonzo glory, even as the U.S. military, public, and polite diplomatic society sometimes shunned their endeavors. This is the story of Robert Brown's dogged quest, in journalism as well as warfare, to &quot;Slay Dragons, do noble deeds and never, never give up.&quot;\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Am-Soldier-Fortune-Dancing-Devils/dp/1612001939&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Am-Soldier-Fortune-Dancing-Devils/dp/1612001939&lt;/a&gt;","torrent":{"xt":"urn:btih:2efa74203943da9432de5f73837c1276bec49218","amp;dn":"I+Am+Soldier+of+Fortune%3A+Dancing+with+Devils","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2efa74203943da9432de5f73837c1276bec49218","infoHashBuffer":{"type":"Buffer","data":[46,250,116,32,57,67,218,148,50,222,95,115,131,124,18,118,190,196,146,24]},"announce":[],"urlList":[]}}