{"title":"J.K.Rowling - Harry Potter - En de vuurbeker (deel 4) (NL- E-Boo","uid":5360846,"size":337926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fdff4b9073d0f3f95a7691f9b33603efea2a63d&amp;dn=J.K.Rowling+-+Harry+Potter+-+En+de+vuurbeker+%28deel+4%29+%28NL-+E-Boo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soap22","files":6,"time":1266092144,"description":"J.K.Rowling - Harry Potter - En de vuurbeker\n\nBeschrijving\nZoals ieder jaar brengt Harry Potter de zomervakantie door bij zijn vreselijke oom en tante, waar de sfeer dit jaar extra gespannen is doordat hun verwende zoontje Dirk op dieet is. Harry kan dan ook niet wachten tot hij terug mag naar Zweinsteins Hogeschool voor Hekserij en Hocus-Pocus, om aan zijn vierde schooljaar te beginnen. Maar voor het zover is, wordt hij door de familie Wemel op spectaculaire wijze bij de Duffelingen opgehaald, om mee te gaan naar de finale van het WK Zwerkbal!\n\nHarry weet dan nog niet dat er dat jaar op Zweinstein een nog groter en spannender evenement zal plaatsvinden, waarbij ook leerlingen van buitenlandse toverscholen vertegenwoordigd zullen zijn. Ondanks alle opwinding en magische gebeurtenissen, probeert hij zich toch op zijn lessen te concentreren.\nOndertussen zijn er allerlei tekenen die er op wijzen dat Voldemort, met behulp van Duistere tovenaars, weer aan kracht begint te winnen. De angst dat Hij Die Niet Genoemd Mag Worden opnieuw zal toeslaan, wordt steeds groter...\n\nJoanne Rowling (1965) is opgegroeid in Chepstow, Engeland. Zowel Rowlings debuut Harry Potter en de Steen der Wijzen als de vervolgdelen Harry en de Geheime Kamer en Harry Potter en de Gevangene van Azkaban werden over de hele wereld overstelpt met bekroningen en prijzen. De Harry Potter-boeken verschenen in meer dan dertig talen en er zijn tot nu toe tientallen miljoenen van verkocht.\n\n'De Harry Potter-boeken zijn zo'n daverend succes omdat ze alle populaire ingrediÃƒÂ«nten van kinderliteratuur als in een toverdrank in zich verenigen.' - Vrij Nederland\n\n'De boeken van Joanne Rowling lezen als een trein.' - Trouw\n\n'Dit deel heeft nog meer vaart, meer verbazingwekkende wendingen, meer heftige, angstaanjagende gebeurtenissen en meer markante personages.' - Het Parool\n\n'Rowling is een begenadigd verteller.' - de Volkskrant\n\n'Het is te hopen dat hij blijft zitten.' - Elsevier","torrent":{"xt":"urn:btih:2fdff4b9073d0f3f95a7691f9b33603efea2a63d","amp;dn":"J.K.Rowling+-+Harry+Potter+-+En+de+vuurbeker+%28deel+4%29+%28NL-+E-Boo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fdff4b9073d0f3f95a7691f9b33603efea2a63d","infoHashBuffer":{"type":"Buffer","data":[47,223,244,185,7,61,15,63,149,167,105,31,155,51,96,62,254,162,166,61]},"announce":[],"urlList":[]}}