{"title":"Why Calories Count: From Science to Politics ","uid":7832530,"size":2937198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:302189841cbbef38d6e5327978bf054c1823fdff&amp;dn=Why+Calories+Count%3A+From+Science+to+Politics+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353088747,"description":"Why Calories Count: From Science to Politics (California Studies in Food and Culture) by Marion Nestle, Malden Nesheim\nUniversity of California Press | 2012 | ISBN: 0520262883 | English | 304 pages | EPUB + MOBI | 2.80 MB + 4.10 MB\n\nCalories--too few or too many--are the source of health problems affecting billions of people in today's globalized world. Although calories are essential to human health and survival, they cannot be seen, smelled, or tasted. They are also hard to understand. In Why Calories Count, Marion Nestle and Malden Nesheim explain in clear and accessible language what calories are and how they work, both biologically and politically. As they take readers through the issues that are fundamental to our understanding of diet and food, weight gain, loss, and obesity, Nestle and Nesheim sort through a great deal of the misinformation put forth by food manufacturers and diet program promoters. They elucidate the political stakes and show how federal and corporate policies have come together to create an &quot;eat more&quot; environment. Finally, having armed readers with the necessary information to interpret food labels, evaluate diet claims, and understand evidence as presented in popular media, the authors offer some candid advice: Get organized. Eat less. Eat better. Move more. Get political.\n","torrent":{"xt":"urn:btih:302189841cbbef38d6e5327978bf054c1823fdff","amp;dn":"Why+Calories+Count%3A+From+Science+to+Politics+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302189841cbbef38d6e5327978bf054c1823fdff","infoHashBuffer":{"type":"Buffer","data":[48,33,137,132,28,187,239,56,214,229,50,121,120,191,5,76,24,35,253,255]},"announce":[],"urlList":[]}}