{"title":"Mission to Mars (gnv64)","uid":9440205,"size":23541059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:303a7b629f57c607f667218d9ee4fb0f45dc966a&amp;dn=Mission+to+Mars+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1388997814,"description":"Destination Mars/Mission to Mars\nEnglish | PDF | 22 pages | 22.4 mb\n\nON NOVEMBER 5, THE WORKHORSE LAUNCHER OF THE INDIAN Space Research Organisation (ISRO), the Polar Satellite Launch Vehicle (PSLV), launched the spacecraft for the organisation's maiden mission to Mars in its uprated and extended configuration PSLV-XL. Just as the orbiter mission around the moon, Chandrayaan-1, which was also launched by the first version of PSLV-XL in 2008, this too will be a mission aimed at only an on-orbit study of the red planet. But unlike the circular orbit of Chandrayaan-1 at an altitude of 100-200 kilometres, the Mars orbiter will locate itself in a highly elliptical 377 km x 80,000 km orbit around the planet.\nAlthough the mission to Mars had been mentioned off and on by ISRO officials since 2007 and studies within ISRO for such a possible mission seem to have begun around that time, it had never been projected as a definitive planetary mission in the short term. &quot;It is expected to take at least four years to complete the initial studies,&quot; G. Madhavan Nair, the then ISRO Chairman, had been quoted in 2007 by a newspaper. But we now have a full-fledged mission to Mars within just a year after the initial study Dhase.\nThe Indian Space Research Organisation got its Mars orbiter with five scientific payloads ready in record time for launch on November 5 for its truly first deep-space mission.\nThe official announcement for this mission was made on August 15, 2012, by Prime Minister Manmohan Singh in his Independence Day speech. In fact, according to K. Radhakrishnan, the present ISRO Chairman, the financial sanction for the project came only in July 2012. Thus, despite the technological complexity of any mission to Mars, ISRO has got the Mars Orbiter Mission (MOM), as it has been named notwithstanding the name Mangalyaan gaining currency in the popular media, launch-ready in perhaps record time among all the ISRO missions so far.\n\nI have scanned the cover story published in the fortnightly Indian current affairs magazine FRONTLINE after the successful launch of the Mangalyaan.","torrent":{"xt":"urn:btih:303a7b629f57c607f667218d9ee4fb0f45dc966a","amp;dn":"Mission+to+Mars+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"303a7b629f57c607f667218d9ee4fb0f45dc966a","infoHashBuffer":{"type":"Buffer","data":[48,58,123,98,159,87,198,7,246,103,33,141,158,228,251,15,69,220,150,106]},"announce":[],"urlList":[]}}