{"title":"All 8 Sookie Stackhouse Southern Vampire Mystery audiobooks","uid":4586443,"size":4652084193,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:30c78af35325902e8c76bddee676d017445bcde0&amp;dn=All+8+Sookie+Stackhouse+Southern+Vampire+Mystery+audiobooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"flaos","files":592,"time":1229640750,"description":"i realise this torrent has a couple bad files. The Dead Until Dark book is the only one with issues. I've re-downloaded it from the original torrent, and I'm going through every file as we speak. I will create a new torrent and post a link to it here. I will also continue to seed this one. It's a pain in the ass 'cause the original dead until dark torrent is all out of order and i have to go through all the files and rename them to match reality. should be done in the next couple o' days.\n\nAll 8 Sookie Stackhouse Southern Vampire mystery audiobooks. Last attempt had random error. Here's hoping this time it works\n\nAll eight audio books of the Southern Vampire Mystery series:\n\nDead Until Dark (2001)\nLiving Dead in Dallas (March 2002)\nClub Dead (May 2003)\nDead to the World (May 2004)\nDead as a Doornail (May 2005)\nDefinitely Dead (May 2006)\nAll Together Dead (May 2007)\nFrom Dead to Worse (May 2008)\n\nThe Southern Vampire Mysteries is a series of books written by New York Times bestselling author Charlaine Harris that were first published in 2001. The ninth book, &quot;Dead and Gone&quot; is set to be released in May 2009.\n\nThe series is a first-person account by Sookie Stackhouse of her life as a barmaid and telepath in the fictional town of Bon Temps, Louisiana. The first book in the series, Dead Until Dark, won the Anthony Award for Best Paperback Mystery in 2001.\n\nThanks to a Japanese scientist's invention of synthetic blood, vampires have progressed from legendary monsters to fellow citizens overnight. And while humans have supposedly been removed from the menu, many remain apprehensive about these creatures &quot;coming out of the coffin.&quot; Religious leaders and government officials around the world have chosen their sides, but in the small Louisiana town of Bon Temps, the jury is still out.\n\nThe HBO series True Blood is based on the The Southern Vampire Mysteries. In it, Sookie is portrayed by Academy Award-winning actress Anna Paquin.","torrent":{"xt":"urn:btih:30c78af35325902e8c76bddee676d017445bcde0","amp;dn":"All+8+Sookie+Stackhouse+Southern+Vampire+Mystery+audiobooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c78af35325902e8c76bddee676d017445bcde0","infoHashBuffer":{"type":"Buffer","data":[48,199,138,243,83,37,144,46,140,118,189,222,230,118,208,23,68,91,205,224]},"announce":[],"urlList":[]}}