{"title":"Lost.Planet.2-SKIDROW","uid":5877966,"size":13330259846,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31b7af353e5389b642227611ffdc3565308e3344&amp;dn=Lost.Planet.2-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Riskaka","files":3,"time":1286723962,"description":"Lost Planet 2 picks up 10 years since the events of the original adventure and the landscape has evolved dramatically.\n\nWith the success of terraforming activities, the planet's ice has begun to melt, giving way to lush tropical jungles and other new environments. The story has advanced beyond Wayne Holden as players will now follow the exploits of their own customized snow pirates on their quest to seize control of E.D.N III. Players will move their heroes through different stories creating a truly unique and interactive experience. With this concept, gamers will have the opportunity to engage in the story in a more dynamic way as plot threads evolve from various perspectives.\n\nThe strongest features from the first game will return in Lost Planet 2 making fans feel right at home. In addition to the anchor actions that made the gameplay in Lost Planet a true 3-D experience, Lost Planet 2 allows gamers to gain tactical advantage with a wide variety of new actions. The game will also contain a new addition to the enormous Akrids which were a fan-favourite in the first Lost Planet.\n\nCapcom has spent a considerable amount of time reviewing community feedback and incorporating it into Lost Planet 2 creating a game that both new and returning fans to the series will love. The game takes advantage of Capcom's most highly advanced software development tool, the MT Framework 2. This is the first game to make use of the new technology that builds on the advancements made in the original MT Framework.\n\nBeyond the deep single player mode, Lost Planet 2 is loaded with one the most extensive multiplayer campaign seen in a shooter to date. The intense and action packed campaign mode comes with the ability to form teams of up to 4 players online to clear mission objectives with friends.","torrent":{"xt":"urn:btih:31b7af353e5389b642227611ffdc3565308e3344","amp;dn":"Lost.Planet.2-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31b7af353e5389b642227611ffdc3565308e3344","infoHashBuffer":{"type":"Buffer","data":[49,183,175,53,62,83,137,182,66,34,118,17,255,220,53,101,48,142,51,68]},"announce":[],"urlList":[]}}