{"title":"Fruit Ninja HD Portable - [Espera]","uid":6772686,"size":79035869,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:322d0374c5b4cb183bffd9302ca1b933a0a21213&amp;dn=Fruit+Ninja+HD+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1319587278,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Fruit Ninja HD 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nFruit Ninja (known as Fruit Ninja HD on the iPad and Fruit Ninja THD for Nvidia Tegra 2-based Android devices) is a video game developed by Halfbrick Studios. It was released April 21, 2010 for iPod Touch and iPhone devices, July 12, 2010 for the iPad, September 17, 2010 for Android OS devices. It was released for Windows Phone 7 on December 22, 2010. Also, in March 2011, versions for Samsung's Bada and Nokia's Symbian began to be distributed on their respective official application channels. Just prior to E3 2011 Fruit Ninja Kinect was released for the Xbox 360 on August 10, 2011 and utilizes the Kinect peripheral. In the game the player must slice fruit that is thrown into the air by swiping the device's touch screen with their finger or in the case of the Xbox 360 version, the player's arms and hands. It features multiple gameplay modes, leaderboards and multiplayer.\n\nThe game was well received by critics and consumers alike; as of September 2010 sales have exceeded three million downloads, with the total reaching four million in December 2010. Total sales across all platforms totaled over 20 million in March 2011. Reviewers felt that the low cost of the game combined with addictive gameplay yielded an excellent value. They further lauded the support and updates provided by Halfbrick, who brought online multiplayer, achievements and leaderboards to the game. Some critics felt the game's difficulty curve was uneven.\nSystem Requirements\n\nWindows XP or 7\nAny dual-core processor\n1Gb RAM\n10 MB HDD\n128 bit video card","torrent":{"xt":"urn:btih:322d0374c5b4cb183bffd9302ca1b933a0a21213","amp;dn":"Fruit+Ninja+HD+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322d0374c5b4cb183bffd9302ca1b933a0a21213","infoHashBuffer":{"type":"Buffer","data":[50,45,3,116,197,180,203,24,59,255,217,48,44,161,185,51,160,162,18,19]},"announce":[],"urlList":[]}}