{"title":"Going Under by Justina Robson [Qauntum Gravity] (epub) ","uid":8848075,"size":351822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32be39cd0923085518168050e2bbfea87d3084b7&amp;dn=Going+Under+by+Justina+Robson+%5BQauntum+Gravity%5D+%28epub%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377453542,"description":"Book 3\n\nLila Black is off with the faeries . . .\n\nEver since the Quantum Bomb of 2015 things have been different; the dimensions have fused and suddenly our world is accessible to elves, demons, ghosts and elementals and their worlds are open to us. Things have been different for Special Agent Lila Black too: tortured and magic-scarred by elves, rebuilt by humans into a half-robot, part-AI, nuclear-fueled walking arsenal, and carrying the essence of a dead elfin necromancer in her chest, sometimes she has trouble figuring out who she is.\n\nAnd a mission to the world of the fae may not help her work it out.\n\nThe fae are beautiful, glamorous, exotic, and talented. Their inventions make food taste better, make beer divine, and bring sparkle and mischief to the world but that's only the surface. And Lila is being sent in at the deep end, to the deepest, darkest levels of Faerie: on the primal level, nothing about the fae is glamorous at all.\n\nIn a winter-locked, raw, and primitive world, Lila has to deal with the fae at their most basic levels, as tricksters and dealmakers and the only deals worth making are bloody ones. If Lila's quest is to succeed, and if she is ever to escape Faerie, the right question must be asked, the right sacrifice must be made, and the right quarry must be hunted down on the winter solstice. All of which is difficult, when the only aides Lila brought to Faerie are her friends . . .\n\nJustina Robson's new series combines her trademark themes of identity and reality, magic and technology, break-neck plots, a mischievous sense of fun, and a seriously sexy new heroine.","torrent":{"xt":"urn:btih:32be39cd0923085518168050e2bbfea87d3084b7","amp;dn":"Going+Under+by+Justina+Robson+%5BQauntum+Gravity%5D+%28epub%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32be39cd0923085518168050e2bbfea87d3084b7","infoHashBuffer":{"type":"Buffer","data":[50,190,57,205,9,35,8,85,24,22,128,80,226,187,254,168,125,48,132,183]},"announce":[],"urlList":[]}}