{"title":"A Texan Odyssey - Flight of the Conchords Documentary","uid":4156367,"size":397015706,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34743ebd424f24eab57dabfd76b71d035a677ac4&amp;dn=A+Texan+Odyssey+-+Flight+of+the+Conchords+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Frenchflyingcows","files":2,"time":1209167751,"description":"\n  `.----------``      -------.      ..-------------`     `-------.`        \n .:NMMdyssssss:.  `-/oNhssssmdo/-   /osssyNMMmhssso:  `-+sNhysssdhh-`      \n .:NMM+-         ./mNNo-    /sMNd:.     `.mMMy+      -+mNNo-`   .:s/-      \n .:NMM+-         ymMNd`      :mMMN/`    `.mMMy+      hmMNd`                \n .:NMMyo//////```dNMmy       -yNMM+.    `.mMMy+     `mNMdy                 \n .:NMMyo//////```dNMmy       -yNMM+.    `.mMMy+     `mNMdy                 \n .:NMM+-         ymMNd`      :mNMN/`    `.mMMy+      hmMNd`                \n .:NMM+-         ./mNNo-    /sMNd:.     `.mMMy+      -+NMNo-`   .:s/-      \n .:NMM+-          `-/oNhssssmdo/-       `.mMMy+       `:oyMdysssdhh-`      \n  `.--``              .------.            .--.`          `-------.`        \n                                                                           \n \nA Texan Odyssey.avi, Flight of the Conchords.\nBy TedM - Check out http://www.frenchflyingcows.com\n\nThis is the documentary for Flight of the Conchords.\n\nHere is a review found on a New-Zealand Website:\n\n___________________________________________________________________________________\nThe TV3 documentary Flight of the Conchords: A Texan Odyssey is a rare and exciting chance for New Zealand viewers to see our most successful comedy duo do their thing on the world stage.\n\n19 October, 9:30 PM, TV3\n\nIn March 2006, Bret McKenzie and Jemaine Clement aka Flight of the Conchords embarked on a revealing and hilarious odyssey into the political and musical heart of the United States of America. The result is a very amusing comedy documentary jam-packed with the Conchords? classic hit songs.\n\nWith a Gibson Group documentary crew in tow, they travelled from Wellington, New Zealand to Austin, Texas to launch their folk parody act upon one of the toughest music industry events in the world: the South By SouthWest music showcase.\n\nSuperstars Morrissey, Neil Young, Peaches, Lyle Lovett and Kinky Friedman appear alongside New Zealanders Coco Solid, The Brunettes and Flight of the Conchords themselves in this enlightening look at what it takes to break into the ruthless American music market.\n\nIn their first experience as documentarians, McKenzie and Clement meet famous folk and political candidates, real cowboys and regular musicians, as well as their own management and fans. Important questions are asked. Is it better to be called a band, or a duo? Can one good rock show change the world? Can a comedy act break through onto the ruthless music circuit? Has anybody in America heard of any bands from New Zealand? Is stage-diving a good idea? The answers can be shocking.\n\nIn its 20 years of existence, SXSW has become widely regarded as the most important showcase of contemporary music in the world. Held every March in the state capital of Texas, approximately 1500 bands line up to tout their wares to record labels, managers, tour promoters, festival bookers and venue owners.\n\nFlight of the Conchords had a greater head-start than most when they hit the ground in Austin this year: they already had a record contract (with Sub Pop ? the legendary US indie label that signed Nirvana); management (the guy behind Good Charlotte and My Morning Jacket); a legal team (who also represent the South Park lads), and a personal invitation from SXSW head honcho, Roland Swenson (who saw them on HBO and loved them). Yet this still wasn?t enough to guarantee them decent sound at their gigs, fancy accommodation close to town, or cool bodyguards like Morrissey has to protect them from their fans. Things could go wrong ? and they did.\n\nFlight of the Conchords: A Texan Odyssey features live performances of the Flight of the Conchords hits ?Business Time?, ?The Most Beautiful Girl in the Room?, ?Boom, She?s So Hot!?, ?Think About It, Think, Think About It? and Coco Solid?s hit single ?Denim &amp; Leather?.\n_________________________________________________________________________________\n\nSincerely,\n\nTedM/Frenchflyingcows","torrent":{"xt":"urn:btih:34743ebd424f24eab57dabfd76b71d035a677ac4","amp;dn":"A+Texan+Odyssey+-+Flight+of+the+Conchords+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34743ebd424f24eab57dabfd76b71d035a677ac4","infoHashBuffer":{"type":"Buffer","data":[52,116,62,189,66,79,36,234,181,125,171,253,118,183,29,3,90,103,122,196]},"announce":[],"urlList":[]}}