{"title":"Naissance Des Pieuvres (Dutch subs)","uid":6684368,"size":734169088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34d57af54de0a6ff6669cf8624a834ba14fad1e8&amp;dn=Naissance+Des+Pieuvres+%28Dutch+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rubberboy37","files":1,"time":1316304250,"description":"Nederlands ondertiteld\nAVI DivX\nDrama\n85 min.\nRelease 6 maart 2008\n\n\nDirector: Celine Sciamma, Writer: Celine Sciamma, Stars: Pauline Acquart, Louise Blachere and Adele Haenel\n\nEen film in the stijl van Fucking Amal. Marie, Anne en Floriane wonen in een nieuwe buitenwijk van Parijs. De vijftienjarige meiden hebben in de zomer niets te doen. In het zwembad kruisen hun paden en komen gevoelens van liefde en verlangen voor het eerst naar boven. Dit brengt hen dichter bij elkaar, maar drijft hen ook uit elkaar. De titel van deze film betekent \\\\\\'geboorte der inktvissen\\\\\\'. Dit verwijst naar de drie tienermeisjes die als synchroonzwemmers onder water druk trappelen om boven te blijven.\n\n\nFilm in the style of Fucking Amal. Three girls, each about 15, deal with puberty, the onset of sexual attraction, and, for two, the pressure of virginity. Marie, who\\\\\\'s slight and diffident, quiet and nearly expressionless, is friends with Anne, who\\\\\\'s a bit chunky and impulsive and has decided that FranÃƒÂ§ois will be her first love. Watching synchronized swimming, Marie is suddenly attracted to the team captain, Floriane, beautiful, aloof, tall, and rumored to be a slut. FranÃƒÂ§ois pursues her. Marie begins to hang around her; they trade favors, and soon it\\\\\\'s an odd sort of friendship. Each of the three experiences her own first, and Marie must sort out attraction and friendship.\n","torrent":{"xt":"urn:btih:34d57af54de0a6ff6669cf8624a834ba14fad1e8","amp;dn":"Naissance+Des+Pieuvres+%28Dutch+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d57af54de0a6ff6669cf8624a834ba14fad1e8","infoHashBuffer":{"type":"Buffer","data":[52,213,122,245,77,224,166,255,102,105,207,134,36,168,52,186,20,250,209,232]},"announce":[],"urlList":[]}}