{"title":"Earth Overclocked v1.0.2.1","uid":13288401,"size":137755315,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:34e1bc603d87c453038b4b8242e96145ac528edf&amp;dn=Earth+Overclocked+v1.0.2.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1453570348,"description":"\nAbout This Game\r\nEarth Overclocked is a twin-stick shooter with rogue-like elements, set in a very distorted, unstable version of our world where trees are evil, snowmen have protruding laser blasters, and monsters from popular myths dwell underground. A scientist is trapped here after his time machine explodes while traveling back in time, and he must reassemble his machine to escape before this crazy dimension collapses under its own instability. With only 20 minutes to explore Distorted Earth, defeat boss monsters, and reclaim the pieces to the time machine, the adrenaline rush is real!\r\n\r\nFortunately for the Scientist, a variety of powerful weapons can be found hidden in locked chests and sold from menacing black-robed merchants, ranging from simple weapons like shotguns and boomerangs to crazy arsenal such as paintball guns, leaf magnums, and even cheese!\r\n\r\nIn true rogue-like fashion, death is permanent and means starting over, but Distorted Earth is randomized between playthroughs to give a fresh experience with every new run, and there are over 35 permanent unlockables, including new weapons, game modes, and classes.\r\nFeatures\r\n\r\n    Enjoy the experience by yourself, or team up with up to 3 friends in Local Multiplayer!\r\n    Short, intense playthroughs which greatly differ from each other.\r\n    Very challenging, rewarding gameplay with a &quot;just one more go&quot; feel.\r\n    Non-linear exploration. Clear the main events in any order. (Or follow the game's suggested route.)\r\n    Procedurally generated overworld, dungeons, and monster pools.\r\n    6 different environments and dungeon themes.\r\n    4 main classes unlocked from the start, each with different starting weapons and passive abilities.\r\n    2 bonus unlockable classes.\r\n    40+ enemy types with unique behaviors and upgraded variants.\r\n    20+ difficult boss encounters. Fight a different group of bosses in every playthrough!\r\n    30+ gameplay-altering weapon types.\r\n    35+ unlockable content which change or add to the experience.\r\n    Stats of both enemies and weapons are procedurally generated.\r\n    An unlockable hard mode with more challenges and rewards.\r\n    Over 70 game over messages","torrent":{"xt":"urn:btih:34e1bc603d87c453038b4b8242e96145ac528edf","amp;dn":"Earth+Overclocked+v1.0.2.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e1bc603d87c453038b4b8242e96145ac528edf","infoHashBuffer":{"type":"Buffer","data":[52,225,188,96,61,135,196,83,3,139,75,130,66,233,97,69,172,82,142,223]},"announce":[],"urlList":[]}}