{"title":"George Jones - The Complete United Artists Solo Singles","uid":9431503,"size":194017356,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:351b5be453f7bb4a18820c4cde200e55c2d89dfb&amp;dn=George+Jones+-+The+Complete+United+Artists+Solo+Singles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1388815944,"description":"mp3 320\n\nUnlike Razor &amp; Tie's 1997 double-disc collection She Thinks I Still Care: The George Jones Collection (The United Artists Years), Omnivore's 2013 set The Complete United Artists Solo Singles focuses directly on the 45s George Jones released for United Artists between the years 1962 and 1966 (he was only with the label until 1964 but they churned out singles for another two years after his departure). This is a bigger difference than it may initially seem. The 40-track She Thinks I Still Care sampled generously from Jones' duets with Melba Montgomery, his tributes to Bob Wills and Hank Williams, his bluegrass and gospel LPs, which meant there were several singles absent from its track listing. Conversely, The Complete United Artists Solo Singles misses several of these stylistic detours (naturally, the title is a give-away that there are no duets to be found here), but it has its share of surprises -- i.e, the rocking holiday single &quot;My Mom and Santa Claus (Twistin' Santa Claus)&quot; -- and, better still, its 32 songs give a greater sense of how George Jones was heard at his '60s peak: as a series of singles saturating the airwaves or cranking away on a jukebox. George had some of his biggest hits during these five years -- &quot;The Race Is On,&quot; &quot;She Thinks I Still Care,&quot; &quot;You Comb Her Hair&quot; -- but his star didn't shine as brightly as it did in the '70s, when he was a fixture in the upper reaches of the charts. He was a popular country singer, regarded as one of the best and selling at a rate deserving of his reputation, and the singles reflect this status, as they're largely exceptional pieces of straight-ahead country designed to please broad audiences. His hardcore Texas honky tonk wound up getting slightly sweetened by the pros in Nashville, a transition that resulted in the first flowering of his gorgeous ballad style, a bit of MOR Nashville sound (&quot;Where Does a Little Tear Come From&quot;) but also gave a bit of a lively snap to the novelties (&quot;Geronimo,&quot; &quot;The Best Guitar Picker&quot;) and poppier tunes like &quot;What's Money&quot; or &quot;Your Heart Turned Left (And I Was on the Right).&quot; This gives the United Artists singles some color, but the foundation lies in the purer country, whether it's the haunted murder ballad &quot;Open Pit Mine&quot; or such barroom weepers as &quot;A Girl I Used to Know&quot; and &quot;Brown to Blue.&quot; Taken together, each of these singles -- including the B-sides, which are often quite strong -- create a portrait not only of George Jones in the '60s, but that decade's mainstream straight-ahead country, a blend of Nashville and Texas that remains enormously appealing. Needless to say, this is the best way to hear George Jones' United Artists recordings; it's tighter, better than either the Razor &amp; Tie comp or the enjoyable but very large Bear Family box. ","torrent":{"xt":"urn:btih:351b5be453f7bb4a18820c4cde200e55c2d89dfb","amp;dn":"George+Jones+-+The+Complete+United+Artists+Solo+Singles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"351b5be453f7bb4a18820c4cde200e55c2d89dfb","infoHashBuffer":{"type":"Buffer","data":[53,27,91,228,83,247,187,74,24,130,12,76,222,32,14,85,194,216,157,251]},"announce":[],"urlList":[]}}