{"title":"Bob Hope Collection - Thanks for the Memory (1938) - The Cat and","uid":9963212,"size":8017885184,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:38249a15b4c49caaef11650af98a28b384fc8569&amp;dn=Bob+Hope+Collection+-+Thanks+for+the+Memory+%281938%29+-+The+Cat+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"SaM","files":-1,"time":1397541543,"description":"Bob Hope Collection - Thanks for the Memory (1938) - The Cat and the Canary (1939) DVD9 [DDR]\n\nThanks for the Memory (1938)  - Bob Hope, Shirley Ross [DDR]\n\n&quot;Thanks for the Memory&quot; (1938) is a popular song, with music composed by Ralph Rainger and lyrics by Leo Robin. It was introduced in the 1938 film The Big Broadcast of 1938 by Shep Fields and His Orchestra with vocals by Bob Hope and Shirley Ross. Dorothy Lamour's solo recording of the song was also popular, and has led to many mistakenly believing over the years that it was she, and Hope, who sang the tune in the film (in which Lamour also appeared).\n\nIn the film, Ross and Hope's characters are a married couple who come to the brink of divorce. Near the film's end they poignantly sing one of the many versions of this song, recalling the ups and downs of their relationship. (Then they decide to stick together.)\n\nThe song won the Academy Award for Best Original Song, and became Hope's signature tune, with many different lyrics adapted to any situation.\n\nThe song is often regarded as a companion piece to &quot;Two Sleepy People&quot;, written in September 1938 by Hoagy Carmichael with lyrics by Frank Loesser, also performed by Bob Hope and Shirley Ross in the movie Thanks for the Memory which appeared in 1939, taking its title from the success of the song.\n\nCAST:-\nBob Hope... Steve Merrick\nShirley Ross ... Anne Merrick\nCharles Butterworth... Biney\nOtto Kruger... Gil Morrell\nHedda Hopper... Polly Griscom\nLaura Hope Crews.. Mrs. Kent\nEmma Dunn ... Mrs. Platt\nRoscoe Karns ... George Kent\n\nMusic by Ralph Rainger\nLyrics by Leo Robin\n\nCover versions\n    Mildred Bailey recorded the song on January 10, 1938 with a mixed group featuring Chu Berry doing a nice tenor sax solo.\n    Bing Crosby recorded the song for his 1956 album, Songs I Wish I Had Sung the First Time Around.\n    Ella Fitzgerald recorded this on her Verve release Whisper Not, with backing by Marty Paich and his orchestra.\n    Stacey Kent - included the tune on her 2001 Dreamsville album.\n    Harry Nilsson released a version on his album recorded with Gordon Jenkins, A Little Touch of Schmilsson in the Night.\n    Susannah McCorkle - Thanks For The Memory - Songs Of Leo Robin (1983), Most Requested Songs (2001)\n    Frank Sinatra recorded an extended version of the song with altered lyrics for his 1981 album, She Shot Me Down.\n    Rosemary Clooney on her 1985 album Rosemary Clooney Sings Ballads.\n\nPARODIES\n    Charlie and his Orchestra, a Nazi-sponsored German propaganda swing band, produced a version during WWII.\n    Marilyn Monroe's performance of &quot;Happy Birthday, Mr. President&quot; to U.S. President John F. Kennedy in 1962 was followed by an additional verse sung to the tune of &quot;Thanks for the Memory&quot;: &quot;Thanks, Mr. President/For all the things you've done/The battles that you've won/The way you deal with U.S. Steel/And our problems by the ton/We thank you so much.&quot;\n    The song was parodied as &quot;Thanks for the Medicare&quot; on one episode of the 1980s NBC-TV sitcom The Golden Girls. Estelle Getty's character, Sophia Petrillo, sang these lyrics to the melody of the song: &quot;Thanks for the Medicare/For Blue Cross and Blue Shield/For a hip that finally healed/Remember, on prescriptions, generic is a steal/We thank you so much.&quot;\n    Connie Chung sang a rendition of it with her husband Maury Povich on the final episode of her show Weekends with Maury and Connie in 2006.\n    Judi Dench sang her own 'thank you' version especially for Sir Michael Parkinson on his final show - The Final Conversation - in December 2007.\n\n==============================================================\n\nThe Cat and the Canary (1939) - Bob Hope, Paulette Goddard\n\n\nThe Cat and the Canary starring Bob Hope and Paulette Goddard is a 1939 comedy horror film remake of the 1927 film The Cat and the Canary, which was based on the 1922 play of \n\nthe same name by John Willard. The film was directed by Elliott Nugent.\n\n    CAST:-\n    Bob Hope as Wally Campbell, a wise-cracking actor who knew Joyce in high school and whom Fred calls &quot;the original flutterbrain&quot;\n    Paulette Goddard as Joyce Norman, a sketch artist, the last living family member carrying the Norman name\n    John Beal as Fred Blythe, a sullen man who is romantically interested in Joyce\n    Douglass Montgomery as Charles Wilder, a charming, attractive man who wishes to resume a previous relationship with Joyce\n    Gale Sondergaard as Miss Lu, an attractive but spooky Creole woman who was Norman's mistress and housekeeper\n    Elizabeth Patterson as Aunt Susan, an older woman who was once close to Norman. Patterson reprises her role from the 1930 adaptation of the story, The Cat Creeps.\n    George Zucco as Mr. Crosby, a lawyer, executor of Norman's estate\n    Nydia Westman as Cicily, an excitable young woman who reveres Wally\n    John Wray as Guard Hendricks\n    George Regas as Indian guide\n    Milton Kibbee as Photographer\n    Charles Lane as Reporter\n    Chief Thundercloud as Indian guide\n\nDirected by Elliott Nugent\nProduced by Arthur Hornblow, Jr.\nWritten by Walter de Leon\nMusic by Ernst Toch\nRunning time 72 min.\n\nSYNOPSIS:- THe Cat and the Canary (1939)\nCyrus Norman was a millionaire who lived in the Louisiana bayous with his mistress Miss Lu (Sondergaard). Norman died ten years before the film's opening scene, in which a Native American man (Regas) paddles Mr. Crosby (Zucco), the executor of Norman's estate, through alligator-infested waters to Norman's isolated mansion, where his will is to be read at midnight. At the mansion, Crosby meets Miss Lu, who lives there with a large black cat. When he removes the will from a safe, he discovers that someone has tampered with it.\n\nCrosby and Miss Lu are joined by Norman's survivors: Joyce Norman (Goddard), Fred Blythe (Beal), Charles Wilder (Montgomery), Cicily (Westman), Aunt Susan (Patterson), and Wally Campbell (Hope). As the group gathers in the parlor to read the will, an unseen gong rings seven times. According to Miss Lu, this means that only seven of the eight people present will survive the night.\n\nNorman's will has two parts. The first indicates that Joyce will inherit the entire estate, under one condition: Concerned about a streak of insanity in the family's blood, Norman stipulated that his heirs must remain sane for the next 30 days. If Joyce loses her sanity during that time, the heir will be determined from the second part of the will. This arrangement raises concerns about Joyce's safety, since other family members can increase their chances of inheriting by murdering her or driving her insane.\n\nAfter the reading, Crosby informs everyone that they will have to stay overnight; Miss Lu warns them of spirits in the house; and a security guard found prowling outside claims that a murderer called &quot;The Cat&quot; has escaped from the nearby insane asylum. In the parlor, Crosby tries to warn Joyce about something, but a hidden doorway opens in the wall and someone pulls him into the space behind it. Joyce becomes frightened when everyone except Wally believes she imagined this.\n\nAmid suspicion and accusations, Miss Lu gives Joyce a letter from Norman that Joyce and Wally use to find a diamond necklace. Joyce puts the necklace under her pillow in Norman's room, but after she falls asleep, a hand reaches out from the wall, terrifies her, and takes the necklace. At this point, Joyce is almost out of her mind with fear and confusion, but Wally finds a movable wall panel near her bed and opens a hidden door leading to a secret passageway. Crosby's dead body falls out from behind the door.\n\nTo help Joyce recover from her fright, Wally chats with her in the parlor. When he leaves to fetch some liquor, he hears something in Norman's room, opens the hidden door, and explores the passageway. Meanwhile, Joyce sees the door in the parlor as it opens. When Wally calls to her, she hears him through the passageway and enters it to find him. Once she is inside, someone closes the door.\n\nWith no exit, Joyce explores the passageway, walking past a dark cranny where the security guard is hiding. The Cat also walks past the guard, who stops him and takes the necklace from him, but the Cat stabs the guard in the back and follows Joyce, who has discovered a door leading outside. After the Cat chases Joyce into a shed and threatens her with a knife, Wally arrives and calls him &quot;Charlie&quot;, having found the second part of the will in Charles's coat. Charles removes his Cat mask, pins Wally to the wall with his knife, and begins to strangle Joyce, but Miss Lu arrives with a shotgun and kills him. The next day, Wally and Joyce explain the story to newspaper reporters and unofficially announce their engagement.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 150 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 150 mins","torrent":{"xt":"urn:btih:38249a15b4c49caaef11650af98a28b384fc8569","amp;dn":"Bob+Hope+Collection+-+Thanks+for+the+Memory+%281938%29+-+The+Cat+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38249a15b4c49caaef11650af98a28b384fc8569","infoHashBuffer":{"type":"Buffer","data":[56,36,154,21,180,196,156,170,239,17,101,10,249,138,40,179,132,252,133,105]},"announce":[],"urlList":[]}}