{"title":"NGC - Ancient Megastructures [HDRip 720p]","uid":5471182,"size":9259979800,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:389cc63ae9b04d1f14520d8dc1bc53f88a250b85&amp;dn=NGC+-+Ancient+Megastructures+%5BHDRip+720p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Milleman","files":-1,"time":1269894004,"description":"NGC - Ancient Megastructures\n(7 Episodes between 2007 and 2009)\n\n1. Colosseum\n\nYear: 2007\nCountry: United States\nGenre: Documentary\nDuration: 00:47:25\nTranslation: Professional (odnogolosy)\n\nDescription: Colosseum - Arena sand and blood, are the great gladiators fought to the death in its greatest effect. Greatest amphitheater of the ancient world embodies the genius of Roman engineering, but is much more - a powerful tool of control over the population and a reason for the proclamation of the Roman greatness in the world. The idea of the emperor, an upstart, a history of the Coliseum is as brutal and bloody, as the events that took place in it.\n\n2. Pyramids\n\nYear: 2007\nCountry: United States\nGenre: Documentary\nDuration: 00:47:01\nTranslation: Professional odnogolosy\n\nDescription: Once upon a time in ancient times there were seven wonders of the world, seven monuments of human ingenuity, but one after another, these civilizations have collapsed and miracles turned to dust, lost in the sands of time. Great Pyramid of Giza, the age of which 4.5 thousand years - is the only surviving ancient wonder of the world and the oldest of them. Around the pyramids rise to many myths, but its real story is the story of triumph despite insurmountable obstacles, an outstanding human skills and an unquenchable thirst for one man to live forever.\n\n3. Cathedral of Chartres\n\nYear: 2007\nCountry: United States\nGenre: Documentary\nDuration: 00:47:01\nTranslation: Professional (odnogolosy)\n\nChartres Cathedral stood for 800 years. As testimony to the brilliant engineering of the Middle Ages and shows the world what was able to reach the Gothic architecture. But this ancient supersooruzheniem is a terrible story of man's weakness, hypocrisy, destruction and violence, the instruments of power struggle between the European aristocracy and the Catholic Church. \n\n4. Petra\n\nYear: 2009\nCountry: United States\nGenre: Documentary\nDuration: 00:47:23\nTranslation: Professional (odnogolosy)\n\nDescription: Petra - a precious stone, lost in the Arabian desert, one of the most mysterious of ancient cities. At the entrance to the city rises a masterpiece of architecture El Hazne. Perpetuated in Hollywood films, this structure cut into the rock for almost 20 centuries ago, but today researchers are still stunning architectural monuments behind El Hazne and traces of the people of the desert, created the city. The search is not over yet. How they managed to build this magnificent building? Who were these great masters? And the most important question - what was the building intended for?\n\n5. Machu Picchu\n\nYear: 2009\nCountry: United States\nGenre: Documentary\nDuration: 00:46:48\nTranslation: Professional (odnogolosy)\n\nDescription: On the distant mountain range, located high in the Peruvian Andes, are the ruins of the ancient city. 600 years they stood under the onslaught of torrential rains and mudslides. The city consists of thousands of stones, weighing up to 20 tons, fitted tightly to each other. Each stone has been processed and installed using only human hands and primitive tools. Built by the will of the ambitious emperor, this city is a wonderful legacy of the empire of the Americas. This is Machu Picchu, a city born of war and victory. \n\n6. St. Paul's Cathedral\n\nYear: 2009\nCountry: United States\nGenre: Documentary\nDuration: 00:47:27\nTranslation: Professional (odnogolosy)\n\nDescription: In 1666, in London, thousands of people fleeing the fire, devouring the great cathedral. Fire destroys this monumental architecture. But the new miracle of architecture rises from the ashes and will rise above one of the richest cities in the world. As the first and largest Protestant church, it will be unchanged part of the London landscape. Erection of a huge dome will become a matter for the architect of all life. Each time the church will be on the verge of destruction, he will look for engineering solutions. It is a risk, putting into practice the revolutionary ideas, to realize its tremendous dream. \n\n7. Alhambra (Sorry, Russian Soundtrack Only)\n\nYear: 2009\nCountry: United States\nGenre: Documentary\nDuration: 00:47:33\nTranslation: Professional (odnogolosy)\n\nDescription: In the Andalusian mountains of southern Spain, rises the majestic fort, which became a legend, Alhambra. This ancient citadel overlooks Granada. On the construction of its 37 towers and walls of the powerful took more than 150 years, but the Alhambra - it's not only an impregnable fortress, this magnificent palace, with elegant courtyards and unfolded the bloody scene where the intrigue and the most famous of the surviving monuments of Muslim architecture in the western world.\n\n\nQuality: HDTV\nFormat: MKV\nVideo codec: x264\nAudio Codec: AC3\nVideo: 720p 1280 x 720, 25fps, 2838-3293 Kbps\nAudio1: English: DD 5.1 448/448/448/224/224/224 kbps\nAudio2: Russian: DD 5.1 448/448/448/384/384/384 kbps, DD 2.0 192 kbps\n\nHelp seeding, plz!","torrent":{"xt":"urn:btih:389cc63ae9b04d1f14520d8dc1bc53f88a250b85","amp;dn":"NGC+-+Ancient+Megastructures+%5BHDRip+720p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"389cc63ae9b04d1f14520d8dc1bc53f88a250b85","infoHashBuffer":{"type":"Buffer","data":[56,156,198,58,233,176,77,31,20,82,13,141,193,188,83,248,138,37,11,133]},"announce":[],"urlList":[]}}