{"title":"Chocky","uid":3541711,"size":1435823017,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38acddc3833515ff378339f8de3e266ce0e1a796&amp;dn=Chocky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blueshade","files":7,"time":1161199746,"description":"The series is the story of young Matthew Gore (Andrew Ellams), an intelligent boy from the Home Counties of England who is chosen by a mysterious extra-terrestrial visitor to Earth, Chocky, as a source of information about life on earth.\n\nThe drama follows the story as his parents witness a strange change in Matthew&amp;#039;s behaviour as he becomes more attentive and inquisitive about life around him. His schoolwork improves dramatically, as does his artistic talent and manual dexterity on mid-80s computer games!\n\nIn an effort to understand what is happening to their son, Matthew&amp;#039;s parents refer to a child psychiatrist. The dubious social connections of this man lead to Matthew&amp;#039;s subsequent kidnap, as ruthless businessman tries to tap into the amazing extra-terrestrial knowledge that Chocky has imparted to him.\n\nMatthew also saves his sister Polly from drowning thanks to Chocky taking control of his mind - ordinarily he was a non-swimmer. In the final episode when Chocky leaves Matthew for good, she is able to explain to his father (James Hazeldine) who she is, why she has been here, and why she is leaving. At this point the original book ends, although Thames produced, in association with the estate of John Wyndham, two further series, Chocky&amp;#039;s Children and Chocky&amp;#039;s Challenge.\n","torrent":{"xt":"urn:btih:38acddc3833515ff378339f8de3e266ce0e1a796","amp;dn":"Chocky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38acddc3833515ff378339f8de3e266ce0e1a796","infoHashBuffer":{"type":"Buffer","data":[56,172,221,195,131,53,21,255,55,131,57,248,222,62,38,108,224,225,167,150]},"announce":[],"urlList":[]}}