{"title":"White Mommas #3 - Mature Interracial Porn XXX 2 hrs. 57 mins.","uid":8891854,"size":3448485503,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3903113600c27576f6c25543bb5af2296a1adbe7&amp;dn=White+Mommas+%233+-+Mature+Interracial+Porn+XXX+2+hrs.+57+mins.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"KidAtomic","files":-1,"time":1378599494,"description":"White Mommas #3\n\n100% MILF!\n\n\nStarring Holly Halston In Her 1st Interracial Scene!\n\nL.T. returns with his best selling interracial MILF series, White Mommas. Featuring an epic all star cast starring Holly Halston, with Amber Lynn, Skylar Price, Roxanne Hall and Zoey Holloway. Do not miss.\n\nOlder white women are tired of sucking on little white penises their whole lives so they take a chance and do the humpty dance on top of the poles of rugged thug black men!\n\n Pale perfection in its prime - five white-hot Mommas contrasting colourfully with their favourite black stud. L.T. It's the first black gentleman to ever talk his way into Holly Halston.\n\nL.T. Directs and studs every scene and has chosen his co-stars for both their well-preserved beauty, their extreme hunger for a big black cock and his own deep appreciation for white booty. \n\n    Scene 1. Holly Halston, L.T.\n    Scene 2. Zoey Holloway, L.T.\n    Scene 3. Skylar Price, L.T.\n    Scene 4. Roxanne Hall, L.T.\n    Scene 5. Amber Lynn, L.T.\n\nLength 2 hrs. 57 mins.\nRating XXX\nReleased Mar 22 2011\nProduction Year 2011\nStudio  Elegant Angel\n\nActresses:\n    Amber Lynn [Anal Facial IR]\n    Holly Halston [Anal Facial Bald A2M IR]\n    Roxanne Hall [Anal Facial Bald A2M IR]\n    Skylar Price [Anal Facial Bald Swallow A2M IR]\n    Zoey Holloway [Anal Facial A2M IR]\n\nActors:\n    L.T.\n\nSummary: White Mommas 3 by director LT Turner for Elegant Angel had a lot of humor, heated sexual exploits, and chemistry between the director and his female cast. This increased the strokability, replay value, and overall value of the movie for me, the nod to anal, MILFs, and interracial all evenly balanced to the point where it stood out from the products that meet all advertised components on a technical level but surely lack the magic of a well played fuck flick. The technical attributes were fairly polished up this time too, making the movie one I can honestly say merited a rating of Highly Recommended for those that want each factor mentioned in their smut. In short, White Mommas 3 was a fine fuck flick to incorporate so many niches and prove that LT was up to the task of complimenting the other directors at the company, whomever his crew might have been, handling the behind the camera aspects nearly as well as he took care of the ladies.","torrent":{"xt":"urn:btih:3903113600c27576f6c25543bb5af2296a1adbe7","amp;dn":"White+Mommas+%233+-+Mature+Interracial+Porn+XXX+2+hrs.+57+mins.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3903113600c27576f6c25543bb5af2296a1adbe7","infoHashBuffer":{"type":"Buffer","data":[57,3,17,54,0,194,117,118,246,194,85,67,187,90,242,41,106,26,219,231]},"announce":[],"urlList":[]}}