{"title":"Creedence Clearwater Revival-The Singles Collection(2009)[EAC-FL","uid":5285065,"size":1497644392,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:397f161393396af5914d30bf457b87b08b4d345c&amp;dn=Creedence+Clearwater+Revival-The+Singles+Collection%282009%29%5BEAC-FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":68,"time":1263680797,"description":"--------------------------------------------------------------\n\n\nReleaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nDVD (Clone Dvd): Dolby D/Digital PCM; standard 4:3 format\nArtwork:  Full Scans 300dp \n\n--------------------------------------------------------------\n\n\nReleases information\n\n\n\nThe complete U.S. Singles collection presented in their original mixes for the first time in over 40 years! Includes a bonus DVD of four CCR videos PLUS a collectible poster!\n\n\nAs a band that had tremendous top-40 success during the hey-day of freeform radio, Creedence Clearwater Revival stood with one foot planted firmly in each world. Their LPs were recorded in well-produced stereo, offered extended jams, thoughtful cover songs and deep album cuts that found room on underground FM stations such as Bay Area legends KMPX and KSAN. But above ground, the band's music was remixed into powerful mono, edited for length and unleashed via AM powerhouses. AM's narrow frequency range added emphasis to the music's midrange, focusing listeners on Fogerty's vocals and stinging guitar leads, and further revealing the band's rhythm section to be among the most rock-solid and potent of its era. Their driving rhythms are just that much more driving in mono, and the band's pop tunes sprang easily from a single speaker in the middle of a car's dashboard.\n\nFogerty wrote with the goal of placing his songs alongside the R&amp;B hits the group had grown up loving on Oakland's KWBR and Sacramento's KRAK. His originals stood toe-to-toe on album, airwave and top-40 chart with covers of &quot;Suzie Q,&quot; &quot;I Put a Spell on You&quot; and &quot;I Heard it Through the Grapevine.&quot; Included here are the A- and B-sides of thirteen original singles, ranging from 1968's &quot;Porterville&quot; (b/w &quot;Call it Pretending&quot;) through 1972's &quot;Someday Never Comes&quot; (b/w &quot;Tearin' Up the Country&quot;). Also included is the single-edit of &quot;I Heard It Through the Grapevine&quot; (b/w &quot;Good Golly Miss Molly&quot;) that was released in 1976, four years after the group disbanded, and both sides of the stereo promotion-only experiment &quot;45 Revolutions Per Minute.&quot; The latter, a montage of production ideas, sound effects, musical bridges and comedy bits previously appeared as bonus tracks on the 2008 reissue of Pendulum.\n\nMost of these songs are well-known to even casual listeners, as Creedence often broke both sides of their singles. The few less familiar cuts are the group's first B-side &quot;Call It Pretending,&quot; Stu Cook's &quot;Door to Door&quot; (an album cut from Mardi Gras and the B-side of &quot;Sweet Hitch-Hiker&quot;), and Doug Clifford's &quot;Tearin' Up the Country&quot; (also from Mardi Gras, and the B-side of &quot;Someday Never Comes&quot;). Strung end-to-end, these singles provide the AM listener's view of Creedence Clearwater Revival's success. While FM listeners grooved to 8:37 of &quot;Suzie Q,&quot; AM listeners enjoyed a concise 4:33 edit, and while album buyers sat back to enjoy album jams like &quot;Graveyard Train,&quot; &quot;Keep on Chooglin'&quot; and &quot;Ramble Tamble,&quot; singles buyers got another gumdrop every three or four months. The singles form an intertwined, yet separate, artistic arc that the band carved out in parallel to their albums.\n\nConcord delivers thirty tracks on two CDs, each screened with a vintage Fantasy record label. The CDs are housed in a standard jewel case, together with a 20-page booklet that includes new liner notes by Ben Fong-Torres. Torres' essay provides a genial trip through Creedence's success on the radio, with quotes from 1960's boss jocks, but it's light on the particulars of these mono mixes and edits. A separate cardboard sleeve houses a DVD of four Creedence promotional videos: &quot;I Heard It Through the Grapevine,&quot; &quot;Bootleg,&quot; &quot;I Put a Spell on You,&quot; and &quot;Lookin' Out My Back Door.&quot; Staged in studios and aboard a riverboat these are real treats, with the band looking youthful and happy. There are groovy dancers on &quot;Bootleg&quot; and psychedelic effects of &quot;I Put a Spell On You,&quot; and the black-and-white footage of &quot;Lookin' Out My Back Door&quot; looks like it was filmed in the band's rehearsal space.\n\n\n\n\nTrackList:\n\nCD 1\n1. Porterville\n2. Call It Pretending\n3. Suzie Q. (Pt. 1)\n4. Suzie Q. (Pt. 2)\n5. I Put a Spell on You\n6. Walk on the Water\n7. Proud Mary\n8. Born on the Bayou\n9. Bad Moon Rising\n10. Lodi\n11. Green River\n12. Commotion\n13. Fortunate Son\n14. Down on the Corner\n15. Travelin' Band\n16. Who'll Stop the Rain\n\nCD 2\n1. Run Through the Jungle\n2. Up Around the Bend\n3. Long As I Can See the Light\n4. Lookin' Out My Back Door\n5. Have You Ever Seen the Rain?\n6. Hey Tonight\n7. Sweet Hitch-Hiker\n8. Door to Door\n9. Someday Never Comes\n10. Tearin' Up the Country\n11. I Heard It Through the Grapevine [single edit]\n12. Good Golly, Miss Molly\n13. Revolutions Per Minute (Part I)\n14. Revolutions Per Minute (Part II)\n\nDVD\n\n1. I Heard It Through the Grapevine\n2. Bootleg\n3. I Put a Spell on You\n4. Lookin' Out My Back Door\n\n\n\n\n\n(John Fogerty: vocals, guitar; Tom Fogerty: guitar; Stu Cook: bass; Doug Clifford: drums)\n","torrent":{"xt":"urn:btih:397f161393396af5914d30bf457b87b08b4d345c","amp;dn":"Creedence+Clearwater+Revival-The+Singles+Collection%282009%29%5BEAC-FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397f161393396af5914d30bf457b87b08b4d345c","infoHashBuffer":{"type":"Buffer","data":[57,127,22,19,147,57,106,245,145,77,48,191,69,123,135,176,139,77,52,92]},"announce":[],"urlList":[]}}