{"title":"Colin Tatz - With Intent to Destroy [2003][A]","uid":9951180,"size":5308857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:398a9887bd98f3a4bce3178b03c618aedaae4b89&amp;dn=Colin+Tatz+-+With+Intent+to+Destroy+%5B2003%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397403593,"description":"Description\nProduct details\nBook Title: With Intent to Destroy: Reflections on Genocide\t\nBook Author: Colin Tatz (Author)\nHardcover: 222 pages\nPublisher: Verso Books (2 July 2003)\nLanguage: English\nISBN-10: 1859845509\nISBN-13: 978-1859845509\n\nBook Description\nPublication Date: 2 July 2003\nAs heirs of the Enlightenment, we in the West tend to view ourselves as humane, rational and reasonable. Genocides are atrocities that &quot;others&quot; commit, so revealing their backwardness and essential &quot;otherness&quot;. A South African-Australian-Jew, Tatz provides a personal yet analytical and critical account of race politics, and the termini to which such policies and practices have led in Germany, Australia and South Africa. Each case study offers a series of reflections on the subject of genocide: how logical, if monstrous, was the transformation in 1930s' Germany from a cruel and institutionalised anti-Semitism into the Nazi killing machine; what constituted the colonial genocide practiced for many years in Australia; whether or not the word genocide can be applied to the appalling events that prevailed in apartheid South Africa. Framing these studies are a moving autobiographical chapter which describes the author's South African childhood and an essay which addresses responses (official and otherwise) to genocide: the matter of denialism, the war crimes trials, the Vatican's apology and Australia's National Sorry Day, among others. The book closes with the author's reflections on the teaching of genocide. In focusing mainly on Westerners' experiences of genocide, Colin Tatz raises uncomfortable questions about the humane, rational people we believe ourselves to be, and exposes this enlightenment-based self-image as dangerous complacency.\n\nReviews\n&quot;This is an exciting and important book by Colin Tatz, a truth teller and bearer of much of the conscience of his adopted country. In releasing the intellectual and moral logjam around the issue of genocide, he makes vital links that may be unpalatable to some but are accurate and typically honest.&quot;-- John Pilger, award-winning investigative journalist and film-maker\n\n&quot;Colin Tatz is one of the world's foremost scholars of genocide. He applies the UN Convention without fear or favour, illuminating instances of mass murder and human destructiveness previously neglected by others.&quot; - Professor Robert Melson, author of Revolution and Genocide\n\nAbstract\nProfessor Colin Tatz has been one ofthe most prominent scholars in the field of the politics of race and genocide, and has dedicated much of his career to 'a profound appreciation of genocide as the ultimate form of racism' (p 14). His most recent book, With Intent To Destroy: Reflecting on Genocide, makes a valuable and impressive contribution to the many debates and issues surrounding the meaning of genocide and its possible applicability to 'advanced' nations traditionally thought to be immune from such accusations. The book draws heavily on previous published articles, papers and speeches by the writer. Within its brief 184 pages of text is an eclectic mix containing the writer's personal reflections on his life; an analysis of the inter-related evils of anti-Semitism and racism; a history of race issues in Nazi Germany, Australia and South Africa; and a discussion ofsome of the more complex issues surrounding genocide. Given this diverse mix, the book is clearly not intended, nor would it be suitable for, a textbook on the topic of genocide. It is also plainly not meant to be a book for beginners since much of the book relies upon the reader having at least a basic background to the history of the Holocaust and many of the issues and concepts canvassed throughout.\n\nAbout the Author\nBorn and educated in South Africa, Colin Tatz emigrated to Australia in 1961. The author of fifteen books and holder of several prestigious academic posts, he is currently Director of the Australian Institute for Holocaust and Genocide Studies based at the Shalom Institute, University of New South Wales.\n","torrent":{"xt":"urn:btih:398a9887bd98f3a4bce3178b03c618aedaae4b89","amp;dn":"Colin+Tatz+-+With+Intent+to+Destroy+%5B2003%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"398a9887bd98f3a4bce3178b03c618aedaae4b89","infoHashBuffer":{"type":"Buffer","data":[57,138,152,135,189,152,243,164,188,227,23,139,3,198,24,174,218,174,75,137]},"announce":[],"urlList":[]}}