{"title":"Digital Electronics and Design with VHDL","uid":6750417,"size":16776631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39de0deb9b29fdfc571e59acf038c69c1e857a01&amp;dn=Digital+Electronics+and+Design+with+VHDL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tirantsh","files":1,"time":1318811295,"description":"Author(s): Volnei A. Pedroni Ph.D. California Institute of Technology; former visiting Professor Harvey Mudd C\nPublisher: Morgan Kaufmann\nDate: 2008-02-08\nFormat: pdf\nLanguage: English\nISBN10: 0123742706\nPages: 720\nQuality: excellent\nISBN13: 9780123742704\n\nProduct Description: This book offers a friendly presentation of the fundamental principles and practices of modern digital design. Unlike any other book in this field, transistor-level implementations are also included, which allow the readers to gain a solid understanding of a circuit's real potential and limitations, and to develop a realistic perspective on the practical design of actual integrated circuits. Coverage includes the largest selection available of digital circuits in all categories (combinational, sequential, logical, or arithmetic). Coverage also includes detailed digital design techniques, with a thorough discussion on state-machine modeling for the analysis and design of complex sequential systems. Key technologies used in modern circuits are also described, including Bipolar, MOS, ROM/RAM, and CPLD/FPGA chips, as well as codes and techniques used in data storage and transmission. Designs are illustrated by means of complete, realistic applications using VHDL, where the complete code, comments and simulation results are included.\n\n* Comprehensive coverage of fundamental digital concepts and principles, as well as complete, realistic, industry-standard designs\n* Many circuits shown with internal details at the transistor-level, as in real integrated circuits\n* Actual technologies used in state-of-the-art digital circuits presented in conjunction with fundamental concepts and principles\n* Six chapters dedicated to VHDL-based techniques, with all VHDL-based designs synthesized onto CPLD/FPGA chips","torrent":{"xt":"urn:btih:39de0deb9b29fdfc571e59acf038c69c1e857a01","amp;dn":"Digital+Electronics+and+Design+with+VHDL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39de0deb9b29fdfc571e59acf038c69c1e857a01","infoHashBuffer":{"type":"Buffer","data":[57,222,13,235,155,41,253,252,87,30,89,172,240,56,198,156,30,133,122,1]},"announce":[],"urlList":[]}}