{"title":"Jagged Alliance 2 Wildfire 6.04","uid":8626889,"size":688904157,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3a19b8ed722b3eabed41f265794747495069cfd1&amp;dn=Jagged+Alliance+2+Wildfire+6.04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Whitebb","files":-1,"time":1372530098,"description":"About the Game\n\nEven if the regime is totally inept and corrupt, don't suppose for a moment that you as the liberator will be greeted with open arms.\n\nJAGGED ALLIANCE 2: WILDFIRE brings you back to Arulco. The population is being terrorized by a reckless army; in the meantime the main export goods are drugs. Subversion and fraudulence has infiltrated all levels of local government and the ever-present Mafia has his fingers in many pies. You are working undercover on behalf of the US government and your goal is to destroy the mighty drug cartel. You'll need a skilled hand to put together the right team of mercenaries and the negotiating skills of a diplomat to get the sceptical population on to your side. You'll also need the strategic genius of a general and the fighting tactics of a guerrilla.\n\nGameplay\n\nAn exciting mix of strategy and role-playing that puts you in charge of a nation's fight for freedom. Your objectives are - to hire a core group of skilled professionals through A.I.M., the Association of International Mercenaries; to win the local population over to your side by displaying courage and loyalty; to train your men around the clock and then send them into dangerous missions and lethal fire fights and to conquer the depths of underground mines, reap their riches and discover their secrets. Each success will bring you closer to total victory, while each failure must be overcome with iron determination. Sometimes a tactical withdrawal can bring you more benefits than a battle for battle's sake. Retreat from one sector only to surprise the enemy by attacking on another flank. At the beginning, some of your enemy's bases may seem to be impregnable - but don't despair - you will have to become stronger step by step and slowly gain ground.\n\nKey Features\n\nIncomparable depth of gaming combined with non-linear gameplay\nUnique mixture of real time reconnaissance and turn-based combat\nCreate your own optimal mercenary.\nInteract with more than 150 characters.\nRecruit teams of mercenaries all with their own unique personality.\nThree difficulty levels and new resolution of 1024x768 pixel.\nBuild up your team wiht up to 10 mercenaries\n8 new playable mercenaries with individual histories\n230 new and reworked sectors, plus new settlements\nVarying landscapes with changing density of vegetation and new visual conditions\n\n-----------------\n\n* Open Readme.txt file for Installation info.\n\nSeed &amp; HF","torrent":{"xt":"urn:btih:3a19b8ed722b3eabed41f265794747495069cfd1","amp;dn":"Jagged+Alliance+2+Wildfire+6.04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a19b8ed722b3eabed41f265794747495069cfd1","infoHashBuffer":{"type":"Buffer","data":[58,25,184,237,114,43,62,171,237,65,242,101,121,71,71,73,80,105,207,209]},"announce":[],"urlList":[]}}