{"title":"Donnie Darko (2001) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)","uid":9445072,"size":3683011918,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3a7a5aa369df18b3a0bb77634b953b6a0035ea75&amp;dn=Donnie+Darko+%282001%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clownsec","files":-1,"time":1389074946,"description":"Donnie Darko (2001) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nDonnie (Jake Gyllenhaal) is a bright and charming high-school student who also has a dark and willfully eccentric side; he does little to mask his contempt for many of his peers and enjoys challenging the authority of the adults around him. Donnie is also visited on occasion by Frank, a monstrous six-foot rabbit that only Donnie can see who often urges him to perform dangerous and destructive pranks. Late one night, Frank leads Donnie out of his home to inform him that the world will come to an end in less than a month; moments later, the engine of a jet aircraft comes crashing through the ceiling of Donnie's room, making him think there might be something to Frank's prophesies after all. The rest of Donnie's world is only marginally less bizarre, as he finds himself dealing with his confused parents (Mary McDonnell and Holmes Osborne), his college-age sister (Maggie Gyllenhaal), his perplexed analyst (Katherine Ross), a rebellious English teacher (Drew Barrymore), a sleazy self-help expert (Patrick Swayze), and the new girl at school who is attracted by Donnie's quirks (Jena Malone). Donnie Darko was the first feature film from writer and director Richard Kelly; Drew Barrymore, who plays teacher Karen Pomeroy, also lent her support to the project as executive producer. A director's cut played in select theaters on a limited basis in the summer of 2004, featuring original music cues and trimmed scenes originally in Kelly's first cut of the film\n\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *\n","torrent":{"xt":"urn:btih:3a7a5aa369df18b3a0bb77634b953b6a0035ea75","amp;dn":"Donnie+Darko+%282001%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7a5aa369df18b3a0bb77634b953b6a0035ea75","infoHashBuffer":{"type":"Buffer","data":[58,122,90,163,105,223,24,179,160,187,119,99,75,149,59,106,0,53,234,117]},"announce":[],"urlList":[]}}