{"title":"Brokeback - Field Recordings from the Cook County Water Table [1","uid":8883661,"size":207653197,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3a898fea098b858dd2917dc9a81106299a1c8a79&amp;dn=Brokeback+-+Field+Recordings+from+the+Cook+County+Water+Table+%5B1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1378397090,"description":"Artist: Brokeback\nRelease: Field Recordings from the Cook County Water Table\nReleased: 1999\nLabel: Thrill Jockey\nCatalog#: 71601\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Alternative/Indie Rock,Experimental Rock\n\n1.\tAfter the Internationals (5:09)\n2.\tReturns to the Orange Grove (4:15)\n3.\tThe Field Code (4:34)\n4.\tThis Is Where We Sleep (2:25)\n5.\tAnother Routine Day Breaks (5:01)\n6.\tWe Let the &quot;S&quot; Hang in the Air (3:10)\n7.\tThe Wilson Ave. Bridge at the Chicago River, 1953 (7:54)\n8.\tThe Flat Curving (3:18)\n9.\tA Blueprint (3:10)\n10.\tSeiche 2 (2:12)\n11.\tThe Great Banks (4:48)\n12.\tSometimes a Cold Rain Can Push Down on the Back of Your Head (2:14)\n\nOn Field Recordings from Cook County Water Table, Tortoise bassist Doug McCombs' solo debut as Brokeback, the Chicago scene veteran doesn't let his ideas get cluttered or allow the album to lapse into a needless Tortoise-rehash. A number of the songs are far less structured than Tortoise's, while others indulge in a loose-limbed groove that the band's TNT album avoided. On the glacially unfolding &quot;The Wilson Ave. Bridge at the Chicago River, 1953,&quot; McCombs introduces a friendly, low-toned rhythm and then adds a higher-register solo on top, moving forward only with the add of some simple shakers. Tortoise fans will devour the head-nodding &quot;The Field Code&quot; and the final four minutes of &quot;The Wilson Ave. Bridge at the Chicago River, 1953,&quot; two classic swatches of bottom-heavy bliss. &quot;A Blueprint&quot; serves as the more sprightly relative to Tortoise's &quot;Along the Banks of Rivers,&quot; featuring husky bass accompaniment from Noel Kupersmith and Tortoise's John McEntire on triangle (McEntire engineered the album). &quot;Returns to the Orange Grove&quot; and &quot;The Flat Curving&quot; go in a different direction, resembling the skeletal playing style of guitarist Loren MazzaCane Connors. For the Pell Mell-ish &quot;Seiche 2,&quot; the album's most &quot;rock&quot; track, McEntire steps behind the drum kit to provide a fine strut underneath McCombs' slinkily cool melody.\nField Recordings has more than enough interesting material to make it appealing for listeners other than crusty Chicago scene trainspotters, its simple methods a welcome contrast to the thick studio polish of TNT.","torrent":{"xt":"urn:btih:3a898fea098b858dd2917dc9a81106299a1c8a79","amp;dn":"Brokeback+-+Field+Recordings+from+the+Cook+County+Water+Table+%5B1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a898fea098b858dd2917dc9a81106299a1c8a79","infoHashBuffer":{"type":"Buffer","data":[58,137,143,234,9,139,133,141,210,145,125,201,168,17,6,41,154,28,138,121]},"announce":[],"urlList":[]}}