{"title":"The Phantom Stranger + Appearances","uid":4837069,"size":4371710672,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a99e33c37aa06faa6932c01900bc61f3a2240cb&amp;dn=The+Phantom+Stranger+%2B+Appearances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"brodahisou","files":-1,"time":1239362867,"description":"The Brotherless One. The Grey Walker. The Spirit of Humanity. Many are the epithets associated with the enigmatic Phantom Stranger, but none of them fathoms his entire being. Was he once an angel who neither sided with Lucifer nor fought against him? Or an angel who fell in love with a mortal? Is he the Wandering Jew of legend? A former scientist who observed the origin of the universe? The theories are many, but unconfirmed. What is known is that the Stranger is an immortal being who walks the mystic planes in search of troubled souls to whom he can offer assistance. &quot;The Stranger comes when the Stranger is required&quot;, he claims, but by whom, nobody knows. The full secret of the Stranger will seemingly never be revealed, and perhaps he has walked his path for so long that he cannot remember it himself.\n\nIn his earliest appearances, the Phantom Stranger would prove supernatural events to be hoaxes. In later stories, the supernatural events were real and the Phantom Stranger was given unspecified superhuman powers to defeat them. He later appeared in various other DC Universe titles, sometimes as a major participant; in others, the Phantom Stranger just appears and gives advice or warning to the featured heroes. Occasionally he serves simply as narrator. In some stories, he seems to be answerable to a mysterious Voice or power.\n\nAlso included are all the current appearances of The Phantom Stranger along with a chronological reading order.  This was created using The DC Database and The Unofficial Guide to the DC Universe.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:3a99e33c37aa06faa6932c01900bc61f3a2240cb","amp;dn":"The+Phantom+Stranger+%2B+Appearances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a99e33c37aa06faa6932c01900bc61f3a2240cb","infoHashBuffer":{"type":"Buffer","data":[58,153,227,60,55,170,6,250,166,147,44,1,144,11,198,31,58,34,64,203]},"announce":[],"urlList":[]}}