{"title":"Flesh + Blood {1985] Paul Verhoeven","uid":6405579,"size":734147472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3af68550454e9f4ca9e1cdeacd6c80a8a0a1dfcd&amp;dn=Flesh+%2B+Blood+%7B1985%5D+Paul+Verhoeven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1305800191,"description":" &lt;a href=&quot;http://bayimg.com/DaikFAadc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DaikFAadc&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089153/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089153/&lt;/a&gt;\n\nFlesh+Blood (1985)\n\n\nDirected by Paul Verhoeven \nProduced by Gijs Versluys \nWritten by Gerard Soeteman\nPaul Verhoeven \nStarring Rutger Hauer\nJennifer Jason Leigh\nTom Burlinson\nRonald Lacey\nSusan Tyrrell\nJack Thompson \nMusic by Basil Poledouris \nCinematography Jan de Bont \nEditing by Ine Schenkkan \nRelease date(s) August 30, 1985 \nRunning time 126 min. \nLanguage English \nBudget $ 6,500,000 \n\nFlesh &amp; Blood (1985) is a film directed by Paul Verhoeven. The film is set in 1501 in Europe, and the title is an allusion to &quot;Sex &amp; Violence&quot;, the main themes. A group of landsknecht mercenaries are followed as they battle, loot, rape and party.\n\nThe script is partly based on unused material for the Dutch TV series Floris, which was the debut for Gerard Soeteman, Paul Verhoeven and Rutger Hauer.\n\nMade between his arthouse homoerotic thriller The Fourth Man and his American debut Robocop, the film serves up healthy portions of realistic medievalism, from brutal combat to poor personal hygiene, from rampant plague conditions to religious fanaticism. The fight scenes are gory, not glorious, and viewers will sit through in-your-face depictions of trauma, pestilence and rape. \n\nThat said, Flesh &amp; Blood remains an excellent, if uncomfortable example of the genre. The Middle Ages aren't prettified for modern viewers whose only impressions of that era come from shiny sword-and-sorcery epic films and glossy roleplaying games. The movie shows us an age where swords didn't just kill; they crippled, maimed and lobotomized -- and survivors of a battle were often worse off than those who died quickly. The scene when Agnes is first discovered by her captors is one of the ugliest scenes in mainstream movie history. These men and women aren't charming rogues, dancing on the outskirts of the law while thumbing their noses at some bumbling sheriff; they're desperate, harsh, callous, crude, immoral and cruel, and it's impossible not to flinch during Agnes' rape ... even as it's hard not to admire the character's ability to turn her misfortune into a position of strength, protecting herself from further abuse by allying herself with the strongest and meanest of the gang. \n\nThat, too, is one of the movie's strengths. Martin is without question a man without scruples or principles ... but Agnes shows him a different view of life and makes him want to pull himself out of the filth and truly become the nobleman he's pretending to be. Unfortunately for Martin, that sort of life change isn't easy to accomplish. It's also hard not to feel some sympathy for Martin and his comrades -- vile or not, they were the wronged parties in this tale. \n\nSurrounding Martin are his loyal if quarrelsome allies, Karsthans (Brion James), Summer (John Dennis Johnston), Miel (Simon Andreu) and Orbec (Bruno Kirby), the latter two of which are a rare example of a non-comedic homosexual pair in 1980s cinema. Also in their group are the fanatical cardinal (Ronald Lacey), the bloodthirsty drummer boy (Jake Wood) and a handful of whores (Susan Tyrrell, Kitty Courbois and Marina Saura). Beyond the walls of their captured castle, key figures include Hawkwood (Jack Thompson), the military leader frequently employed by Arnolfini; Father George (Hans Veerman), the cleric and medic who's always on hand when needed; and a hapless dog. \n\nThe movie is set in 1501, somewhere in western Europe. Costumes, landscapes and accents (which are mostly American-sounding anyway) do little to help pin a location down. While there are flaws (I'm no historian, but I think I spotted a few anachronisms, and I'm pretty sure some details of bubonic plague are wrong), Flesh &amp; Blood will surely give you a taste of an era which was anything but romantic.\n\n","torrent":{"xt":"urn:btih:3af68550454e9f4ca9e1cdeacd6c80a8a0a1dfcd","amp;dn":"Flesh+%2B+Blood+%7B1985%5D+Paul+Verhoeven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af68550454e9f4ca9e1cdeacd6c80a8a0a1dfcd","infoHashBuffer":{"type":"Buffer","data":[58,246,133,80,69,78,159,76,169,225,205,234,205,108,128,168,160,161,223,205]},"announce":[],"urlList":[]}}