{"title":"Eden of the East Movies I The King of Eden &amp; Movie II Paradi","uid":8445131,"size":1459333120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b017a2d3cbf2578c79b418de6bb99e2b254adb7&amp;dn=Eden+of+the+East+Movies+I+The+King+of+Eden+%26amp%3B+Movie+II+Paradi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rmassah","files":2,"time":1367869528,"description":"Eden of The East the Movie I: The King of Eden\n\n\nThe intrigue goes international in The King of Eden, a feature-length conspiracy thriller that continues the action of Eden of the East. The deadly game that began in Japan now intensifies on the streets of New York City. The rules are the same: do whatever it takes to win. Die if you lose.\n\nTakizawa prevented Japan's destruction - and then he vanished. Six months later, clues lead Saki to the Big Apple in search of her missing friend. Meanwhile, the remaining Selecao are plotting their final move. Some of them would prefer Takizawa dead and out of the way. Some might even be willing to help him achieve his goals. Unfortunately, some are prepared to destroy everything if it means claiming checkmate in Mr. Outside's puzzling game.\nRead more at http://myanimelist.net/anime/6372/Higashi_no_Eden_Movie_I:_The_King_of_Eden#ZMOj5qFYBOBsPtb8.99 \n\n\nEden of The East the Movie II: Paradise Lost\n\n\nThe story of political and subversive intrigue in the series finally reaches endgame. Even as the law enforcement net tightens around Saki and her fellow Eden of the East associates over alleged terrorist activities, the complex web surrounding the mysterious Mr. Outside is finally untangled as the remaining Selecao attempt to outmaneuver one another. Takizawa's memories and identity are also finally revealed including his association with a former Prime Minister and his request to be the King of Eden.\nRead more at http://myanimelist.net/anime/6637/Higashi_no_Eden_Movie_II:_Paradise_Lost#g3RMYPDXJf76MAGd.99 ","torrent":{"xt":"urn:btih:3b017a2d3cbf2578c79b418de6bb99e2b254adb7","amp;dn":"Eden+of+the+East+Movies+I+The+King+of+Eden+%26amp%3B+Movie+II+Paradi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b017a2d3cbf2578c79b418de6bb99e2b254adb7","infoHashBuffer":{"type":"Buffer","data":[59,1,122,45,60,191,37,120,199,155,65,141,230,187,153,226,178,84,173,183]},"announce":[],"urlList":[]}}