{"title":"Deconstructing the Myth of AIDS - Documentary","uid":4052433,"size":645402252,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3bdaf4f0916ae9144a8ebcb927f0227cd0328fd5&amp;dn=Deconstructing+the+Myth+of+AIDS+-+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"surikan","files":1,"time":1204223737,"description":"Deconstructing the Myth of AIDS In 1984 we were told that HIV was the cause of AIDS. In his provocative documentary film, ?Deconstructing the Myth of AIDS,? Gary Null, Ph.D., challenges virtually every statement ever made by the American medical industrial complex on the virus - including those of the Centers for Disease Control and Prevention (CDC), the National Institute for Health (NIH) and the Food and Drug Administration (FDA). While presenting the findings of Nobel Prize-winning scientists and leading virologists, the film exposes the political maneuvering, conspiracies and cover-ups that have provided obstacles to the study of this human catastrophe from the start.\n\nWhile presenting the findings of Nobel Prize-winning scientists and leading virologists, the film exposes the political maneuvering, conspiracies and cover-ups that have provided obstacles to the study of this human catastrophe from the start.\n\nFor example, there are experts who believe that AIDS is the result of multiple factors, including drug use, stress and nutritional deficiency, but that government agencies made a politically strategic decision to de-emphasize these hypotheses and thus discourage certain researchers and their funding. Meanwhile, AZT, an infamously failed treatment for cancer, and now the primary FDA-approved approach to treating AIDS, is highly toxic and can produce the very symptoms of the illness it is prescribed to treat.\n\nDeconstructing the Myth of AIDS goes beyond medicine and science to question the very foundation of our reliance on government bureaucracies where it concerns matters of life and death.","torrent":{"xt":"urn:btih:3bdaf4f0916ae9144a8ebcb927f0227cd0328fd5","amp;dn":"Deconstructing+the+Myth+of+AIDS+-+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bdaf4f0916ae9144a8ebcb927f0227cd0328fd5","infoHashBuffer":{"type":"Buffer","data":[59,218,244,240,145,106,233,20,74,142,188,185,39,240,34,124,208,50,143,213]},"announce":[],"urlList":[]}}