{"title":"International Sweethearts of Rhythm documentary (2013)","uid":14782162,"size":626178194,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ca45da995fc56619df7acd0a7357dcdf1c3051d&amp;dn=International+Sweethearts+of+Rhythm+documentary+%282013%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":6,"time":1464995073,"description":"The International Sweethearts of Rhythm, America's Hottest All Girl Jazz Orchestra (2013)\r\nDirected by Greta Schiller and Andrea Weiss\r\n\r\nContents of this folder\r\n\r\nInternational Sweethearts of Rhythm  (main movie)  run time 30 minutes\r\n\r\nQ&amp;A with Greta Schiller and Andrea Weiss at Lincoln Center  (8 minutes)\r\n\r\nLove To Be In Love (48 mins)  A stand-alone documentary on Maxine Sullivan who \r\n                              made &quot;The Bonnie Banks o' Loch Lomond&quot; or just                               &quot;Loch Lomond&quot;,  a hit in the 40's.\r\n\r\nTiny and Ruby; hell divin' women. 28 mins\r\n                              A featurette on Tiny Davis  and Ruby  Lucas two                               members of the band who have stayed together.\r\n\r\nAircheck of Riverwalk Jazz salute to Women's Month\r\n of the Sweethearts of Rhythm 59 minutes\r\nfeaturing live interviews with  band members Roz Kron and Helen Jones Woods.  \r\n\r\nMy Notes:\r\n\r\n   This is a re-code in a much-reduced size from my original torrent uploaded \r\nthree years ago.  At some point of transfer the torrent file that I was seeding was lost.  Unfortunately no one who got it originally kept it going.  As the description says,  there are four pieces here: the main movie, a documentary on Maxine Sullivan and two featurettes.  I have seen them all and they are all good.\r\n\r\nIncluded is an air-check (recording made from radio) of Roz Kron on the &quot;Live From The Landings&quot; show broadcast from Riverwalk Jazz.\r\n\r\nThese films by Greta Schiller and Andrea Weiss are only part of their work.  Schiller has also done the two films &quot;Before Stonewall&quot; and &quot;After Stonewall.&quot;  If these are not on the file shares I can code them at some point.  As always support the producers at Jezebel Productions\r\n                                                        P.O. Box1348\r\n                                                        New York, NY 10011\r\n                                                        and at Jezebel org\r\n\r\nIt's an important collection for women's history and the history of jazz and should be in all libraries.\r\n\r\nIn the modern era the women's band fronted by Kit McClure has featured tribute shows on the \r\nSweethearts of Rhythm.  The Kit McClure band can be found on the net","torrent":{"xt":"urn:btih:3ca45da995fc56619df7acd0a7357dcdf1c3051d","amp;dn":"International+Sweethearts+of+Rhythm+documentary+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca45da995fc56619df7acd0a7357dcdf1c3051d","infoHashBuffer":{"type":"Buffer","data":[60,164,93,169,149,252,86,97,157,247,172,208,167,53,125,205,241,195,5,29]},"announce":[],"urlList":[]}}