{"title":"BOMB THE BASS - Beat Dis - The Very Best Of","uid":3989963,"size":103042518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3eac1e0fc2b972705b12b1cbfd564898e55e2879&amp;dn=BOMB+THE+BASS+-+Beat+Dis+-+The+Very+Best+Of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"badbigdog","files":-1,"time":1200961356,"description":"BOMB THE BASS - BEAT DIS - THE VERY BEST OF\n01. Beat Dis [12 Inch Version]\n02. Megablast [Rap Merlin And DJ Dezire]\n03. Say A Little Prayer\n04. The Air You Breathe\n05. Dont Make Me Wait\n06. Liquid Metal\n07. Shake It\n08. Dynamite Beats\n09. Run Baby Run\n10. On The Cut [2000 Ad]\n11. Hey You\n12. Switching Channels\n13. Dune Buggy Attack\n14. Winter In July [Ubiquity Mix]\n15. Megamix -----------------------------------------------------------------------------BOMB THE BASS  is an electronic/house band created by British musician Tim Simenon. His first single &quot;Beat Dis&quot; from the album Into the Dragon was a number two hit in the UK and was one of the first songs to introduce the mainstream to sampling culture (along with songs by M/A/R/R/S and S'Express). The song &quot;Megablast&quot; took its bassline from the theme music to John Carpenter's film &quot;Assault on Precinct 13&quot;, and was also used in the Bitmap Brothers computer game Xenon 2 Megablast. Other early hits included &quot;Don't Make Me Wait&quot; (as a double A side release with &quot;Megablast&quot;), and a cover of the Burt Bacharach/Hal David composition &quot;I Say a Little Prayer&quot;.\n\n&quot;Love So True&quot;, the first single to be promoted in advance of their second album Unknown Territory, suffered censorship as the outbreak of the First Gulf War prompted UK broadcasters to blacklist a variety of songs and acts deemed potentially controversial due to their content or titles. The band name Bomb the Bass was considered to fall in to this category along with that of Massive Attack. Copies of the &quot;Love So True&quot; single were re-issued credited to Tim Simenon instead of Bomb The Bass, but the resulting confusion may have impeded the single's chart chances.\n\n&quot;Winter in July&quot; from Unknown Territory subsequently went on to be a UK Top 10 hit with the name of Bomb The Bass restored.\n\nTheir third album Clear features appearance from SinÃƒÆ’Ã‚Â©ad O'Connor, Jah Wobble, Benjamin Zephaniah and a rare vocal from novelist Will Self.\n\nWith the band dormant in the late 1990s, Simenon concentrated upon his work as a producer for other artists (including Depeche Mode, U2 and David Bowie among others). He also owns an Amsterdam-based music label called &quot;Electric Tones&quot;, which released the only recent BTB material, the &quot;Clear Cut&quot; EP in 2001. However, in November 2006, news leaked through the Bomb The Bass homepage on Myspace that a new album had been recorded, and was about to be mixed. [ W I K I P E D I A http://en.wikipedia.org/wiki/Bomb_The_Bass ]","torrent":{"xt":"urn:btih:3eac1e0fc2b972705b12b1cbfd564898e55e2879","amp;dn":"BOMB+THE+BASS+-+Beat+Dis+-+The+Very+Best+Of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eac1e0fc2b972705b12b1cbfd564898e55e2879","infoHashBuffer":{"type":"Buffer","data":[62,172,30,15,194,185,114,112,91,18,177,203,253,86,72,152,229,94,40,121]},"announce":[],"urlList":[]}}