{"title":"John Coltrane-60,61&amp;65.iso","uid":8146635,"size":5570498560,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3f204de41fc6b365b007b30e760dbda9c21fa9f1&amp;dn=John+Coltrane-60%2C61%26amp%3B65.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LiquidSkyMan","files":1,"time":1360941256,"description":"John Coltrane - Live in '60, '61 &amp; '65 (2007) [DVD9] {Jazz Icons Series}\nDVD9 -&gt; 5.18 Gb | All Regions | NTSC 4:3 | English (LinearPCM, 2 ch) | ~ 01:37 | ISO Image\nFull Artwork @ 300 dpi (jpg) -&gt; 14 Mb (included in ISO | 5% WinRAR Recovery\nÂ© 2007 Naxos / Reelin' In The Years Pro. / Jazz Icons | 2119007\nJazz / Hard Bop / Saxophone\n\nJazz Icons: John Coltrane provides an epic 95-minute overview of a true giant of 20th-century music. Three separate shows reveal Coltrane's ascending creative arc from hard bop innovator as a member of the Miles Davis Quartet in 1960 to consummate bandleader in 1961 to unrivalled jazz visionary in 1965. This DVD not only features Trane's classic quartet with Elvin Jones (drums), Jimmy Garrison (bass) and McCoy Tyner (piano), but also spotlights him onstage with other jazz legends including Stan Getz, Eric Dolphy and Oscar Peterson. Includes mind-blowing versions of his signature tunes &quot;My Favorite Things&quot; and &quot;Impressions&quot;.\n\n\nAs Ashley Kahn points out in his informative liner notes, there aren't many visual recordings of jazz giant John Coltrane in circulation--or, possibly, in existence. In capturing the saxophonist in three different phases in his too-brief career, this installment in the inestimable Jazz Icons video series performs a valuable service. The 92-minute DVD includes a 1960 performance in Dusseldorf, Germany, featuring Coltrane on tenor with his mates from Miles Davis's rhythm section, jamming on Miles's tunes; a 1961 performance in Baden Baden, Germany, with Coltrane on soprano and tenor, and Eric Dolphy on alto sax and flute, backed by pianist McCoy Tyner, bassist Reggie Workman, and super-drummer Elvin Jones; and a surpassingly intense 1965 Belgium performance by &quot;the Classic Quartet,&quot; with Jimmy Garrison replacing Workman. The black-and-white footage, some of it from broadcast sources, is sometimes striking, sometimes too shadowy (the dated camera effects, while evincing a certain period charm, still don't help). And a rare meeting of Coltrane and tenor great Stan Getz at the end of the Dusseldorf set is compromised by the poor miking of Getz. But we'll put up with such imperfections to hear the primal force of Trane's playing cut through the years, on songs ranging from &quot;Autumn Leaves,&quot; to &quot;Impressions,&quot; to &quot;My Favorite Things.&quot; Trane lives.\n\n\nAAJ INFO\nJazz Icons INFO\n\nPersonnel: John Coltrane: tenor saxophone, soprano saxophone; Wynton Kelly: piano (1-5); Paul Chambers: bass (1-5); Jimmy Cobb: drums (1-5); McCoy Tyner: piano (6-11); Reggie Workman: bass (6-8); Elvin Jones: drums (6-11); Jimmy Garrison: bass (9-11); Oscar Peterson: piano (5); Stan Getz: tenor saxophone (4-5); Eric Dolphy: alto saxophone &amp; flute (6-8).\n\ntracklist:\nGERMANY 1960\n01. On Green Dolphin Street\n02. Walkin'\n03. The Theme\n04. Autumn Leaves / What's New / Moonlight in Vermont\n05. Hackensack\n\nGERMANY 1961\n06. My Favorite Things\n07. Ev'rytime We Say Goodbye\n08. Impressions\n\nBELGIUM 1965\n09. Vigil\n10. Naima\n11. My Favorite Things\n","torrent":{"xt":"urn:btih:3f204de41fc6b365b007b30e760dbda9c21fa9f1","amp;dn":"John+Coltrane-60%2C61%26amp%3B65.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f204de41fc6b365b007b30e760dbda9c21fa9f1","infoHashBuffer":{"type":"Buffer","data":[63,32,77,228,31,198,179,101,176,7,179,14,118,13,189,169,194,31,169,241]},"announce":[],"urlList":[]}}