{"title":"Hide IP NG 1.24(with patch)","uid":4293329,"size":870334,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3facfb155a8f89acb2c5c0184f0cad8bdb4789c6&amp;dn=Hide+IP+NG+1.24%28with+patch%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":1,"time":1215989135,"description":"Key Features of Hide IP NG:\n\nDon&amp;#039;t waste time in testing slow and dangerous public proxies. Just select a USA/UK IP you wish to use from our list. Every IP you see is usable, fast and 100% secure!\n\nAssign different IPs to your computers even they are behind the same router!\n\nA single click and you are ready to go. Hide your IP address without any configuration.\n\nWe never ask our users to create an acount before using. Our users will never be logged and tracked.\n\n1024 bits encryption prevent your ISP and your boss from spying on you!\n\nPrevent others from reading any data you transmit in Wi-Fi Hotspots.\n\nSupport HTTPS:// sites and double your security!\n\nSend anonymous email through any web based mail system (e.g. Gmail, Hotmail).\n\nPost on bulletin boards without displaying your real IP address.\n\nBypass the restrictions placed by some owners of Internet resources on users from certain countries or geographical regions. Bypass work/school web filter and visit any sites you want (e.g. MySpace).\n\nGreat for monitoring your overseas search engine campaigns.\n\nKeeping your computer safe from hacker attacks by hiding your IP address.\n\nProtects you from any website that wants to monitor your reading interests and spy upon you through your unique IP address - your ID in the Internet.\n\nAvoid your personal information being used to send you spam and junk emails. Many marketers and advertising agencies will use you IP address, together with your email, to send you unsolicited emails. ","torrent":{"xt":"urn:btih:3facfb155a8f89acb2c5c0184f0cad8bdb4789c6","amp;dn":"Hide+IP+NG+1.24%28with+patch%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3facfb155a8f89acb2c5c0184f0cad8bdb4789c6","infoHashBuffer":{"type":"Buffer","data":[63,172,251,21,90,143,137,172,178,197,192,24,79,12,173,139,219,71,137,198]},"announce":[],"urlList":[]}}