{"title":"Finding.Bigfoot.S03E15.Peek-A-Boo.Bigfoot.HDTV.x264-tNe","uid":8188618,"size":261032448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:403c259ef4fefd9c1ee61712fe59ee17c451ab9c&amp;dn=Finding.Bigfoot.S03E15.Peek-A-Boo.Bigfoot.HDTV.x264-tNe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LegendET","files":2,"time":1361783478,"description":"Since I'm going to be leaving soon, there is a couple things\nI want to get off my chest that I think everyone should be\naware of...\n\nThe 5 Key Rules of Peer2Peer and torrents:\n\n- Users must seed back to a ratio of at least 1.5:1. Only\n1:1 does not keep the file going as only about 90% of\nwhat was seeded was healthy, usable data to others.\n\n- Users must know how to rename a file. Not everything is\ngoing to be named how one likes as different people go by\ndifferent television episode guides. Instead of complaining\nabout a filename be grateful you have the new release, and\nrename the file to ones own liking.\n\n- Users must have patience. Not everything is going to be\nreleased instantaneously. Cappers are NOT machines, they\nare real people with real lives; jobs; families; other\nthings far more important the a crowd of whining ingrates.\nBe grateful things become available at all.\n\n- Users must know how to convert file format. Not everything\nwill be released in the format of choice. So, instead of\nsitting on hold waiting for someone to release a copy in\nthe preferred format, learn how to convert media to that\nformat for ones own self. If one took the time to learn how\nto use torrents, then take a little more time time to learn\nhow to convert formats.\n\n- If users can't do any one of the above mentioned and cannot\nlearn something new then they do not belong in p2p networks.\n\n\nAdditional Notes of Peer2Peer and torrenting:\n\n- Regarding RAR files that we get from scene. Disgusted and\ntired of so many complaints about it from users yet they\nhave no idea why it is used. There have been a couple users\nattempting to explain the reason for them, but no one has\nbeen correct.\n\nIt should be common sense, but will spell it out now...\n\nIt is impossible to upload an incomplete file. It would\nhave to be written over again with each bit of progress.\nThe RAR files are so that completed parts can upload while\nthe recording and encoding is still going. The RAR files\nare how users can get some shows so fast after airing.\nI mean really fast. Within 10 minutes after airing. And\nthat's when it reaches Peer2Peer, the bottome of the sharing\nprocess. The actual release was probably only 2 minutes\nafter air.\n\nNow, if users could be so kind and please quit all that\nobnoxious, uneducated complaining, that'd be fantastic.\n\nSpread the word and educate others.","torrent":{"xt":"urn:btih:403c259ef4fefd9c1ee61712fe59ee17c451ab9c","amp;dn":"Finding.Bigfoot.S03E15.Peek-A-Boo.Bigfoot.HDTV.x264-tNe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"403c259ef4fefd9c1ee61712fe59ee17c451ab9c","infoHashBuffer":{"type":"Buffer","data":[64,60,37,158,244,254,253,156,30,230,23,18,254,89,238,23,196,81,171,156]},"announce":[],"urlList":[]}}