{"title":"Made on Earth What we wear. Where it comes from. Where it goes b","uid":9485772,"size":369220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:429cff884e9ae5032c6f9b22854c3a92daf400d1&amp;dn=Made+on+Earth+What+we+wear.+Where+it+comes+from.+Where+it+goes+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":-1,"time":1389885308,"description":" How does a piece of clothing end up in your wardrobe? Where does it come from, and where does it go? This is not just a story about manufacturing. This is a story about people, their livelihoods and their life expectations. This is the story of globalisation. Made on Earth follows the incredible journey of a red fleece manufactured in Bangladesh. From the initial order through to shipping, recycling, and eventually landfill, Made on Earth explores how one single item can connect so many people's lives. Focusing not just on environmental but ethical trading concerns, Made on Earth ultimately explains and explores the concept of globalisation. Many hard-hitting topics are covered, including factory workers being imprisoned in Chittagong for campaigning for better working conditions, the power of oil rich countries such as the United Arab Emirates, and how the desire for cheap goods in developed countries impacts on the working practices of less developed nations. This book provides a fascinating, accessible and extremely engaging introduction to the complex topic of globalisation.","torrent":{"xt":"urn:btih:429cff884e9ae5032c6f9b22854c3a92daf400d1","amp;dn":"Made+on+Earth+What+we+wear.+Where+it+comes+from.+Where+it+goes+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"429cff884e9ae5032c6f9b22854c3a92daf400d1","infoHashBuffer":{"type":"Buffer","data":[66,156,255,136,78,154,229,3,44,111,155,34,133,76,58,146,218,244,0,209]},"announce":[],"urlList":[]}}