{"title":"Stranded by Alex Kava (ePub Retail)","uid":8694994,"size":1301552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43126b87c9d083cca38f3570ff9ce3e72b19d72d&amp;dn=Stranded+by+Alex+Kava+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TxJag","files":3,"time":1373956064,"description":"New York Times bestselling author Alex Kava returns with another action-packed thriller featuring special agent Maggie O'Dell, who is on the hunt for a &quot;truck stop&quot; serial killer.\n\nTired travelers and weary truckers have stopped at rest areas on the nation's highways for decades to refuel, grab a bite, and maybe get some shut-eye, but one man's rest stop is another's hunting ground. For decades the defenseless, the weary, and the stranded have disappeared along the highways and byways, vanishing without a trace, but these seemingly unconnected incidents are no coincidence, and a madman stalks the freeways.\n\nWhen FBI special agent Maggie O'Dell and her partner, Tully, discover the remains of a young woman in a highway ditch, the one clue left behind is a map that will send Maggie and Tully on a frantic hunt crisscrossing the country to stop a madman before he kills again.\n\nAs the body count rises and Maggie races against the clock to unmask the monster who's terrorizing the nation's highways, she turns to a former foe for help since he seems to know just what the killer's next move will be. As she gets closer to finding the killer, it becomes eerily clear that Maggie is the ultimate target.\n\nFull Retail. ePub and Calibre reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:43126b87c9d083cca38f3570ff9ce3e72b19d72d","amp;dn":"Stranded+by+Alex+Kava+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43126b87c9d083cca38f3570ff9ce3e72b19d72d","infoHashBuffer":{"type":"Buffer","data":[67,18,107,135,201,208,131,204,163,143,53,112,255,156,227,231,43,25,215,45]},"announce":[],"urlList":[]}}