{"title":"3:10 to Yuma (1957)","uid":4932562,"size":734061649,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:43696d5ee475a83e6521917931836ee499838985&amp;dn=3%3A10+to+Yuma+%281957%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":4,"time":1244106084,"description":"3:10 to Yuma (1957)\n\n\n3:10 to Yuma is a 1957 western film starring Glenn Ford and Van Heflin and directed by Delmer Daves. The film was based on the short story by Elmore Leonard. The film was well received on release and is still highly regarded today. In 2007 there was a remake of the film starring Russell Crowe and Christian Bale, and directed by James Mangold.\n\nAfter the head of a band of outlaws is captured, he engages in a battle of wills with a rancher who is hired to take him to stand trial, while the gang also does its best to free its leader.\n\nThe title song, &quot;The 3:10 to Yuma&quot;, was sung by Frankie Laine.\n\nDesperate for money, frontier rancher Van Heflin holds outlaw Glenn Ford at gunpoint, intending to collect the $200 reward. While both men await the train to Yuma that will escort Ford to prison, the cagey outlaw offers Heflin $10,000 if he'll set Ford free. The rest of the film is a sweat-inducing cat-and-mouse game between captive and captor, interrupted with bursts of violence from both Ford's gang (commandeered by Richard Jaeckel) and the vacillating townsfolk. 3:10 to Yuma is one of the best of the character-driven &quot;psychological&quot; westerns of the 1950s. Its only flaw is Ford's unconvincing character turnaround towards the end.\n\nWhen first released in the summer of 1957, the film became popular among audiences and critics alike for its suspenseful nature and sharp black-and-white cinematography. Ford received particular notice for his against-type villainous performance. The following year, 3:10 to Yuma was nominated for the British Academy of Film and Television Arts award for Best Film.\n\nSince its release, the film has become a staple of cable television and has gained an audience of several generations. A critically successful remake was released in 2007.\n\nThe film caused &quot;Yuma&quot; to enter the lexicon of Cuban slang: Yumas is a term for American visitors, while La Yuma is the United States.\n\nIMDB: 7.7/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050086/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050086/&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t","torrent":{"xt":"urn:btih:43696d5ee475a83e6521917931836ee499838985","amp;dn":"3%3A10+to+Yuma+%281957%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43696d5ee475a83e6521917931836ee499838985","infoHashBuffer":{"type":"Buffer","data":[67,105,109,94,228,117,168,62,101,33,145,121,49,131,110,228,153,131,137,133]},"announce":[],"urlList":[]}}