{"title":"YAMAHA Vocaloid v.4 FE 4.2.0 [deepstatus]","uid":12200395,"size":50360763,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:45bd8b863cc1295826d6e44dddd5bc259eb08abf&amp;dn=YAMAHA+Vocaloid+v.4+FE+4.2.0+%5Bdeepstatus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deepstatus","files":1,"time":1438815890,"description":"YAMAHA Vocaloid v.4 FE 4.2.0\n\nThe new engine allows the importation of Vocaloid 2 and Vocaloid 3 vocals, though Vocaloid 2 vocals must have already been imported into Vocaloid 3 for this to work. The new engine includes other features, but not all of them are accessible by Vocaloid 2 and Vocaloid 3 vocals. One of the new features is a &quot;Growl&quot; feature which allows vocals built for Vocaloid 4 to take on a growl-like property in their singing results. Cross-synthesis was also added, allowing the user to switch between two of a character's vocals built for the same language smoothly using a time-varying parameter. This feature is accessible by Vocaloid 3 and Vocaloid 4 vocals, but not Vocaloid 2. Another feature included is Pitch Rendering, which all imported vocals can use. This displays the effective pitch curve on the user interface. Finally, real-time input has been included in this version and is another feature which all vocals can use. VSQX files made for Vocaloid 3 work in Vocaloid 4\n\nchanges comparing to previous (4.1.0) version:\nEnabling/Disabling the Phoneme Protect Settings\nShow the extra user dictionary information\nListing a Job Plugin as a &quot;Job&quot; Menu Item\nSelection History and the Swap Buttons for Control Parameters\nTurning the User Dictionary off\nCombining three or more parts of VOCALOID Tracks\nSorting the VOCALOID Tracks by dragging the mouse\nImport/Export of My Singers setting\nGeneral improvements to stability\n\n*supported language interfaces: english, japanese, korean, spanish, chinese, italian, french, russian, portuguese(Brasil), tagalog (philipino), vietnamese, Indonesian, malaysian, thai.\n\n*over 100 job-plugins from Vocaloidstore and some user-made plugins, you can find them in VocaloidJob Plugins folder after installation\n\n- Windows OS : Windows 8.1, Windows 8, Windows 7(32/64bit)\n\n- CPU: Intel Dual Core CPU\n\n- RAM: 2 GB and more\n\ndon't forget to read readme.txt for other information\nyou have to get voices separately, this is the software only, you can search for voices via audioz or via other resources","torrent":{"xt":"urn:btih:45bd8b863cc1295826d6e44dddd5bc259eb08abf","amp;dn":"YAMAHA+Vocaloid+v.4+FE+4.2.0+%5Bdeepstatus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45bd8b863cc1295826d6e44dddd5bc259eb08abf","infoHashBuffer":{"type":"Buffer","data":[69,189,139,134,60,193,41,88,38,214,228,77,221,213,188,37,158,176,138,191]},"announce":[],"urlList":[]}}