{"title":"Free DVD and HDTV MPEG2 playback codec - DVDPACK.MSI","uid":7909326,"size":391680,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4607a7ff4f2845b35671f3858487a2d8caec4502&amp;dn=Free+DVD+and+HDTV+MPEG2+playback+codec+-+DVDPACK.MSI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProphetZarquon","files":1,"time":1355172547,"description":"This DVD/HDTV MPEG2 codec deciphers CSS protection and enables playback of DVDs and NTSC/ATSC HDTV encoded video on Windows operating systems such as Windows XP and above.\n\nIf your PC has been reinstalled, or you simply don't want to keep bloatware like InterVideo's WinDVD, try using DVDPACK.MSI to allow your Windows PC to decode and playback standard DVD and other MPEG2 video files.\n\nDVDPACK.MSI IS NOT A MEDIA PLAYER APP\n\nYou still need a good video player to display the files, but this simple codec will enable DVD and HDTV decoding for virtually any media player you choose.  I recommend VLC or Media Player Classic, but any video player will do, once you have this file installed.  Windows Media Player will work, but don't ever use that!\n\nOnce again, this is not an app.  Nothing extra will be running on your system after installing.  This is only a codec to enable playback of MPEG2 files.\n\nThere are alternatives available, but most of them require additional unnecessary software to be installed, so I have offered this (now very old file) instead.\n\nIt's only about 382kb including the user friendly Microsoft Installer.  No trojans, spyware or toolbars, just a quick easy solution for DVD playback without loading a bunch of other junk on your poor old PC.\n\nNobody makes any money off DVDPACK.MSI, nor does anyone pay the royalty fees for an MPEG2 CSS license.  If your PC or DVD/BluRay drive originally came with DVD playback software of any kind - even if you chose not to install it - your license fee has already been paid.  If none of your purchases included any DVD playback software, then legally you are limited to private, non-commercial use.  In any event this codec doesn't ask about any of that.  The installer just runs once and it's done.  DVD &amp; HDTV decoding are now enabled for any media player capable of using system codecs.\n\nOnly 382kb.  Less than 1mb system space used after install.","torrent":{"xt":"urn:btih:4607a7ff4f2845b35671f3858487a2d8caec4502","amp;dn":"Free+DVD+and+HDTV+MPEG2+playback+codec+-+DVDPACK.MSI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4607a7ff4f2845b35671f3858487a2d8caec4502","infoHashBuffer":{"type":"Buffer","data":[70,7,167,255,79,40,69,179,86,113,243,133,132,135,162,216,202,236,69,2]},"announce":[],"urlList":[]}}