{"title":"Preparative Chromatography of Fine Chemicals and Pharmaceutical ","uid":11971280,"size":9789436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:463b3fa670ae3938119dfc21c87213a3459d1fda&amp;dn=Preparative+Chromatography+of+Fine+Chemicals+and+Pharmaceutical+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ferdgust","files":1,"time":1432823439,"description":"Preparative Chromatography of Fine Chemicals and Pharmaceutical Agents (Wiley-VCH, 2005).pdf\n\nThis interdisciplinary approach combines the chemistry and engineering involved to describe the conception and improvement of chromatographic processes. The book covers recent developments in preparative chromatographic processes for the separation of &quot;smaller&quot; molecules using standard laboratory equipment as well as the detailed conception of industrial chemical plants. Following an introductory section on the history of chromatography, the current state of research and the design of chromatographic processes, the book goes on to define the general terminology. There then follow sections on solid materials and packed columns process concepts. Final chapters on modeling and determination of model parameters, the design and optimization of preparative chromatographic processes and chromatographic reactors allow for the optimum selection of chromatographic systems. Essential for chemists and engineers working in the chemicals and pharmaceutical industries as well as for food technologies, due to the interdisciplinary nature of these processes","torrent":{"xt":"urn:btih:463b3fa670ae3938119dfc21c87213a3459d1fda","amp;dn":"Preparative+Chromatography+of+Fine+Chemicals+and+Pharmaceutical+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"463b3fa670ae3938119dfc21c87213a3459d1fda","infoHashBuffer":{"type":"Buffer","data":[70,59,63,166,112,174,57,56,17,157,252,33,200,114,19,163,69,157,31,218]},"announce":[],"urlList":[]}}