{"title":"Spacehog - The Chinese Album [1998]","uid":9457874,"size":279945883,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:468f5344d4c2af37960153a433db64ec4d62eb11&amp;dn=Spacehog+-+The+Chinese+Album+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389300893,"description":"Review by Stephen Thomas Erlewine  [-]\n&quot;In the Meantime&quot; was a huge hit, and Resident Alien went gold, but Spacehog's debut earned them no critical respect. At any other time, the group's glitzy revival of Bowie, Roxy and Mott the Hoople would have earned kudos, but it arrived at the height of Brit-pop, when other, more celebrated (and, frankly, better) bands were dominating the media spotlight. So, when it came time to deliver their second record, Spacehog knew they had to make a big splash, and The Chinese Album delivers on that promise. A faux song cycle layered with details and hooks, The Chinese Album is a big album conceptually, but the band doesn't quite have the gravity required to make it the sweeping achievement they desire. That hardly means that the album isn't enjoyable, however. Royston Langdon's mock-Bowie baritone is damn near irresistible, and when they have the right hooks and melodies, the result is a gaudy guilty pleasure. There are quite a few of those moments on The Chinese Album, but the band is occasionally derailed by underdeveloped hooks and ill-fitting humor (their foray into music-hall stumbles). Still, the record illustrates that Spacehog has fashioned their own identity out of their glam influences, and that makes the album an impressive effort, even if it lacks a knockout track like &quot;In the Meantime.&quot; (4/5)","torrent":{"xt":"urn:btih:468f5344d4c2af37960153a433db64ec4d62eb11","amp;dn":"Spacehog+-+The+Chinese+Album+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"468f5344d4c2af37960153a433db64ec4d62eb11","infoHashBuffer":{"type":"Buffer","data":[70,143,83,68,212,194,175,55,150,1,83,164,51,219,100,236,77,98,235,17]},"announce":[],"urlList":[]}}