{"title":"Leisureguy's Guide to Gourmet Shaving: Fifth Edition - Michael H","uid":7417289,"size":1300204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47429c990b172526d8b4b9bf2434f0b72a4b2100&amp;dn=Leisureguy%27s+Guide+to+Gourmet+Shaving%3A+Fifth+Edition+-+Michael+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"23545427","files":-1,"time":1341558835,"description":"This book is considered by /r/wicked_edge to be the most comprehensive beginner's guide to double-edged (DE) shaving available anywhere on the Internet. Didn't see this anywhere, so I thought I'd share.\n\nDRM removed using K4MobiDeDRM 0.4.2 (thanks to ApprenticeAlf!)\n\nStripped and tested with calibre v0.8.58 - it works.\n\n\nTitle: Leisureguy's Guide to Gourmet Shaving\n\nAuthor: Michael Ham (Leisureguy)\n\nFormat: .mobi\n\nPublication Date: August 31, 2011\n\nLength: 142 pages\n\nLanguage: English\n\nASIN: B005UHA12K\n\nDescription:\n\nThe fifth edition of the complete beginner's guide to traditional wetshaving---brush, shaving cream or soap, and safety razor with double-edged blade. Traditional shaving is enjoyable and thrifty: double-edged blades are as low as 9Â¢ each vs. as much as $3.50 for a single disposable multiblade cartridge.\n\nThe multiblade cartridge's tug-and-cut action often results in skin irritation, razor bumps, in-grown hairs, and razor burn---thus all the &quot;protective&quot; shaving preparations and &quot;soothing and healing&quot; aftershaves now offered. Most men with skin problems decide that they have &quot;sensitive skin&quot; and never realize that the problem is the multiblade cartridge with its tug-and-cut action, exacerbated by shavers pressing down hard to try to extend the life of the (expensive) cartridge.\n\nThe book includes a chapter on shaving and skin problems, including information on how to cure and prevent razor bumps and in-grown whiskers.\n\nThe book is complete in itself, but it also includes links to a host of resources on the Web to complement the book. Sources are provided for all you need to get started.\n\nThe book not only answers the questions novice wetshavers typically ask, it also includes answers to questions they may not think or know to ask\n\nIt's a perfect gift for bar mitzvah, Father's Day, Valentine's Day, and as a birthday or graduation gift for guys---particularly guys who shave almost every day but when they're asked whether they actually enjoy shaving answer, &quot;No.&quot;\n\nTags: wetshaving, shaving, DE, leisureguy, gourmet shaving, 5th edition, 5th","torrent":{"xt":"urn:btih:47429c990b172526d8b4b9bf2434f0b72a4b2100","amp;dn":"Leisureguy%27s+Guide+to+Gourmet+Shaving%3A+Fifth+Edition+-+Michael+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47429c990b172526d8b4b9bf2434f0b72a4b2100","infoHashBuffer":{"type":"Buffer","data":[71,66,156,153,11,23,37,38,216,180,185,191,36,52,240,183,42,75,33,0]},"announce":[],"urlList":[]}}