{"title":"Email Spy Monitor 2008 6.17","uid":4194514,"size":4076932,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:48e4c261f29c91f2fa36d496db510476f6d2bb91&amp;dn=Email+Spy+Monitor+2008+6.17+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Loaiqngrens","files":1,"time":1211142387,"description":"Have you ever wondered what your spouse, kids or employees have been doing on the computer and Internet? Is your spouse engaging in online sexual conversation while you are asleep? Are your kids taking secret chat conversations with an adult stranger? Are your employees emailing your business secret to your competitors? If you DO worry about these issues, you need a spy software. Email Spy Monitor spy software secretly monitors and records all emails opened in popular email clients, such as Microsoft Outlook 2000/XP/2003/2007, Microsoft Outlook Express 5/6, Windows Vista WinMail and IncrediMail. The re-check merchanism can ensure you get the whole super-large emails, and prevent you from getting the same message repeatedly. You can show all messages in Email Spy Monitor directly, export these messages to HTML files in a directory for later analysis, or send a report to your custom email address or FTP server. Everything will be recorded without being detected. It is especially useful for administrators or parents, who need to know what their employees or kids are care and talking about with others. Use your hotkey to unhide it from complete stealth mode and protect the program access by password. Uninstall it easily from the program interface. You can download Email Spy Monitor and take a trial before order to make sure it works for you.","torrent":{"xt":"urn:btih:48e4c261f29c91f2fa36d496db510476f6d2bb91","amp;dn":"Email+Spy+Monitor+2008+6.17+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e4c261f29c91f2fa36d496db510476f6d2bb91","infoHashBuffer":{"type":"Buffer","data":[72,228,194,97,242,156,145,242,250,54,212,150,219,81,4,118,246,210,187,145]},"announce":[],"urlList":[]}}