{"title":"Chris Smither - Up On The Lowdown","uid":5276113,"size":261294511,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48e53e2d41c7eb0dfc142fd10eb6620d36e27ee1&amp;dn=Chris+Smither+-+Up+On+The+Lowdown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":11,"time":1263342987,"description":"\nAll songs written by Chris Smither except &quot;What Was It You Wanted&quot; (Bob Dylan), &quot;Talk Memphis&quot; (Jesse Winchester) and &quot;Jailhouse Blues&quot; (traditional).\nOn 1993's HAPPIER BLUE Smither returned to the full-band recording approach after more than 20 years. While that album's production proved a little too genteel for Smither's earthy blues-folk style, it set the stage for '95's UP ON THE LOWDOWN, arguably the finest recording of Smither's long career. Perfectly produced by guitarist Stephen Bruton, the album wisely focuses on a tougher, leaner small-band sound than its predecessor. The arrangements have just the right combination of bluesiness and delicacy to complement both Smither's Mississippi John Hurt leanings and his more lyrical side. As always, Smither's the master of redefinition, tackling Dylan's &quot;What Was It You Wanted&quot; and Jesse Winchester's &quot;Talk Memphis&quot; successfully. His compositional muse is also at its apex here, as on the introspective &quot;I Am The Ride&quot; and the elegant, bittersweet &quot;'Deed I Do.&quot;\n\nRecorded at The Hit Shack, Austin, Texas in December 1994.\n\nPersonnel: Chris Smither (vocals, guitar); Stephen Bruton (guitar, electric guitar); Riley Osbourne (harmonica, keyboards); Mickey Raphael (harmonica); Chris Maresh (acoustic bass); Brannen Temple (drums).\nCDUniverse","torrent":{"xt":"urn:btih:48e53e2d41c7eb0dfc142fd10eb6620d36e27ee1","amp;dn":"Chris+Smither+-+Up+On+The+Lowdown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e53e2d41c7eb0dfc142fd10eb6620d36e27ee1","infoHashBuffer":{"type":"Buffer","data":[72,229,62,45,65,199,235,13,252,20,47,209,14,182,98,13,54,226,126,225]},"announce":[],"urlList":[]}}