{"title":"Talking Tom 2 v2.21 +  SD DATA Android","uid":8031695,"size":50337355,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:4b349f31571d2809c6683ee56d51c437e37757a0&amp;dn=Talking+Tom+2+v2.21+%2B++SD+DATA+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".Waledac.","files":929,"time":1358433978,"description":"Copy the file com.outfit7.talkingtom2 to /Android/data\n\nInstall the apk\n\nThats all. \n\n\n\n\n\n\n??? EPIC NEW FEATURES ???\n? You can now customize Tom's appearance by buying him accessories like soccer uniforms, hats, sunglasses and lots more.\n? Make Tom look like a police officer, pirate, construction worker or a cowboy.\n? You can shop for accessories with gold coins. You can buy gold coins or get them for free.\n? You get 25 gold coins if you open the app every day.\n? You get 200 gold coins for every push notification you receive. Make sure you subscribe to push notifications!\n\nPLEASE NOTE: When running the app for the first time you will be required to download additional 5-39 MB to get the best graphics quality for your device.\n\nTom is back with an all new adventure! Tom is your cat that responds to your touch and repeats everything you say in a funny voice.\n\nSince Tom is now an international celebrity, he's moved out of the alley and into a cool apartment.\n\nBut everything is not perfect for Tom, his neighbour Ben teases and pesters him constantly.\n\n??? HOW TO PLAY ???\n? Talk to Tom and he will repeat everything you say with a funny voice.\n? Pet Tom's belly or head and make him purr.\n? Poke his head, belly or feet.\n? Slap Tom's face left and right.\n? Pull or touch his tail.\n? Press the fart button to see Ben fart and Tom grab his nose in disgust. After that Tom repeats what you say with his nose closed for a while.\n? Press the bag button to make Ben pop a paper bag and scare Tom. It's hilarious.\n? Press the phone button to make Tom play with the original Talking Tom app and repeat after himself in a funny loop.\n? Press the feathers button to see Ben hit Tom with a pillow.\n? Press the ? button to make Tom pull random items from behind his back.\n? Shop &amp; equip Tom with awesome accessories by pressing the coat hanger button.\n? Record and share videos on YouTube, Facebook or send them by email or MMS.\n\nYou can sell back any of Tom's accessories at 50% the purchasing price if you press and hold the recycle button on the purchasing screen.\n\nEnjoy hours of fun and laughter with Tom.","torrent":{"xt":"urn:btih:4b349f31571d2809c6683ee56d51c437e37757a0","amp;dn":"Talking+Tom+2+v2.21+%2B++SD+DATA+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b349f31571d2809c6683ee56d51c437e37757a0","infoHashBuffer":{"type":"Buffer","data":[75,52,159,49,87,29,40,9,198,104,62,229,109,81,196,55,227,119,87,160]},"announce":[],"urlList":[]}}