{"title":"Wicked As She Seems (US) (1994)","uid":13977298,"size":415856363,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4bf59f561ba6520d6c94775156dd9ddb27a36cf8&amp;dn=Wicked+As+She+Seems+%28US%29+%281994%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"distinc","files":1,"time":1458658332,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=1262459979\r\n \nhttp://imagedisco.net/?g=386521337\r\n\r\n\r\n\r\nDescription:\r\n\r\n\r\nIt's just what you wanted. Wicked's wildy wanton star Chasey is back, and she's here to show you how it's done. In three blistering scenes she'll demonstrate the talents that have made her adult's hottest star. And that's not all! Check out the incredible D.P. and raunchy anal that have made Wicked legendary! It's all here. Wicked as She Seems - it's as wicked as it gets!\r\n\r\n\r\n\r\nSince Paul Norman's recent features haven't even made the pretense of following through on plot, it came as no surprise that Wicked As She Seems would drop the ball as well -- though it's six carnal encounters garner high points for erotic action.  Casting T.T. Boy against type, we find him as a shy racquetball instructor smitten with the high-priced call-girl Chasey Lain (most assuredly not cast against type). Whether delving into a sultry tease/three-way with clients Tom Byron and Peter North (excellent doggie from Tom as she devours Peter's raw meat) or satisfying her girlfriend Kaylan Nicole (an actual liver &amp; onions rubdown precedes their cheek-smacking, ass licking kitchen table session), the original wicked woman (Lain) is making early inroads for performer of the year!  In a clever -- not to mention utterly arousing -- fantasy sequence, Lain crawls across the racquetball court, squishing her delicious naked form against the protective glass while T.T.'s clamshovel jaw drops in amazement.  (All that's missing from Tex Avery-ish reaction is steam shooting out of his ears.)  The court also plays host to a heated scenario between Tiffany Mynx and Cody Adams... the rebounding echoes and sneaker squeaks reinforce a highly vociferous anal tryst which, though lacking an intial penetration shot, contains invigorating hardcore ball slamming.  Though Lain is the centerpiece, it would be criminal not to mention earthy Kaitlyn Ashley, whose natural (well, the bod's natural, not her bottled blonde hair) looks and voracious appetite light up a fabulous ass-fingering/initial penetration shot/double facial d.p. scene with Nick East and Jay Ashley.  Separate or tage team, Lain and Ashley are superlative!","torrent":{"xt":"urn:btih:4bf59f561ba6520d6c94775156dd9ddb27a36cf8","amp;dn":"Wicked+As+She+Seems+%28US%29+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf59f561ba6520d6c94775156dd9ddb27a36cf8","infoHashBuffer":{"type":"Buffer","data":[75,245,159,86,27,166,82,13,108,148,119,81,86,221,157,219,39,163,108,248]},"announce":[],"urlList":[]}}