{"title":"The Fall of Rome and the Birth of Europe   (2010 - epub)","uid":6973901,"size":4467202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ca97788e897a21c9aa289f59c530efeeb583224&amp;dn=The+Fall+of+Rome+and+the+Birth+of+Europe+++%282010+-+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":2,"time":1327177309,"description":"Here is a fresh, provocative look at how a recognizable Europe came into being in the first millennium AD. With sharp analytic insight, Peter Heather explores the dynamics of migration and social and economic interaction that changed two vastly different worlds--the undeveloped barbarian world and the sophisticated Roman Empire--into remarkably similar societies and states. The book's vivid narrative begins at the time of Christ, when the Mediterranean circle, newly united under the Romans, hosted a politically sophisticated, economically advanced, and culturally developed civilization--one with philosophy, banking, professional armies, literature, stunning architecture, even garbage collection. The rest of Europe, meanwhile, was home to subsistence farmers living in small groups, dominated largely by Germanic speakers. Although having some iron tools and weapons, these mostly illiterate peoples worked mainly in wood and never built in stone. The farther east one went, the simpler it became: fewer iron tools and ever less productive economies. And yet ten centuries later, from the Atlantic to the Urals, the European world had turned. Slavic speakers had largely superseded Germanic speakers in central and Eastern Europe, literacy was growing, Christianity had spread, and most fundamentally, Mediterranean supremacy was broken. The emergence of larger and stronger states in the north and east had, by the year 1000, brought patterns of human organization into much greater homogeneity across the continent. Barbarian Europe was barbarian no longer. Bringing the whole of first millennium European history together for the first time, and challenging current arguments that migration played but a tiny role in this unfolding narrative, Empires and Barbarians views the destruction of the ancient world order in the light of modern migration and globalization patterns. The result is a compelling, nuanced, and integrated view of how the foundations of modern Europe were laid.\n\nOxford 2010","torrent":{"xt":"urn:btih:4ca97788e897a21c9aa289f59c530efeeb583224","amp;dn":"The+Fall+of+Rome+and+the+Birth+of+Europe+++%282010+-+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ca97788e897a21c9aa289f59c530efeeb583224","infoHashBuffer":{"type":"Buffer","data":[76,169,119,136,232,151,162,28,154,162,137,245,156,83,14,254,235,88,50,36]},"announce":[],"urlList":[]}}