{"title":"AVS Video Converter 8.4.1.540 Incl Patch (MPT) - KurdTM","uid":8677072,"size":63859045,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d5eb8f18acc7df032305c1f66bc483a4353f4d4&amp;dn=AVS+Video+Converter+8.4.1.540+Incl+Patch+%28MPT%29+-+KurdTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KurdTM","files":-1,"time":1373622780,"description":"AVS Video Converter 8.4.1.540 Incl Patch (MPT) - KurdTM\n\n\nAVS Video Converter - program with advanced capabilities, all in one, converter, burn VCD, SVCD, DVD, an advanced video editor. A key feature of it is: converter AVI, MPEG, WMV, DVD video to AVI, MPEG, WMV, RM formats, burning DVD, SVCD or VCD, package converting, editing, video overlay effects and filters, extracting audio from video and save in a separate audio file, extract a frame (frame) and save as image, splitting into segments and connect video, video rotation, adding to the form of text, banners, logos, selection and codec setting for conversion, support: AVI (DivX, XviD, MS MPEG4, Uncompressed , Cinepak), MPEG (MPEG-1 and MPEG-2 Video), VOB (Video DVD, PAL and NTSC), WMV (Windows Media Video), RM (Real Networks Video), MOV (Quick Time) and other formats.\n\nFeatures:\n* Conversion of the minimum time to support multi-threaded conversion to multi-core processors.\n* Create a DVD-video: create DVD-video from all supported formats. Templates menu there. See the result on your home player DVD.\n* Support for HD-video: HD-core supported formats: AVCHD, MPEG-2 HD, WMV HD, TOD, MOD, M2TS, M2T, MTS, HDV. You can edit, combine, cut pieces, add text and effects, and convert to DVD or any other supported video format.\n* The video for mobile devices: iPod, iPhone, PSP, Zen, PS3 (HD support), XBox (HD support), Archos, telephones, DVD/MPEG-4 Player (with support DivX / Xvid).\n* The video for the Website: Flash SWF, Real Video and WMV video\n* Copying video discs\n* Extract audio tracks from video, save individual frames as screenshots\n* Edit quickly and precisely with the line of time, use more than 50 audio and video effects for movies.\n* Support batch mode\n\nHome Page - http://www.avs4you.com/\n","torrent":{"xt":"urn:btih:4d5eb8f18acc7df032305c1f66bc483a4353f4d4","amp;dn":"AVS+Video+Converter+8.4.1.540+Incl+Patch+%28MPT%29+-+KurdTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d5eb8f18acc7df032305c1f66bc483a4353f4d4","infoHashBuffer":{"type":"Buffer","data":[77,94,184,241,138,204,125,240,50,48,92,31,102,188,72,58,67,83,244,212]},"announce":[],"urlList":[]}}