{"title":"Water - The Shocking Truth That Can Save Your Life (Malestrom)","uid":4847049,"size":6369478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d6055fb5087aaac450a4ed712f2691545e6dc39&amp;dn=Water+-+The+Shocking+Truth+That+Can+Save+Your+Life+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239726024,"description":" &lt;a href=&quot;http://www.image-upload.net/images/ef8z5ilxe2aq0xrig02b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/ef8z5ilxe2aq0xrig02b.jpg&lt;/a&gt;\n\nNext to oxygen, water is the most important substance in the body. The average adult body contains approximately 45 pints of water and excretes about 32 pints daily through perspiration, respiration, urine and defecation. The internal temperature of the body is controlled with water. The average body temperature is 98.6o Fahrenheit. If it rises above this temperature we become feverish. If it falls below, we are physically affected. Water makes up 92% of the blood in the body and nearly 98% of intestinal, gastric, saliva and pancreatic juices. Many people have a dehydrated appearance. Their skin looks parched, withered, dry and old. Look at the dry and withered hands of many people. Look at the wrinkles on their foreheads and around their eyes. See how a curtain of dry flesh hangs over their eyes. Such people seem to squint out of little eye slits to see.\n\nMany people are chronically constipated, another sign of dehydration. Many people suffer from burning, irritating urination, which is also a sign of water starvation.\n\nInorganic Salt is a Health Wrecker Another side of water imbalance is due to the excess use of inorganic salt and salty foods, which leads to the waterlogged human. You see young children 7 to 10 or more years old who are so waterlogged that they look grotesque. Some of these children have bloated and middle aged-looking bodies. Just compare them to the adults with their bloated and puffed-up faces, arms, bellies, legs, ankles and feet.\n\nThe amount of water a body needs depends on temperature, climate, one's activities and general health. When you drink a glass of water it goes directly to your stomach. Part of the water is absorbed directly into your bloodstream through the walls of your stomach. The remainder goes to your intestines to keep the food you eat in a liquid state while it is being absorbed; this water is later absorbed directly into the blood.\n\nDrinking the right kind of water is one of your best natural protections against all kinds of virus infections, such as influenza, pneumonia, whooping cough, measles and other infectious diseases.\n\nDoctors advise bed-rest and plenty of water for the flu. When the body tissues and cells are kept well supplied with the correct amount of water, they can fight off viral attacks. If the body's cells are water-starved, they become parched, dry and shrivel, making it easy for viruses to attack.\n\nAlways bear in mind the important functions of the right kind of water in your body. Water is a vital component of all body fluids, tissues, cells, lymph, blood and glandular secretions. Water holds all nutritive factors in solution and acts as a transportation medium to the various parts of the body for these substances. The mucous membranes need plenty of water to keep them soft and free from friction on their delicate surfaces. Liquid is necessary for the proper digestion of food. The stomach acts as a powerful churn to break down food into small particles.\n\nWater Flushes Toxins Out of the Body One of the most important functions of water is to flush the toxins and salt from the body. Unfortunately, people the world over use large amounts of salt. From centuries ago to the present day, there have been countries that have never known what salt is and whose people were still healthy and happy.\n\nThe Japanese are known to be the world's highest consumers of table or inorganic salt (sodium chloride). A Japanese farmer who lives to be 60 years of age eats approximately 2 ounces of salt every day of his life and filters through his kidneys 2,737.5 pounds or 1.36 tons of salt in his lifetime!\n\nAmericans are not far behind the Japanese in the consumption of salt. Not only do Americans add plenty of salt to their foods, they also eat large amounts of salty foods including ham, bacon, hot dogs, luncheon meats, corned beef, potato chips, salted nuts and many other foods with high concentrations of salt. No wonder heart disease is the # 1 killer in America!","torrent":{"xt":"urn:btih:4d6055fb5087aaac450a4ed712f2691545e6dc39","amp;dn":"Water+-+The+Shocking+Truth+That+Can+Save+Your+Life+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d6055fb5087aaac450a4ed712f2691545e6dc39","infoHashBuffer":{"type":"Buffer","data":[77,96,85,251,80,135,170,172,69,10,78,215,18,242,105,21,69,230,220,57]},"announce":[],"urlList":[]}}