{"title":"The Book of GIMP","uid":9614544,"size":67276675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e3dc25fa6c340e6ee3b47d4a1c9dbba70349f32&amp;dn=The+Book+of+GIMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iv0live","files":-1,"time":1392395914,"description":"The Book of GIMP: A Complete Guide to Nearly Everything \n\nOlivier Lecarme &amp; Karine Delvare\nNo Starch Press\n2013\nEPUB\n\n\nGIMP is a free alternative to Adobe Photoshop with tons of professional-grade features. But with so many powerful tools and menu options, GIMP can be difficult to master. Whether you're struggling to get started or trying to master some of GIMP's more complex features, you'll find the answers you're looking for in The Book of GIMP.\n\nThe tutorials in the first half of the book walk you through essential GIMP skills, like resizing and cropping images, touching up spots and scratches, and customizing your work area. Illustrated, step-by-step instructions show you how to:\n\n    -Improve the lighting and composition of images\n    -Remove distortions and noise to make old and damaged photos look like new\n    -Create stunning panoramas and digital collages using a series of photos\n    -Make, edit, and export custom textures, logos, and animated GIFs\n    -Work with selections, channels, and masks to edit images like a pro\n    -Create colorful digital art, layer by layer\n\nThe book's second half offers a comprehensive reference to GIMP's many features, including color balancing, masks, filters, and plug-ins. You'll find tools described in unparalleled detail, with coverage of nearly every option and parameter.\n\nWith illustrated tutorials and detailed references, The Book of GIMP is sure to become your one-stop guide to just about everything GIMP.\n","torrent":{"xt":"urn:btih:4e3dc25fa6c340e6ee3b47d4a1c9dbba70349f32","amp;dn":"The+Book+of+GIMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e3dc25fa6c340e6ee3b47d4a1c9dbba70349f32","infoHashBuffer":{"type":"Buffer","data":[78,61,194,95,166,195,64,230,238,59,71,212,161,201,219,186,112,52,159,50]},"announce":[],"urlList":[]}}