{"title":"Need for  Hot Pursuit 2","uid":8555466,"size":641241088,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4e56fbe6af339ca049974194d25f0fef8cb5f71d&amp;dn=Need+for++Hot+Pursuit+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"taluqmer","files":-1,"time":1370748310,"description":"Need for Speed: Hot Pursuit 2\n\nAs with the original, the player also has the option to play as a police officer trying to arrest speeders. To do so the player rams the speeding vehicle multiple times to disable it. The player must turn on their lights and sirens while in pursuit, and they automatically turn off after arresting the suspect. Police can call for a road block, spike strips, and request help from a helicopter to assist in chasing the target vehicle. At the end, the player is awarded for the cars busted. In the PlayStation 2 version this mode is called You're the Cop mode while in the PC, Gamecube, and Xbox versions it's Be the Cop mode.\n\nRaces take place in four environments which differ in atmosphere, with a handful of tracks per environment. The different tracks in an environment are formed by different roads being connected or separated by road blocks. A fictional tropical island, reminiscent of Hawaii, is the most varied environment; the track traverses a city, volcano, waterfall, beach, forest, and two villages. The coastal forest environment, reminiscent of the Washington coast, sometimes has foggy weather, but this does not effectively limit visibility during races. The Mediterranean coast and so-called Alpine environments are more homogeneous, with little variation except the occasional short cut. Compared to the original Hot Pursuit, which features weather and day/night variation independent of track, and widely varying environments from snowy mountains over cities to desert, Hot Pursuit 2 tracks have significantly less variation.","torrent":{"xt":"urn:btih:4e56fbe6af339ca049974194d25f0fef8cb5f71d","amp;dn":"Need+for++Hot+Pursuit+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e56fbe6af339ca049974194d25f0fef8cb5f71d","infoHashBuffer":{"type":"Buffer","data":[78,86,251,230,175,51,156,160,73,151,65,148,210,95,15,239,140,181,247,29]},"announce":[],"urlList":[]}}