{"title":"Karmina - Backwards Into Beauty","uid":4275663,"size":52433908,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f6103606061d5347d898b8a7e47920647d650fa&amp;dn=Karmina+-+Backwards+Into+Beauty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"riry","files":11,"time":1215130731,"description":"Pop music charts are often littered with pretenders whose main claim to fame is their daddy&amp;#039;s fortune, their ability to lip sync on cue or the fact that they&amp;#039;ve been successful at acting. By contrast, the music of Karmina -- helmed by sisters Kelly (lead vocals, harmonies, keyboards) and Kamille (lead vocals, harmonies, guitars) -- reminds us that even in pop music there&amp;#039;s no substitute for actual substance. Karmina, which means &quot;song&quot; in Latin, is all about real musicians who possess talent, know-how and determination. Setting themselves apart from these pop wannabees, Kelly and Kamille write, sing, produce and perform music that springs entirely from their own creative designs. \n\nAlthough Kelly and Kamille are only 23 and 21 respectively, they&amp;#039;ve already acquired a good deal of experience and expertise upon which to build a lasting career. They&amp;#039;re one of the first acts signed to the newly inaugurated CBS Records. As evidenced by the songs that encompass their debut album, Backwards into Beauty, and its first single, &quot;The Kiss,&quot; Karmina&amp;#039;s music possesses a soulful, seductive embrace that tugs at the emotions, without sacrificing the hooks, melodies and exuberant sense of fun found in the very best of pop music. Produced by Karmina and Guy Erez, the album features eleven riveting original songs, each extending an instant embrace. \n\nThe title itself, Backwards into Beauty, comes from a lyric in the album&amp;#039;s lead off track, &quot;Satellites,&quot; and it sums up the album&amp;#039;s overall concept. &quot;We&amp;#039;re all constantly trying to find ourselves, and we grow as people through our experiences that&amp;#039;s universal,&quot; Kelly explains. &quot;Most of us feel strange and awkward at some point in our lives, but we can take those unique things about us, make them into something that&amp;#039;s beautiful, and, in turn, express who we are.&quot; \n\n\n01.  Satellites        \n02.  Free              \n03.  The Kiss         \n04.  Inside Of You     \n05.  Sympathy         \n06.  Gone with The Wind\n07.  Stay              \n08.  The Whoa Song     \n09.  Be with You      \n10.  Colorblind        \n11.  Calling You Back ","torrent":{"xt":"urn:btih:4f6103606061d5347d898b8a7e47920647d650fa","amp;dn":"Karmina+-+Backwards+Into+Beauty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6103606061d5347d898b8a7e47920647d650fa","infoHashBuffer":{"type":"Buffer","data":[79,97,3,96,96,97,213,52,125,137,139,138,126,71,146,6,71,214,80,250]},"announce":[],"urlList":[]}}