{"title":"Jason Brennan - Libertarianism: What Everyone Needs to Know","uid":11060687,"size":1800557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f86817f1e65f94c645e60e97340a53e4b43acaf&amp;dn=Jason+Brennan+-+Libertarianism%3A+What+Everyone+Needs+to+Know&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philosophi","files":-1,"time":1411167787,"description":"Historically, Americans have seen libertarians as far outside the mainstream, but with the rise of the Tea Party movement, libertarian principles have risen to the forefront of Republican politics. But libertarianism is more than the philosophy of individual freedom and unfettered markets that Republicans have embraced. Indeed, as Jason Brennan points out, libertarianism is a quite different--and far richer--system of thought than most of us suspect. \nIn this timely new entry in Oxford's acclaimed series What Everyone Needs to Know, Brennan offers a nuanced portrait of libertarianism, proceeding through a series of questions to illuminate the essential elements of libertarianism and the problems the philosophy addresses, including such topics as the Value of Liberty, Human Nature and Ethics, Economic Liberty, Civil Rights, Social Justice and the Poor, Government and Democracy, and Contemporary Politics. Brennan asks the most fundamental and challenging questions: What do Libertarians think liberty is? Do libertarians think everyone should be selfish? Are libertarians just out to protect the interests of big business? What do libertarians think we should do about racial injustice? What would libertarians do about pollution? Are Tea Party activists true libertarians? As he sheds light on libertarian beliefs, Brennan overturns numerous misconceptions. Libertarianism is not about simple-minded paranoia about government, he writes. Rather, it celebrates the ideal of peaceful cooperation among free and equal people. Libertarians believe that the rich always capture political power; they want to minimize the power available to them in order to protect the weak. Brennan argues that libertarians are, in fact, animated by benevolence and a deep concern for the poor. \n\nClear, concise, and incisively written, this volume explains a vitally important philosophy in American history--and a potent force in contemporary politics.","torrent":{"xt":"urn:btih:4f86817f1e65f94c645e60e97340a53e4b43acaf","amp;dn":"Jason+Brennan+-+Libertarianism%3A+What+Everyone+Needs+to+Know","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f86817f1e65f94c645e60e97340a53e4b43acaf","infoHashBuffer":{"type":"Buffer","data":[79,134,129,127,30,101,249,76,100,94,96,233,115,64,165,62,75,67,172,175]},"announce":[],"urlList":[]}}