{"title":"A Flock Of Seagulls - I Ran (Live-Beat Club)  (2nafish)","uid":5227730,"size":130052100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5009aba98c89a1593a9183167a0383d1d99dcaa1&amp;dn=A+Flock+Of+Seagulls+-+I+Ran+%28Live-Beat+Club%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1261196399,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Ran (So Far Away)&quot; (also released as &quot;I Ran&quot;) is a song by English New Wave band A Flock of Seagulls. It was released on their debut album A Flock of Seagulls in 1982 and was its most successful single, reaching number 9 in the United States and number 1 in Australia. Along with the Bowling For Soup cover, it was also used as the theme song for the anime series Knights of the Zodiac which was later canceled during its first season.\n\nThe band toured the United States extensively to promote the single, supporting Squeeze on their 1982 tour. As well as reaching #9 on the Billboard Hot 100, &quot;I Ran&quot; peaked at #3 on the Mainstream Rock chart and #8 on the Hot Dance Club Play chart. Subsequently the album reached number 10 on the Billboard 200.\n\nDespite success in the States and Australia, the single did not enjoy similar success in the band's home country (United Kingdom), failing to make the top 40.\n\nIn an interview on the VH1 special 100 Greatest Songs of the '80s, Mike Score said that he resents the song, but plays it live because people enjoy it. &quot;I Ran&quot; was listed at #55 on the countdown. In VH1's 100 Greatest One-Hit Wonders of the 80s, the song was listed at #2, with Mike Score's interview played again.\n\nAlthough considered an 80's New Wave classic, the song experienced somewhat of a revival in 2002 as the signature theme for the video game Grand Theft Auto: Vice City; being played during the game's television commercials and during gameplay as one of the songs in the playlist for radio station Wave 103.\n\nThe song briefly featured in the Dead Zone Season 2 episode 'Playing God', heard during a party scene.\n\nThe master recording is available as a playable song in Guitar Hero Encore: Rocks the 80s.\n\nA Flock of Seagulls (also known as Flock of Seagulls) are a British Grammy Award winning band originally formed by brothers Mike Score (keyboards, Vocals) and Ali Score (drums), with Frank Maudsley (bass) and Paul Reynolds (guitar). They became notable in the 1980s for their MTV video for the song &quot;I Ran (So Far Away)&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5009aba98c89a1593a9183167a0383d1d99dcaa1","amp;dn":"A+Flock+Of+Seagulls+-+I+Ran+%28Live-Beat+Club%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5009aba98c89a1593a9183167a0383d1d99dcaa1","infoHashBuffer":{"type":"Buffer","data":[80,9,171,169,140,137,161,89,58,145,131,22,122,3,131,209,217,157,202,161]},"announce":[],"urlList":[]}}