{"title":"Blood II: The Chosen","uid":12003022,"size":803250841,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5097b2f3083bc9d098f148540c565673a2e9977e&amp;dn=Blood+II%3A+The+Chosen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MADJACKTHEPISSEDPIRATE","files":4,"time":1433816368,"description":"THIS IS AN OLD 1998 GAME  THE GRAPHICS ROCKED BACK THEN...DONT EXPECT ANYTHING MUCH NOW . THE GAME WAS  FUN FOR 98....IF YOU WANT NIGHTMARE LEVELS SOONER THAN I PLAN TO UPLOAD THEM LET ME KNOW. \n\nPLEASE SEED THIS AT LEAST 1. SHARE SO THE PEEPS WHO WANT THIS CAN GET IT FOR THE FIRST FEW DAYS AT LEAST. WIITHOUT A LONG WAIT BY MY 100KBPS UPLOAD RATE. THANK YOU I APPRECIATE IT\n\nLIKE CYBERMAGE IN 05 I ARCHIVED MY DISKS TO IMAGE FILE USING CLONE CD..SO YOU WILL PROLLY HAVE TO USE THAT TO BURN THE IMAGE TO A CD if power iso or daemon dont work\n\nMADJACK IS NOT RESPONSIBLE FOR ANY PROBLEMS YOU MIGHT HAVE WITH THIS TORRENT...THIS IS A WIN 95 98 GAME AS I RECALL.\n\nI HAVENT GOTTEN ANY FEEDBACK AS TO WETHER YOU  PIRATES HAVE HAD ANY PROBLEMS GETTING THESE GAMES TO RUN....SO I ASSUME MY DECADE OLD IMAGE FILED GAME HARD DRIVE IS STILL OPTIMAL....LET ME KNOW IF YOU DO HAVE ANY CORRUPTIONS...CAUSE I HAVE THE DISCS...NEVER ISO ED A DISC MYSELF SO....\n\n\n\nBlood II: The Chosen is a first-person shooter computer game developed by Monolith Productions and distributed by GT Interactive. Unlike the first installment, Blood, which was set in 1928, it takes place in the year 2028, so in addition to conventional weapons and magical items also incorporates science-fictional technology. Much like its predecessor, the game contains excessive graphic violence and black humor.\n\n\nBlood II: The Chosen was developed by Monolith Productions and featured Monolith's new fully 3D engine Lithtech, which was previously used in Shogo: Mobile Armor Division. The game was released on October 31, 1998 by GT Interactive, which was later purchased by Infogrames. An official expansion pack was released on August, 1999 under the title of Blood II: The Chosen - The Nightmare Levels.\n\n\n\nIn single player mode the player can choose their character among one of the four Chosen. However major plot holes occur if any other character than Caleb is selected: in-game cinematics are not shown and the story does not develop properly.[citation needed] Blood II gameplay is influenced by the choice of character at the start of the game because every Chosen has different marksmanship abilities, amount of maximum hit points and armor level. Caleb, the protagonist of the first Blood, is the most balanced character, being able to use both firearms and magical means with good efficiency","torrent":{"xt":"urn:btih:5097b2f3083bc9d098f148540c565673a2e9977e","amp;dn":"Blood+II%3A+The+Chosen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5097b2f3083bc9d098f148540c565673a2e9977e","infoHashBuffer":{"type":"Buffer","data":[80,151,178,243,8,59,201,208,152,241,72,84,12,86,86,115,162,233,151,126]},"announce":[],"urlList":[]}}