{"title":"The Persona Lifecycle  (ePUB,Retail) {32Skulls}","uid":10841289,"size":34380699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51e6e0f07a6b7d2a8fb1cfea0c16521a27b76269&amp;dn=The+Persona+Lifecycle++%28ePUB%2CRetail%29+%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"32Skulls","files":-1,"time":1408743199,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\n\nIf you design and develop products for people, this book is for you. The Persona Lifecycle addresses the &quot;how&quot; of creating effective personas and using those personas to design products that people love. It doesn't just describe the value of personas; it offers detailed techniques and tools related to planning, creating, communicating, and using personas to create great product designs. Moreover, it provides rich examples, samples, and illustrations to imitate and model. Perhaps most importantly, it positions personas not as a panacea, but as a method used to complement other user-centered design (UCD) techniques including scenario-based design, cognitive walkthroughs and user testing.\n\nJohn Pruitt is the User Research Manager for the Tablet &amp; Mobile PC Division at Microsoft Corporation. Tamara Adlin is a Customer Experience Manager atFor the past six years, John and Tamara have been researching and using personas, leading workshops, and teaching courses at professional conferences and universities. They developed the Persona Lifecycle model to communicate the value and practical application of personas to product design and development professionals.\n\nFeatures\n\nPresentation and discussion of the complete lifecycle of personas, to guide the designer at each stage of product development.\nA running case study with rich examples and samples that demonstrate how personas can be used in building a product end-to-end.\nRecommended best practices in techniques, tools, and innovative methods.\nHundreds of relevant stories, commentary, opinions, and case studies from user experience professionals across a variety of domains and industries.\n\n\n\nBy John Pruitt, Tamara Adlin\nPublished by Elsevier in 2010\nEPUB, Retail, 744 pages, English","torrent":{"xt":"urn:btih:51e6e0f07a6b7d2a8fb1cfea0c16521a27b76269","amp;dn":"The+Persona+Lifecycle++%28ePUB%2CRetail%29+%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51e6e0f07a6b7d2a8fb1cfea0c16521a27b76269","infoHashBuffer":{"type":"Buffer","data":[81,230,224,240,122,107,125,42,143,177,207,234,12,22,82,26,39,183,98,105]},"announce":[],"urlList":[]}}