{"title":"Reheated Lio - A Delicious Lio Collection Ready to Devour ","uid":8654539,"size":171158277,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:52ba04d3923451bc99142bf98f1d5cf8fa9114cf&amp;dn=Reheated+Lio+-+A+Delicious+Lio+Collection+Ready+to+Devour+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1373184240,"description":"'Reheated Lio - A Delicious Lio Collection Ready to Devour'\n\nAndrews McMeel Publishing, 2011, 128 pages\n\nWritten and Illustrated by Mark Tatulli\n\nEmmy award-winning artist Mark Tatulli's comic strip, Lio, is dark, twisted, visually stunning and totally irresistible.\n\nDistinguished by Variety as &quot;a fast riser,&quot; Mark Tatulli's morbidly mirthful comic strip Lio proves that happiness is indeed a modified Snuggie for you and your favorite eight-armed cephalopod. Reheated Lio, the fourth Lio cartoon collection, includes 40 weeks of color Sunday strips as well as black-and-white daily strips.\n\nDrawn in the style of cartooning greats Gahan Wilson, Charles Addams, and 19th-century satirist A. J. Volck, Lio is a pantomime strip that tells its story without any dialogue or cartoon captions. Fans of Lio recognize the spiky-haired ghostly pale youngster as a curious scientist, a comic-book fan, the defender of the defenseless, and the creator of a legion of zombie bunnies, flanked by his creepy coterie of friends, including giant squid Ishmael and the scythe-carrying grim reaper.\n\nInside Reheated Lio, readers learn how Mr. Sneaky's Jokes and Gags can make archery practice more fun, along with the many uses of spiders - including their essential roles in Girl Scout cookie procurement and as a quality pizza condiment. Cozy up to your favorite Snuggied cephalopod with Reheated Lio.","torrent":{"xt":"urn:btih:52ba04d3923451bc99142bf98f1d5cf8fa9114cf","amp;dn":"Reheated+Lio+-+A+Delicious+Lio+Collection+Ready+to+Devour+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52ba04d3923451bc99142bf98f1d5cf8fa9114cf","infoHashBuffer":{"type":"Buffer","data":[82,186,4,211,146,52,81,188,153,20,43,249,143,29,92,248,250,145,20,207]},"announce":[],"urlList":[]}}