{"title":"TechSmith Snagit 11.0.0 Build 207 (2012) English","uid":7307468,"size":66281848,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:535db4746469e071649a1d097255ed40b6c500d2&amp;dn=TechSmith+Snagit+11.0.0+Build+207+%282012%29+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spirebyte","files":-1,"time":1338242695,"description":"Name: TechSmith Snagit 11.0.0 Build 207\nYear: 2012\nPlatform: Windows All\nLanguage: English\n\n\nOperating system: Windows XP/Vista/7\nProcessor: Pentium III 1 GHz or higher\nMemory: 512 MB or higher\nVideo: 32-bit, 1280x800\nFree space on HDD: 150 MB\n\nDescription:\nSnagIt - a program for taking screenshots from the monitor screen, and SnagIt can do not just static graphic &quot;snapshots&quot; of the selected area, but also, for example, record a video in what is happening on the screen, and capture an image of the applications that use Direct X, DirectDraw and Direct 3D. Built-in editor lets you add annotations to the screenshot, a description, something emphasized the need to insert at the right place, for example, arrow, etc. In addition, the program allows you to &quot;pull&quot; the text from where he does not move with the Copy / Paste.\n\nWhat's new:\nImproved video capture.\nAdded MP4 support for video output.\nAdded spell checking to callouts and text capture.\nAdded Camtasia Studio output, Screencast.com output, and YouTube output to the default install.\nImproved scrolling capture support for Google Chrome.\nAdded more increments to the zoom slider in editor.\nAdded support for working in natural units (inches and centimeters) for image sizing.\nRestricted the use of GIF and 256-color image files to only during opening and saving.\nAdded an option to prevent automatically saving captures.\nImproved Snagit's performance, particularly for images with transparency.\nRemoved support for several file formats including. Msp,. Cal,. Pcx,. Raw, etc.\nRemoved the ability to capture full screen DOS windows.\nRemoved the ability to capture icons from. Exe and. Dll files.\nRemoved the &quot;Create Web Page&quot; feature.\nRemoved the Web Capture mode.\nRemoved the ability to capture from DirectX applications.\nRemoved various region capture options including capturing triangle region, a rounded rectangle region, an ellipse region, etc.\nFixed several problems where security software interfered with Snagit's installation and functionality.\nFixed a bug where upgrading to a new version of Snagit required restarting Internet Explorer.\nFixed a bug where moving saved. Snag files to new directories caused the files to become corrupted.\nFixed a crash bug that would occur when using the perspective / shear effect.\n\ninstallation:\n\n1. Install Snagit\n\n2. Use the keygen to register\n\n3. Enjoy &gt;:)","torrent":{"xt":"urn:btih:535db4746469e071649a1d097255ed40b6c500d2","amp;dn":"TechSmith+Snagit+11.0.0+Build+207+%282012%29+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535db4746469e071649a1d097255ed40b6c500d2","infoHashBuffer":{"type":"Buffer","data":[83,93,180,116,100,105,224,113,100,154,29,9,114,85,237,64,182,197,0,210]},"announce":[],"urlList":[]}}