{"title":"A Tribute to Theodorakis the Troubadour from Greece (1990)","uid":6069969,"size":67995262,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:55064662d897c2f3ab3af91ad23b196a4a6c8864&amp;dn=A+Tribute+to+Theodorakis+the+Troubadour+from+Greece+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1293570271,"description":"This is a great album for everyone who loves the music of Mikis Theodorakis and Maria Farantouri or Yorgos Kapernaros.\n\n\n\nA review of this album found on Amazon.com:\n\nNewtime fans or longtime admirers of this great artist who do not know this album yet should not hesitate another second but buy it immediately! Do not be fooled by the tacky title, the cheap look, the mistakes on the cover or the low price. This is an absolute gem! Apart from the inevitable Zorba track this album consists of a recording made in 1966 when Theodorakis was on tour in Europe. I am not sure but I believe the recording took place in Holland or Belgium, eitherway it sounds fantastic.\n\nNine of the songs are sung by Maria Farantouri, then still a teenager who brings youthfull freshness as well as a timeless emotional depth to the music. Listen to her singing Sto Perigiali, tou Mikrou Voria, Rodostamo and especially Aprilis. You wont find a more beautiful rendition of that song anywhere (or the others for that matter).\n\nYorgos Kapernaros is convincing in his 3 uptempo songs. The ensemble features Yiannis Didilis on piano and Lakis Karnezis and Costas Papdopoulos as bououki soloists who add extra appeal to this album with brilliant and inventive playing. Theodorakis himself is conducting.\n\nI have been listening to this album for over 30 years now and it honestly hasn\\'t bored me once.","torrent":{"xt":"urn:btih:55064662d897c2f3ab3af91ad23b196a4a6c8864","amp;dn":"A+Tribute+to+Theodorakis+the+Troubadour+from+Greece+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55064662d897c2f3ab3af91ad23b196a4a6c8864","infoHashBuffer":{"type":"Buffer","data":[85,6,70,98,216,151,194,243,171,58,249,26,210,59,25,106,74,108,136,100]},"announce":[],"urlList":[]}}