{"title":"American_Top_40_1977_August_13th","uid":10761679,"size":363399119,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:55aa5e1af0d17aa21aecaa69df6690b77a014db0&amp;dn=American_Top_40_1977_August_13th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1407982544,"description":"&quot;From the Florida Everglades to the California Redwoods, you hear the nation's top hits every week at this time on American Top 40. My name is Casey Kasem and the countdown rolls on.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nWritten by Neil Diamond and performed by Glen Campbell, &quot;Sunflower&quot; is at number 40.\n\nWritten by Beachboy Brian Wilson as an attempt to capture the essence of &quot;Be My Baby&quot; (by the Ronettes), B.J. Thomas is at number 36 with &quot;Don't Worry Baby&quot; (which by now had already been covered by the Ronettes).\n\nThere is the latest hit by Helen Reddy, the woman Alice Cooper calls, &quot;the queen of heavy metal housewife rock.&quot; Her hit, &quot;You're My World&quot; is at number 24.\n\nOne listener wonders if Barbara Streisand might be the female singer who has placed more albums on the album chart than any other woman, but writes in to ask Casey to be sure. Casey reports Barbara at 22, 10 albums behind the leader, a leader with only two top 40 hits to her name.\n\nAt number 31 is the song &quot;Way Down&quot; by Elvis Presley. In this show (which aired just 3 days before his death), Casey calls him the single most important single figure in the history of rock music (I am STILL standing in his shadow).\n\nThe all-time record for a song have the most consecutive weeks at number one goes to Huddie William Ledbetter, also known as Lead Belly. He also wrote the song at number 25, &quot;Black Betty&quot;, by Ram Jam (I thought &quot;Black Betty&quot; was something to eat but I had confused it with &quot;Apple Brown Betty&quot; which always reminds me of my Aunt Betty. She was always in trouble with the law for using heroin, whose slang name is &quot;Black Betty.&quot; See? ADD can be fun).\n\nCasey says three members of Electric Light Orchestra (at number 20 with &quot;Telephone Line&quot;) were formerly in a band that was successfully sued by the British Prime Minister (for all royalties of a number two record) because their manager sent postcards promoting it with an unflattering drawing of the Prime Minister.\n\nCasey also says (in the rock era) the list of American male solo artists who have had their first 8 hits make the top 40 are Elvis Presley, Ricky Nelson, Chubby Checker, Jimmie Rogers, Roger Miller, and Barry Manilow, who is at number 14 with &quot;Looks Like We Made It.&quot;\n\nThere is a woman in the top 10 who admitted her nose-diving career was saved because she married a superstar. Casey reads the declaration of Rita Coolidge, at number four with, &quot;Higher And Higher&quot; (sounds like a prenup to me).\n\n40:    Sunflower - Glen Campbell\n39:    Edge Of The Universe - The Bee Gees\n38:    So You Win Again - Hot Chocolate        \n37:    It's A Crazy World - Mac McaNally    \n36:    Don't Worry Baby - B.J. Thomas     \n35:    Margaritaville - Jimmy Buffett    \n34:    Keep It Comin' Love - K.C. &amp; The Sunshine Band\n33:    Slide - Slave\n32:    Christine Sixteen - KISS\n31:    Way Down - Elvis Presley\n30:    Cold As Ice - Foreigner\n29:    On And On - Stephen Bishop    \n28:    Star Wars (Main Title) - London Symphony Orchestra\n27:    Strawberry Letter 23 - The Brothers Johnson\n26:    Swayin' To The Music (Slow Dancin') - Johnny Rivers\n25:    Black Betty - Ram Jam\n24:    You're My World - Helen Reddy\n23:    Float On - The Floaters\n22:    How Much Love - Leo Sayer\n21:    Give A Little Bit - Supertramp\n20:    Telephone Line - Electric Light Orchestra\n19:    Telephone Man - Meri Wilson\n18:    Smoke From A Distant Fire - The Stanford Townsend Band\n17:    Undercover Angel - Alan O'Day\n16:    Barracuda - Heart\n15:    Handy Man - James Taylor\n14:    Looks Like We Made It - Barry Manilow\n13:    Don't Stop - Fleetwood Mac\n12:    Da Doo Ron Ron - Shaun Cassidy\n11:    Just A Song Before I Go - Crosby, Stills &amp; Nash\n10:    You Made Me Believe In Magic - The Bay City Rollers\n9:    You And Me - Alice Cooper\n8:    Whatcha Gonna Do - Pablo Cruise\n7:    Easy - The Commodores\n6:    My Heart Belongs To Me - Barbra Streisand\n5:    Do You Wanna Make Love - Peter McCann\n4:    (Your Love Has Lifted Me) Higher And Higher - Rita Coolidge\n3:    Best Of My Love - The Emotions\n2:    I'm In You - Peter Frampton\n1:    I Just Want To Be Your Everything - Andy Gibb","torrent":{"xt":"urn:btih:55aa5e1af0d17aa21aecaa69df6690b77a014db0","amp;dn":"American_Top_40_1977_August_13th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55aa5e1af0d17aa21aecaa69df6690b77a014db0","infoHashBuffer":{"type":"Buffer","data":[85,170,94,26,240,209,122,162,26,236,170,105,223,102,144,183,122,1,77,176]},"announce":[],"urlList":[]}}