{"title":"Legion of Super-Heroes v2 284-288 (1982) (DobisP.R.-Novus)","uid":7977423,"size":180039308,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:55f3fd765d3e0498410c9ca012c20a4cb418955d&amp;dn=Legion+of+Super-Heroes+v2+284-288+%281982%29+%28DobisP.R.-Novus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1357041455,"description":"English | CBZ | 5 Issues\n\nLegion of Super-Heroes v2 284-288\nPublisher:  DC Comics\nPublication Date:  February - June 1982\n\nWriter:  Paul Levitz\nArtists:  Pat Broderick (#284-287), Bruce Patterson (#284-287), Keith Giffen (#285-287), Larry Mahlstedt (#285, 287)\nPenciller:  Keith Giffen (#288)\nInker:  Bruce Patterson (#288)\nLetterer:  Ben Oda (#284), Bruce Patterson (#285, #288), Adam Kubert (#285-287), John Costanza (#286-287)\nColorist:  Gene D'Angelo (#284-287), Carl Gafford (#288)\n\nLegion of Super-Heroes #284\nBouncing Boy and Duo Damsel decide to return to their reserve status and leave the team. The Legion of Super-Heroes are then called in on the Medicus One, a medical facility that orbits the planet Earth, because someone is trying to steal some important supplies. Meanwhile, Karate Kid and Princess Projectra take a leave of absence from the team so that they could convince Projectra's father that Karate Kid is worthy enough to be with the Princess. Meanwhile, Timber Wolf undergoes a medical procedure to lose the animal-like face he has and return it to its normal, human face. After the procedure, someone named Organus raids Medicus One but Light Lass, Timber Wolf and other Legionnaires are able to defeat him.\n\nLegion of Super-Heroes #285\nStory 1: Night Never Falls At Nullport\nThe Legion visit the Nullport to pick up their newest starship when they have to face some Khunds that intend to commit crimes there. Meanwhile, Princess Projectra's father dies, leaving her to be Queen Projectra.\n\nStory 2: The Forgotten Future\nDream Girl in a solo adventure.\n\nLegion of Super-Heroes #286\nStory 1: Old Friends, New Relatives And Other Corpses!\nThe Legion of Super-Heroes enjoy a picnic on R.J. Brande's world, experiencing some rest and relaxation. They soon have to respond to an emergency call and are faced with Doctor Regulus. After a long, stressful fight, Doctor Regulus is defeated.\n\nStory 2: A Crown For The Princess\nPrincess Projectra is challenged her throne by her own cousin. After her cousin attacks her in combat, Karate Kid decides to be her fighter for the claim of the throne.\n\nLegion of Super-Heroes #287\nStory 1: Save The Suicide Squad\nChameleon Boy heads the Espionage Squad to the homeworld of the Khunds to do some reconnaissance, even though Lightning Lad, the leader of the Legion, had no idea. The Legion have to be called in to save their teammates but the UP frowns against invading the Khund planet and Lighting Lad is so upset that he doesn't allow anyone to do anything.\n\nStory 2: Prologue To Darkness\nMon-El and Shadow Lass have an adventure.\n\nLegion of Super-Heroes #288\nKarate Kid and Princess Projectra are on the planet of Orando, where they are unjustly imprisoned by one of Projectra's family members that is trying to claim the throne now that her father has passed away. Meanwhile, some Legionnaires head to the Khund homeworld to help save their teammates in the Legion Espionage Squad that went there to uncover information. The Legionnaires on Orando are about to fight their opposition and Princess Projectra is hailed as the queen. Karate Kid and Projectra take a leave of absence from the team so they she can handle affairs on Orando and he could be her consort.\n\nThanks goes to DobisP.R. for this release.","torrent":{"xt":"urn:btih:55f3fd765d3e0498410c9ca012c20a4cb418955d","amp;dn":"Legion+of+Super-Heroes+v2+284-288+%281982%29+%28DobisP.R.-Novus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55f3fd765d3e0498410c9ca012c20a4cb418955d","infoHashBuffer":{"type":"Buffer","data":[85,243,253,118,93,62,4,152,65,12,156,160,18,194,10,76,180,24,149,93]},"announce":[],"urlList":[]}}