{"title":"Discovery.Ch.Submarines.Sharks.Of.Steel.4of4.The.Hidden.Threat.X","uid":6552271,"size":854829056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:561b339efd62ee4f32cda78acd5fb98182712f6c&amp;dn=Discovery.Ch.Submarines.Sharks.Of.Steel.4of4.The.Hidden.Threat.X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1311153486,"description":"Come aboard and step into the exciting world of submarines. Learn the transformation from crude containers designed to keep the water out to the nuclear powered steel underwater sharks of today. Striking from below, the submarine has struck fear into the hearts of sailors for over one hundred years. Now, take a four-part journey into the silent ranks of one of the world's deadliest weapons. Each episode of Sharks of Steel takes viewers inside the world of the submarine and the submariners who serve aboard them. Used as weapons for over a hundred years, it was during the world wars when submarines found their purpose as commerce raiders by sinking enemy shipping. Later, when nuclear weaponry came of age, submarines became an integral part of naval force. Capable of electronically picking your pocket or destroying an enemy's submarines, these sleek, nuclear powered sharks of steel are currently at front line of defense. With stealth and quiet submarines accomplish their missions around the sometimes hostile world while surviving deep underwater.\n\nDirected by Scott Hicks\nProduced by Michael Caulfield\n\nA Beyound Productions &amp; Discovery Communications Co-Production (1992)\n\n\n\nEpisode 4 : The Hidden Threat\n\nTHE HIDDEN THREAT serves as an introduction to the submarine and the life the submariner leads. Riding the razor thin edge of mutually assured destruction, U.S. and Russian nuclear submarine forces wage a secret war. It's a deadly game of cat and mouse, hidden from the scrutiny of the outside world. No satellite or laser imaging system can track them. Their own governments never know exactly where they are. And once on patrol, the &quot;silent service&quot; is accountable to no one but themselves and their singular mission.\nThese are the massive SSBN &quot;Boomers&quot; and their SSN class &quot;Hunter-Killer&quot; shadows--missile and fast attack platforms capable of unleashing unimaginable devastation. When the launch sequence begins, only a precarious fail safe system or an enemy's torpedo can stop them. Shrouded in secrecy, few have ever understood the risks of this strategic defense... until now.\n\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2228 kbps\nVideo Resolution: 576x432\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 46:20.172\nNumber Of Parts: 4\nPart Size: 854,827,008 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:561b339efd62ee4f32cda78acd5fb98182712f6c","amp;dn":"Discovery.Ch.Submarines.Sharks.Of.Steel.4of4.The.Hidden.Threat.X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561b339efd62ee4f32cda78acd5fb98182712f6c","infoHashBuffer":{"type":"Buffer","data":[86,27,51,158,253,98,238,79,50,205,167,138,205,95,185,129,130,113,47,108]},"announce":[],"urlList":[]}}