{"title":"Chakra Balancing Meditation Program by Ascension Beats [MP3]","uid":11907793,"size":907887272,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:56b21fdc938a2e445eb7a597030cc8ec45555b3e&amp;dn=Chakra+Balancing+Meditation+Program+by+Ascension+Beats+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"elessedilgirl","files":14,"time":1431418428,"description":"The Chakra Balancing Meditation Program is a personal seven day meditation program. Chakras are the power stations of your body, bringing it to life, and keeping it healthy. This series of self hypnosis meditation MP3s has been designed to improve your health and wellbeing, physically, mentally and emotionally.\n\nEach meditation session contains binaural beats and must be listened to through headphones.\n\nEach track lasts 45 min\n\nIncludes non-verbal version &amp; verbal version with spoken affirmations.\n\nDAY 1: Muladhara: The Root Chakra\n\nMuladhara or root chakra is related to instinct, security, survival and also to basic human potentiality. This center is located in the perineum, which is the region between the genital and the anus. Although no endocrine organ is placed here, it is said to relate to the gonads and the adrenal medulla, responsible for the fight-or-flight response when survival is under threat. There is a muscle located in this region that controls ejaculation in the sexual act of the human male. A parallel is charted between the sperm cell and the ovum where the genetic code lies coiled and the kundalini. Muladhara is symbolized by a lotus with four petals and the colour red. Key issues involve sexuality, lust and obsession. Physically, Muladhara governs sexuality, mentally it governs stability, emotionally it governs sensuality, and spiritually it governs a sense of security.\n\n\nDAY 2: Svadhisthana: The Sacral Chakra\n\nSvadisthana or adhishthana is located in the sacrum (hence the name) and is considered to correspond to the testes or the ovaries that produce the various sex hormones involved in the reproductive cycle. Svadisthana is also considered to be related to, more generally, the genitourinary system and the adrenals. The Sacral Chakra is symbolized by a lotus with six petals, and corresponds to the colour orange. The key issues involving Svadisthana are relationships, violence, addictions, basic emotional needs, and pleasure. Physically, Svadisthana governs reproduction, mentally it governs creativity, emotionally it governs joy, and spiritually it governs enthusiasm.\n\n\nDAY 3: Manipura: The Solar Plexus Chakra\n\nManipura or manipuraka is related to the metabolic and digestive systems. Manipura is believed to correspond to Islets of Langerhans, which are groups of cells in the pancreas, as well as the outer adrenal glands and the adrenal cortex. These play a valuable role in digestion, the conversion of food matter into energy for the body. Symbolised by a lotus with ten petals. The colour that corresponds to Manipura is yellow. Key issues governed by Manipura are issues of personal power, fear, anxiety, opinion-formation, introversion, and transition from simple or base emotions to complex. Physically, Manipura governs digestion, mentally it governs personal power, emotionally it governs expansiveness, and spiritually, all matters of growth.\n\n\nDAY 4: Anahata: The Heart Chakra\n\nAnahata, or Anahata-puri, or padma-sundara is related to the thymus, located in the chest. The thymus is an element of the immune system as well as being part of the endocrine system. It is the site of maturation of the T cells responsible for fending off disease and may be adversely affected by stress. Anahata is symbolised by a lotus flower with twelve petals. Anahata is related to the colours green or pink. Key issues involving Anahata involve complex emotions, compassion, tenderness, unconditional love, equilibrium, rejection and well-being. Physically Anahata governs circulation, emotionally it governs unconditional love for the self and others, mentally it governs passion, and spiritually it governs devotion.\n\n\nDAY 5: Vishuddha: The Throat Chakra\n\nVishuddha (also Vishuddhi) may be understood as relating to communication and growth through expression. This chakra is paralleled to the thyroid, a gland that is also in the throat and which produces thyroid hormone, responsible for growth and maturation. Symbolised by a lotus with sixteen petals. Vishudda is characterized by the colour light or pale blue, or turquoise. It governs such issues as self-expression and communication, as discussed above. Physically, Vishuddha governs communication, emotionally it governs independence, mentally it governs fluent thought, and spiritually, it governs a sense of security.\n\n\nDAY 6: Ajna: The Brow Chakra\n\nAjna (along with Bindu, is also known as the third eye chakra) is linked to the pineal gland which may inform a model of its envisioning. The pineal gland is a light sensitive gland that produces the hormone melatonin which regulates sleep and waking up. Ajna is symbolised by a lotus with two petals, and corresponds to the colors violet, indigo or deep blue. Ajna's key issues involve balancing the higher &amp; lower selves and trusting inner guidance. Ajna's inner aspect relates to the access of intuition. Mentally, Ajna deals with visual consciousness. Emotionally, Ajna deals with clarity on an intuitive level.\n\n\nDAY 7: Sahasrara: The Crown Chakra\n\nSahasrara is generally considered to be the chakra of pure consciousness. Its role may be envisioned somewhat similarly to that of the pituitary gland, which secretes hormones to communicate to the rest of the endocrine system and also connects to the central nervous system via the hypothalamus. The thalamus is thought to have a key role in the physical basis of consciousness. Symbolized by a lotus with one thousand petals, it is located at the crown of the head. Sahasrara is represented by the colour White and it involves such issues as inner wisdom and the death of the body. Sahasrara's inner aspect deals with the release of karma, physical action with meditation, mental action with universal consciousness and unity, and emotional action with &quot;beingness&quot;.\n\nMP3 - 192 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:56b21fdc938a2e445eb7a597030cc8ec45555b3e","amp;dn":"Chakra+Balancing+Meditation+Program+by+Ascension+Beats+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b21fdc938a2e445eb7a597030cc8ec45555b3e","infoHashBuffer":{"type":"Buffer","data":[86,178,31,220,147,138,46,68,94,183,165,151,3,12,200,236,69,85,91,62]},"announce":[],"urlList":[]}}