{"title":"Tom Petty &amp; the Heartbreakers - Runnin' Down A Dream - .m4v / .","uid":5864650,"size":9680566814,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:56f7330221e6e9d5fe9af7df133009738a06d51d&amp;dn=Tom+Petty+%26+the+Heartbreakers+-+Runnin%5C%27+Down+A+Dream+-+.m4v+%2F+.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tmax666","files":5,"time":1286066553,"description":"Runnin' Down a Dream: Tom Petty and the Heartbreakers \nH.264 .m4v/.mp4 (2 part movie)\n\nplus ---\n\nTom Petty and the Heartbreakers 30th Anniversary Concert\nH.264 .m4v/.mp4\n\nAdditional info:\n\nTotal bit rate: 3538 kbps\nVideo Dimensions 841 x 480\nAudio Channels: Stereo, Dolby Digital 5.1\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nAnother rip to to place video in modern packages (mp4's) rather than the dated .avi package.\n\nI downloaded the DVD's of the 2 part film and the 30th Anniversary concert and ripped H.264 MP4 files of each episode. The files have a suffix of .m4v as they were ripped using Handbrake with an Apple TV standard so they can be played on any modern iPod, iPhone, iPad, Apple TV or in iTunes. They can also be played on any compliant player but you may need to change the suffix from .m4v to .mp4.\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nREVIEW- (by someone writing on Amazon)\n\n&quot;I feel pretty blessed really right now, when I see it, that most of us made it through that maze that is growing up in rock 'n' roll,&quot; he says. &quot;And I think we've matured in a way that we're maybe better now, you know, maybe better musicians, and enjoying our craft more than we ever have. So I'm very lucky.&quot; Tom Petty \n\nI found this four hour anthology of Tom Petty and his Heartbreakers on Sundance Channel. I immediately notified my best friend, and we watched unbelievably spellbound. This story of Tom Petty and the Heartbreakers was directed by Peter Bogdanovich. He begins with the start of Tom Petty's life in Gainesville, Florida and ends with a 2006 commemoration concert of his thirtieth anniversary in music. \n\nThe entire story is told through home movies, television shows and rememberances in narrative form. Tom Petty does much of the narrative and this is his profession and musical life, after all. The list of friends, colleagues and those in the know who knew or played with Tom Petty is remarkable. It is a time line of the history of rock and music. Bob Dylan, Roy Orbison, George Harrison, and Jeff Lynn along with Tom Petty join to form 'The Traveling Wilburys'. This remarkable group, to a one, votes this time in their lives as one of the most rewarding musical experiences. Stevie Nicks wants to join Tom Petty and his heartbreakers, but she is a woman and &quot;this is a men's club&quot; says Tom Petty. The sheer sense of Tom's persuasive personality in pursing his career in music is pure genius. Once he set down this path he never looked back. This was his life and what a life it has been. \n\nThis movie is about the music. There is some mention of marriage and Tom Petty's daughter is interviewed. Little personal information is shared. What we do have is the music and it is glorious. From &quot;Breakdown&quot;, &quot;American Girl&quot; &quot;Even the Losers&quot;, &quot;I Won't Back Down&quot;, &quot;Learning to Fly&quot;, &quot;Into the Great Wide Open&quot;, &quot;Refugee&quot;, &quot;Straight Into Darkness, &quot;Don't Do Me Like That&quot;, and on and on. A homage to Tom Petty and his career. \n\n&quot;Tom Petty And The Heartbreakers: Runnin' Down A Dream remarkably chronicles a prolific career that's yielded dozens of instantly recognizable songs and countless good times for all who've cared to listen. It's an indispensable documentary on one of America's most successful rock and roll bands, whose leader never backed down in aspiring to his ambition.&quot; Donald Gibson \n\nThis may be one of the best made rock documentaries. A must see for all of Tom Petty fans and for those who love great rock n' roll.\n\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =\n\nThe 30th Anniversary Concert was filmed September 21, 2006 at the Stephen C. O'Connell Center at the University of Florida, Gainesville, Florida\n\nSet List-\n\n&quot;Listen to Her Heart&quot; (Tom Petty)\n&quot;Mary Jane's Last Dance&quot; (Tom Petty)\n&quot;I Won't Back Down&quot; (Tom Petty)\n&quot;Free Fallin'&quot; (Tom Petty, Jeff Lynne)\n&quot;Saving Grace&quot; (Tom Petty)\n&quot;I'm A Man&quot; (Ellas McDaniel)\n&quot;Oh Well&quot; (Peter Green)\n&quot;Handle With Care&quot; (Bob Dylan, George Harrison, Jeff Lynne, Roy Orbison, Tom Petty)\n&quot;Stop Draggin' My Heart Around&quot; (with Stevie Nicks (Tom Petty, Mike Campbell)\n&quot;I Need to Know&quot; (with Stevie Nicks) (Tom Petty)\n&quot;It's Good To Be King&quot; (Tom Petty)\n&quot;Down South&quot; (Tom Petty)\n&quot;Southern Accents&quot; (Tom Petty)\n&quot;Insider&quot; (with Stevie Nicks) (Tom Petty)\n&quot;Learning to Fly&quot; (Tom Petty, Jeff Lynne)\n&quot;Don't Come Around Here No More&quot; (Tom Petty, Dave Stewart)\n&quot;Runnin' Down a Dream&quot; (Tom Petty, Jeff Lynne, Mike Campbell)\n&quot;You Wreck Me&quot; (Tom Petty, Mike Campbell)\n&quot;Mystic Eyes&quot; (Van Morrison)\n&quot;American Girl&quot; (Tom Petty)","torrent":{"xt":"urn:btih:56f7330221e6e9d5fe9af7df133009738a06d51d","amp;dn":"Tom+Petty+%26+the+Heartbreakers+-+Runnin%5C%27+Down+A+Dream+-+.m4v+%2F+.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56f7330221e6e9d5fe9af7df133009738a06d51d","infoHashBuffer":{"type":"Buffer","data":[86,247,51,2,33,230,233,213,254,154,247,223,19,48,9,115,138,6,213,29]},"announce":[],"urlList":[]}}