{"title":"Detective Comics 652-658 (1992-10) (digital) (OkC.O.M.P.U.T.O.-N","uid":10600144,"size":227263660,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5769360e56eaae26e15f49147f764cf6ffebe9b0&amp;dn=Detective+Comics+652-658+%281992-10%29+%28digital%29+%28OkC.O.M.P.U.T.O.-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1405910695,"description":"A Novus Release\n\n\n\n\nThis torrent includes the HD version.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n\n\n#652  When the Huntress and Batman attempt to take down a gang of hoods they learn these crooks have diplomatic immunity. The tables are turned as the two vigilantes find themselves wanted by the law. \n\n#653  The Dark Knight and the Huntress team up to take on a group of terrorists\n\n#654  The mind of a ruthless military genius trapped in the body of an 11-year-old boy makes for a deadly combination, which Batman discovers when he is outnumbered by Gotham's street gangs gathered under the banner of the General. \n\n#655  The Dark Knight takes on the united gangs of Gotham, all led by the military-minded General, who resides in the body of an 11-year-old boy. \n\n#656  Gotham City has become a war zone, and Batman is caught in the middle of it all. Plus, a mysterious group observes the Dark Knight and plans to test his abilities further\n\n#657  Someone is learning secrets from the heads of major Gotham City corporations, and then causing them to commit suicide...and Lucius Fox, C.E.O. of Bruce Wayne's companies, is next on the list. \n\n#658  Bruce Wayne can't deal with the problems at Wayne Enterprises, but he believes Batman can. After a long search, the Dark Knight and his allies track down the man and method that is leading to the suicide of so many corporate heads. \n\n\nThanks goes to OkC.O.M.P.U.T.O. for this release.\n","torrent":{"xt":"urn:btih:5769360e56eaae26e15f49147f764cf6ffebe9b0","amp;dn":"Detective+Comics+652-658+%281992-10%29+%28digital%29+%28OkC.O.M.P.U.T.O.-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5769360e56eaae26e15f49147f764cf6ffebe9b0","infoHashBuffer":{"type":"Buffer","data":[87,105,54,14,86,234,174,38,225,95,73,20,127,118,76,246,255,235,233,176]},"announce":[],"urlList":[]}}