{"title":"Batman and Robin issue #00 - 13 (on-going)","uid":7765970,"size":215816350,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5851df8260e766a2bf74c1e5066fa27eb84edf4d&amp;dn=Batman+and+Robin+issue+%2300+-+13+%28on-going%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oKNIGHTo","files":14,"time":1351374227,"description":"In the wake of the time-altering Flashpoint event, DC Comics instituted a mandate that saw all of their ongoing super hero titles canceled to make way for new and relaunched series all starting with new #1 issues. Of The New 52, several were time-honored titles such as Action Comics and Detective Comics, in addition to titles like Batman and Robin.\n\nThe relaunched DC Universe features several notable differences from its previous incarnation, making all of the established heroes roughly five years younger than their previous versions before the relaunch. While much of Batman's history from the previous DCU remains intact, Bruce Wayne is again the only hero serving as Batman and as such, he has replaced Dick Grayson in this title. Volume 2 features the exploits of Bruce and Damian, father and son, as Batman and Robin.[33]\n\nThe team of writer Peter Tomasi and artist Patrick Gleason return to the title upon the relaunch, telling a story of a man from Bruce's past arriving in Gotham as both a vigilante and enemy of Batman, as well as trying to seduce Damian away from a form of crimefighting that defies his lethal and unpredictable skill and nature. The series takes place between Justice League International and Batman: The Dark Knight.[33]\n\nDamian Wayne discovers it harder to work with Bruce and reveals that he prefers to work with Dick. When Bruce subjugates Damian to lessons he had his previous &quot;sons&quot; he ends up telling Damian that he does not trust him. Morgan Ducard then strains the relationship between Damian and Bruce and manages to sway Damian over to his side. Morgan then takes Damian to his base with a prisoner and Damian reveals their alliance to be a ruse and gives away their location to Bruce. When Bruce arrives, a brutal battle ensues which ends with Damian killing Morgan and passing out.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Batman_and_Robin_%28comic_book%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Batman_and_Robin_%28comic_book%29&lt;/a&gt;\n\nThis is merely a re-upload of the issues that are already out and is still in continuation. I will update it when new issues arrive. Any other comics you need gathered up let me know in the comments below\n\n- oKNIGHTo","torrent":{"xt":"urn:btih:5851df8260e766a2bf74c1e5066fa27eb84edf4d","amp;dn":"Batman+and+Robin+issue+%2300+-+13+%28on-going%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5851df8260e766a2bf74c1e5066fa27eb84edf4d","infoHashBuffer":{"type":"Buffer","data":[88,81,223,130,96,231,102,162,191,116,193,229,6,111,162,126,184,78,223,77]},"announce":[],"urlList":[]}}