{"title":"Laibach - Macbeth","uid":4184274,"size":198554795,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5971096293da7cac583ae63b5d7430bda29b6886&amp;dn=Laibach+-+Macbeth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":3,"time":1210578452,"description":"Shortly before the Sympathy for the Devil/Let It Be phase of the band's existence, another group of Laibach members was pursuing more explicitly high-art goals, specifically in following up Baptism by providing the soundtrack to another experimental theater production. Said production, an adaptation of Shakespeare's Macbeth, featured two members of the band performing the music directly on-stage with the actors. The resulting album couldn't feature that aspect, obviously, but there's just over 30 minutes of music that makes for an interesting experience on its own, if a somewhat forbidding one even for Laibach. As a soundtrack, Macbeth is much more strident and high impact than Baptism -- more than once it seems unclear as to how the actors could deliver any lines over the music. Alternating in an irregular fashion between quieter and much more overbearing sections, Macbeth in many ways feels like one endless march forward, however occasionally punctuated by string/horn-only parts or by sample collages featuring everything from crying babies to hoarse chants to screeching metal. Those who appreciate the collapsing chaos of such groups as Nurse With Wound and earlier Krautrock luminaries like Faust may well enjoy such parts, as well as when the tape audibly speeds up and makes everything even more of an edgy, live-wire mess. On balance, only those fans who enjoyed Baptism should consider getting Macbeth, and even then many will find it fairly impenetrable, but it's still a grand, large enough listen. In a slightly annoying mastering note, the whole disc is mastered as one track; individual track listings are provided on the back cover, but it's anyone's guess as to what goes where.\n   - http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=Axl5g8qbtbtc4\n\nrepeat:\nIn a slightly annoying mastering note, the whole disc is mastered as one track; individual track listings are provided on the back cover, but it's anyone's guess as to what goes where.\n\nEnjoy","torrent":{"xt":"urn:btih:5971096293da7cac583ae63b5d7430bda29b6886","amp;dn":"Laibach+-+Macbeth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5971096293da7cac583ae63b5d7430bda29b6886","infoHashBuffer":{"type":"Buffer","data":[89,113,9,98,147,218,124,172,88,58,230,59,93,116,48,189,162,155,104,134]},"announce":[],"urlList":[]}}