{"title":"The Engineering of Chemical Reactions","uid":12085968,"size":18076594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a6ee407bae5bfaf20d5057490e4ffacf96161ad&amp;dn=The+Engineering+of+Chemical+Reactions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435911012,"description":"The Engineering of Chemical Reactions (Topics in Chemical Engineering) - Lanny D. Schmidt (Oxford, 1998).pdf\n\nISBN 0-19-510588-5\n\nEmployment opportunities for chemical engineers are moving away from petroleum and petrochemicals toward new applications such as materials processing, pharmaceuticals, and foods. Chemical reactors remain at the center of any chemical process; they are essential to improving existing processes and to designing new ones. Today and in the future chemical engineers must be able to use their knowledge of reactors in combination with other skills in order to think creatively and strategically about new processes and growing applications. \nThe Engineering of Chemical Reactions addresses these issues by focusing on the analysis of chemical reactors while simultaneously providing a description of industrial chemical processes and the strategies by which they operate. Ideal for upper-level undergraduate courses in chemical reactor engineering and kinetics, this text provides a concise, up-to-date alternative to similar texts. In addition to the analysis of simple chemical reactors, it considers more complex situations such as multistage reactors and reactor-separation systems. Energy management and the role of mass transfer in chemical reactors are also integrated into the text. \nThe evolution of chemical engineering from petroleum refining, through petrochemicals and polymers, to new applications is described so that students can see the relationships between past, present, and future technologies. Applications such as catalytic processes, environmental modeling, biological reactions, reactions involving solids, oxidation, combustion, safety, polymerization, and multiphase reactors are also described. \nThe text uses a notation of reaction stoichiometry and reactor mass balances which is kept simple so that students can see the principles of reactor design without becoming lost in complex special cases. Numerical methods are used throughout to consider more complex problems. Worked examples are given throughout the text, and over 300 homework problems are included. Both the examples and problems cover real-world chemistry and kinetics","torrent":{"xt":"urn:btih:5a6ee407bae5bfaf20d5057490e4ffacf96161ad","amp;dn":"The+Engineering+of+Chemical+Reactions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a6ee407bae5bfaf20d5057490e4ffacf96161ad","infoHashBuffer":{"type":"Buffer","data":[90,110,228,7,186,229,191,175,32,213,5,116,144,228,255,172,249,97,97,173]},"announce":[],"urlList":[]}}