{"title":"Big Chief - Mack Avenue Skullgame (1993)","uid":4104393,"size":71583323,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5aa94f99907aec6ed0db2ce6136392750bb9ef7f&amp;dn=Big+Chief+-+Mack+Avenue+Skullgame+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nakiel","files":20,"time":1206731637,"description":"Big Chief - Mack Avenue Skullgame (1993)\n\n01 Skullgame No.3, Take 3\n02 My Name Is Pimp (Mack&amp;#039;s Theme)\n03 Let&amp;#039;s Do It Again\n04 One Born Every Minute (Doc&amp;#039;s Theme)\n05 Sonica\n06 No Free Love On This Street (Sonica&amp;#039;s Theme)\n07 Soul On A Roll\n08 10 Karat Pinky Ring\n09 Have Another Glass Of Brandy, Baby\n10 Gaeity Lounge Punk\n11 Cop Kisser (Mack Fucks Up The Scene At The Freezer)\n12 If I Had A Nickel For Every Dime\n13 Mixed Jive\n14 He Needs To Be Dead, Ten Easy Pieces (The Power Of Ginsu)\n15 Cut To The Chase\n16 Meet The Man Day\n17 O Woman (Mack&amp;#039;s Lament)\n18 Skullgame (Reprise)\n\nRight now, somewhere in Germany, a young mensch is scouring the walls of his favorite cult video emporium, squinting his eyes to catch the spine of the elusive Detroit B-movie from the early &amp;#039;90s called Mack Avenue Skullgame. Big Chief delivered its finest work with its like-named soundtrack for the non-film, a conceptual hoax that pays tribute to the Blaxploitation soundtracks of the &amp;#039;70s while fusing that sound with the band&amp;#039;s rock foundations. It sounds like a gimmick, but it&amp;#039;s not a gimmick in the manner of a white person donning an Afro. It only seems like a gimmick because the influence of Blaxploitation flicks wasn&amp;#039;t so common at the time. Save for the Beastie Boys, hardly any non-black acts were adopting such a stance as a means of embracing and acknowledging black culture. While later outfits would use this as a ploy for cuteness and attention, Big Chief was doing it out of pure admiration. Prior to recording the album, the band was determined not to be classified as a run-of-the-mill guitar band. The climate was just about to split open for the faceless and fashionable post-grunge outfits, so the move ultimately ended up being a wise and rather prophetic move. Since Big Chief&amp;#039;s listening habits and influences shot through the spectrums of rock, funk, and jazz, it wasn&amp;#039;t such a hard concept to translate from brain to wax. Freeing the band up led to a loose and tight record -- loose because it sounds like a big party, and tight because there aren&amp;#039;t any dull moments. So take the Beastie Boys&amp;#039; Check Your Head or Ill Communication and replace the rapping with more funk and soul. Make either of those records more cohesive, form it into a song cycle, and you have Mack Avenue Skullgame.","torrent":{"xt":"urn:btih:5aa94f99907aec6ed0db2ce6136392750bb9ef7f","amp;dn":"Big+Chief+-+Mack+Avenue+Skullgame+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa94f99907aec6ed0db2ce6136392750bb9ef7f","infoHashBuffer":{"type":"Buffer","data":[90,169,79,153,144,122,236,110,208,219,44,230,19,99,146,117,11,185,239,127]},"announce":[],"urlList":[]}}