{"title":"Predator_-_Predador (1987)","uid":4541648,"size":1564225738,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5abf9cf0df29fda1d6fff83d116d7ee457aa49c1&amp;dn=Predator_-_Predador+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maike_spjp","files":1,"time":1227968148,"description":"Please share and comment. \nThe continuity of peer-to-peer depends on you. \nVisit http://www.finalshare.net\n\nEnglish\n-------\nDutch (Arnold Schwarzenegger) has a code of honor which he will not violate, even when his life depends on it. Paradoxically, his code of honor gives him the backbone to survive as a military special forces operative when he is sent on a covert mission to rescue another group which was sent in to assist some nefarious U.S. government plan in a Latin American country. Once there, he encounters an old army buddy (Carl Weathers) who has gotten too deep in the CIA&amp;#039;s good graces for Dutch&amp;#039;s comfort. When he and his team go into the jungle to rescue the others, they get involved in a pitched battle with local guerillas, but they are more than capable of besting these vicious fighters. However, not long after that, they encounter signs that the equally capable men they were sent to rescue were all killed unawares and in an unusually gruesome fashion. Given their training, it should have been impossible for anyone to best all of these commando warriors. Soon, the men from Dutch&amp;#039;s own team get picked off one by one, as they grow aware that they are up against something uncanny, not of this world, something that is hunting them for sport. Why? Because their skills make them worthy opponents for the perfectly camouflaged Predator. This carefully paced action movie was given poor reviews by many movie critics, but was sufficiently satisfying for its (largely male) audiences that a successful sequel (Predator 2) was released in 1990.\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nPortuguÃƒÂªs\n---------\nO major Alan &quot;Dutch&quot; Schaefer (Arnold Schwarzenegger) lidera uma equipe de resgate em uma selva da AmÃƒÂ©rica Central, para tentar encontrar um ministro estrangeiro e funcionÃƒÂ¡rios do governo que saÃƒÂ­ram da rota e se perderam. O exÃƒÂ©rcito acredita que eles estejam nas mÃƒÂ£os de guerrilheiros, mas o que eles nÃƒÂ£o imaginam ÃƒÂ© que a floresta esconde uma ameaÃƒÂ§a mortal, um ser de outro planeta, fortemente armado, que sente enorme prazer em matar.\n\t\t\t\t","torrent":{"xt":"urn:btih:5abf9cf0df29fda1d6fff83d116d7ee457aa49c1","amp;dn":"Predator_-_Predador+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5abf9cf0df29fda1d6fff83d116d7ee457aa49c1","infoHashBuffer":{"type":"Buffer","data":[90,191,156,240,223,41,253,161,214,255,248,61,17,109,126,228,87,170,73,193]},"announce":[],"urlList":[]}}