{"title":"A New World Series by John O'Brien","uid":8007629,"size":2370584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b097b5fce3c2cba7d7e629f8ad73bfee1eb7bcc&amp;dn=A+New+World+Series+by+John+O%27Brien&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NewSky000","files":7,"time":1357927482,"description":"Title: A New World Series\n\nAuthor: John O'Brien\n\nBook(s): 6\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Action, Sci-Fi, Horror\n\nSummary:\n\nThere is no sanctuary.\n\nThat was taken away in the blink of an eye. Humanity went out not with a whimper, but a bang.\n\nJack, a sometimes humorous, sometimes philosophical ex-special operations pilot and soldier is one of the few left to struggle through the desolation left in the aftermath; seeking to survive as a new ferocious species emerges from the rubble, hungry and unrelenting. Will his special forces training be enough? Will he be able to keep his children safe and guide the few survivors through perils that now roam the world they once knew? Or will the hordes that now own the night prevail, forever removing the last of mankind from existence? Humankind was once at the top of the food chain. But that has now changed. \n\nThis hard-hitting, action-packed series begins with Jack Walker being suddenly thrust into a world where the infrastructure which cherished Armani suits, night clubs, fast and expensive cars and watching the daily stock market are gone. Left in its place is the material world mankind built but a majority of the population has vanished; replaced by a new, savage, unrelenting, cunning, animalistic species which hunts and operates at night. - Goodreads Summary of Chaos (A New World Series #1)\n\nNote: Mainly a die-hard kind of book, with zombies and apocalyptic battle scenes. Quite the hardcore book!\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:5b097b5fce3c2cba7d7e629f8ad73bfee1eb7bcc","amp;dn":"A+New+World+Series+by+John+O%27Brien","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b097b5fce3c2cba7d7e629f8ad73bfee1eb7bcc","infoHashBuffer":{"type":"Buffer","data":[91,9,123,95,206,60,44,186,125,126,98,159,138,215,59,254,225,235,123,204]},"announce":[],"urlList":[]}}