{"title":"Morrissey - Morrissey At KROQ [EP] [1991] FLAC","uid":4342226,"size":72547195,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b18426dca83f58ec533b407cb7e629afd2ae53f&amp;dn=Morrissey+-+Morrissey+At+KROQ+%5BEP%5D+%5B1991%5D+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WHOA636","files":-1,"time":1218668164,"description":"KROQ, the once influential modern rock station in Los Angeles, had long been a champion of the Smiths and Morrissey both, so it wasn&amp;#039;t a surprise that he ended up recording an exclusive radio session for them as a result. Interestingly enough, this EP never was officially released in its entirety in the U.K.; a pity for his hometown audience, as this captured Morrissey and his band performing ripping versions of three of his cuts. &quot;There&amp;#039;s a Place in Hell for Me and My Friends&quot; exchanges the piano-led delicacy of the studio version for a brash, celebratory crunch, while &quot;Sing Your Life&quot; replaces the calmer groove of the original for a more in-your-face rave-up. &quot;My Love Life&quot; doesn&amp;#039;t sound much different from the studio take in comparison, possibly because the band also did that version as well. The amazing bonus on this release appears after the end of &quot;Sing Your Life&quot;: eight minutes of fans calling into KROQ and leaving messages for Morrissey. Anyone questioning the devotion of his followers needs to give this an ear, as it ranges from the calmly appreciative to the flat-out hysterical. The one girl who starts by breathlessly complaining about her friends who like New Kids on the Block and &quot;their stupid shiny black shoes&quot; before completely collapsing in tears is something else.\n\n*These eight minutes of fan messages have been removed.*\n\nPersonnel: Morrissey (vocals); Alain Whyte, Boz Boorer (guitar); Gary Day (bass); Spencer (drums).\n\nRecorded at Capitol Studios, Hollywood, California on June 3, 1991.\n\nTracklisting:\n\n1 There&amp;#039;s a Place in Hell for Me and My Friends\n\n2 My Love Life\n\n3 Sing Your Life\n\n*not my rip","torrent":{"xt":"urn:btih:5b18426dca83f58ec533b407cb7e629afd2ae53f","amp;dn":"Morrissey+-+Morrissey+At+KROQ+%5BEP%5D+%5B1991%5D+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b18426dca83f58ec533b407cb7e629afd2ae53f","infoHashBuffer":{"type":"Buffer","data":[91,24,66,109,202,131,245,142,197,51,180,7,203,126,98,154,253,42,229,63]},"announce":[],"urlList":[]}}