{"title":"Dynamic Deformation, Damage and Fracture in Composite Materials","uid":15365584,"size":21985345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c6aaa3f08d69b1f740b09692231fd2682dcbd24&amp;dn=Dynamic+Deformation%2C+Damage+and+Fracture+in+Composite+Materials+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469071430,"description":"Dynamic Deformation, Damage and Fracture in Composite Materials and Structures - V.V. Silberschmidt (WP, 2016).pdf\r\n\r\nComposite materials, with their higher exposure to dynamic loads, have increasingly been used in aerospace, naval, automotive, sports and other sectors over the last few decades. Dynamic Deformation, Damage and Fracture in Composite Materials and Structures reviews various aspects of dynamic deformation, damage and fracture, mostly in composite laminates and sandwich structures, in a broad range of application fields including aerospace, automotive, defense and sports engineering.\r\n\r\nAs the mechanical behavior and performance of composites varies under different dynamic loading regimes and velocities, the book is divided into sections that examine the different loading regimes and velocities. Part one examine low-velocity loading and part two looks at high-velocity loading. Part three then assesses shock and blast (i.e. contactless) events and the final part focuses on impact (contact) events. As sports applications of composites are linked to a specific subset of dynamic loading regimes, these applications are reviewed in the final part.\r\n\r\n\r\n\r\nExamines dynamic deformation and fracture of composite materials\r\nCovers experimental, analytical and numerical aspects\r\nAddresses important application areas such as aerospace, automotive, wind energy and defence, with a special section on sport applications","torrent":{"xt":"urn:btih:5c6aaa3f08d69b1f740b09692231fd2682dcbd24","amp;dn":"Dynamic+Deformation%2C+Damage+and+Fracture+in+Composite+Materials+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6aaa3f08d69b1f740b09692231fd2682dcbd24","infoHashBuffer":{"type":"Buffer","data":[92,106,170,63,8,214,155,31,116,11,9,105,34,49,253,38,130,220,189,36]},"announce":[],"urlList":[]}}