{"title":"How I Met Your Mother Seasons 1-9 iTunes HD","uid":10632393,"size":56134526787,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5c85863536ceccbca31f938e82ce427eb587833c&amp;dn=How+I+Met+Your+Mother+Seasons+1-9+iTunes+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"llibtj","files":-1,"time":1406340576,"description":"How I Met Your Mother Seasons 1-9 Complete (2005-2014)\n\nInfo:\nMeta-data already fixed to look like iTunes-purchased media complete with artwork and description for each episode and all so it will look beautiful on your media viewer.\n\nIn M4V format and compatible with almost all consumer devices including Apple TV, iPhone/iPad/iPod touch, PS3, Xbox 360, Xbox One, and PS4.\n\nThey are all in 720p HD format taken from various sources all with subtitles encoded in (not hard-coded, you can turn them on and off)\n\n\nDescription:\nThe year is 2030. Ted Mosby is relaying the story of how he met his wife to his daughter and son. The story starts in the year 2005, when then twenty-seven year old architect Ted was spurred on to want to get married after his best friends from his college days at Wesleyan, lawyer Marshall Eriksen, who was his roommate at the time and kindergarten teacher Lily Aldrin, got engaged after nine years of dating each other. Ted's new quest in life was much to the dismay of his womanizing friend, Barney Stinson. But soon after Marshall and Lily's engagement, Ted believed that his life mate was going to be news reporter and aspiring news anchor Robin Scherbatsky, who, despite having had a romantic relationship with her after this time, ended up being who the kids know as their &quot;Aunt&quot; Robin. As Ted relays the story to his kids, the constants are that their Uncle Marshall, Aunt Lily, Uncle Barney and Aunt Robin are always in the picture and thus have something to do with how he got together with their mother.\n\nTaglines: A love story in reverse.\n\nTV-14 Rating\n\nMy take:\nI was a little late to the series but my friends kept nagging me to watch this show so I took the time to download it and did, the moment I watched the first episode I was hooked right away. Took me a whole one and a half week of straight watching just to finish this but it was worth every last bit. The first half of the season is mostly comedy and for laughs but towards the second half it gets emotional. Great 9-year journey for those devoted fans. Loved the ending! Recommend watching it for yourself and don't spoil yourself along the way! It's one of the best new shows in a long while\n\n\nP.S.\nAlso going to be uploading a lot more of these TV shows with metadata patched specifically for iTunes and/or M4V format. These torrents will usually not originally be mine but they will be fixed or re-encoded versions for Apple devices. This one was almost all from maximersks MKV format files, Thank you maximersks.","torrent":{"xt":"urn:btih:5c85863536ceccbca31f938e82ce427eb587833c","amp;dn":"How+I+Met+Your+Mother+Seasons+1-9+iTunes+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c85863536ceccbca31f938e82ce427eb587833c","infoHashBuffer":{"type":"Buffer","data":[92,133,134,53,54,206,204,188,163,31,147,142,130,206,66,126,181,135,131,60]},"announce":[],"urlList":[]}}