{"title":"The Real-Life MBA (2015).epub Gooner","uid":12807114,"size":131017281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c99a61037e2c7b5c1a2b9a5498c3248f88eaf4b&amp;dn=The+Real-Life+MBA+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1448136693,"description":"The Real-Life MBA - Your No-BS Guide to Winning the Game, Building a Team and Growing Your Career (2015).epub Gooner\r\n\r\nPublisher: HarperBusiness (April 14, 2015)\r\nLanguage: English\r\nISBN-10: 0062362801\r\nISBN-13: 978-0062362803\r\n\r\n#1 Wall Street Journal Bestseller and New York Times Bestseller\r\n\r\nThe business titans and #1 New York Times and Wall Street Journal bestselling authors of Winning return with a modern, essential guide for everyone in business today—and tomorrow—that explores the most pressing challenges related to creating winning strategies, leading and managing others, and building a thriving career.\r\n\r\nIn the decade since their blockbuster international bestseller Winning was published, Jack and Suzy Welch have dug deeper into business, traveling the world consulting to organizations of every size and in every industry, speaking before hundreds of audiences, working closely with entrepreneurs from Mumbai to Silicon Valley, and, in 2010, starting their own fully accredited online MBA program, which now has approximately 1,000 students enrolled. Over the same time frame, Jack has advised more than seventy-five companies through private equity, and dozens more in a senior advisory role at IAC. Now, Jack and Suzy Welch draw on their experiences to address the biggest problems facing modern management—and offer pragmatic solutions to overcome them.\r\n\r\nGoing beyond theories, concepts, and ideologies, they tackle the real stuff of work today. When you get down to it, they argue, winning in business is all about mastering the gritty, inescapable, make-or-break, real-life dilemmas that define the new economy, the old economy, and everything in between. Work is a grind. We just got whacked. My boss is driving me nuts. I’m stuck in career purgatory. My team has lost its mojo. IT is holding us hostage. Our strategy is outdated the day we launch it. We don’t know what our Chinese partners are talking about. We’re just not growing. These are some of the day-to-day issues the Welches take on. Coupled with Jack’s years of iconic leadership and Suzy’s insights as former editor of the Harvard Business Review, their new database of knowledge infuses The Real Life MBA with fresh, relevant stories and equally powerful solutions that every manager at any level can use right now","torrent":{"xt":"urn:btih:5c99a61037e2c7b5c1a2b9a5498c3248f88eaf4b","amp;dn":"The+Real-Life+MBA+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c99a61037e2c7b5c1a2b9a5498c3248f88eaf4b","infoHashBuffer":{"type":"Buffer","data":[92,153,166,16,55,226,199,181,193,162,185,165,73,140,50,72,248,142,175,75]},"announce":[],"urlList":[]}}