{"title":"Starbound Series - Amie Kaufman &amp; Megan Spooner","uid":12946897,"size":6134530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cf33960dadaa4f83e742dad903f1c0059cc62bd&amp;dn=Starbound+Series+-+Amie+Kaufman+%26amp%3B+Megan+Spooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":12,"time":1449689621,"description":"01. These Broken Stars [Starbound, #01] - Amie Kaufman &amp; Megan Spooner\r\n\r\nimage\r\n\r\nIt's a night like any other on board the Icarus. Then, catastrophe strikes: the massive luxury spaceliner is yanked out of hyperspace and plummets into the nearest planet. Lilac LaRoux and Tarver Merendsen survive. And they seem to be alone.\r\n\r\nLilac is the daughter of the richest man in the universe. Tarver comes from nothing, a young war hero who learned long ago that girls like Lilac are more trouble than they're worth. But with only each other to rely on, Lilac and Tarver must work together, making a tortuous journey across the eerie, deserted terrain to seek help.\r\n\r\nThen, against all odds, Lilac and Tarver find a strange blessing in the tragedy that has thrown them into each other's arms. Without the hope of a future together in their own world, they begin to wonder-would they be better off staying here forever?\r\n\r\nEverything changes when they uncover the truth behind the chilling whispers that haunt their every step. Lilac and Tarver may find a way off this planet. But they won't be the same people who landed on it.\r\n\r\nThe first in a sweeping science fiction trilogy, These Broken Stars is a timeless love story about hope and survival in the face of unthinkable odds.\r\n\r\n02. This Night So Dark [Starbound, #1.5] - Amie Kaufman &amp; Megan Spooner\r\n\r\nimage\r\n\r\nDon't miss the breathtaking short story that connects the first two novels in the Starbound trilogy, These Broken Stars and This Shattered World.Tarver still has nightmares about the night, six months before the Icarus crash, when he rescued a group of civilian researchers being held hostage by brutal mercenaries. Now Tarver and Lilac must reconcile his memories of that fateful night with the truth that they uncovered on a mysterious planet after the Icarus crashed.\r\n\r\n03. This Shattered World [Starbound, #02] - Amie Kaufman &amp; Megan Spooner\r\n\r\nimage\r\n\r\nJubilee Chase and Flynn Cormac should never have met.\r\n\r\nLee is captain of the forces sent to Avon to crush the terraformed planet's rebellious colonists, but she has her own reasons for hating the insurgents.\r\n\r\nRebellion is in Flynn's blood. His sister died in the original uprising against the powerful corporate conglomerate that rules Avon with an iron fist. These corporations make their fortune by terraforming uninhabitable planets across the universe and recruiting colonists to make the planets livable, with the promise of a better life for their children. But they never fulfilled their promise on Avon, and decades later, Flynn is leading the rebellion.\r\n\r\nDesperate for any advantage against the military occupying his home, Flynn does the only thing that makes sense when he and Lee cross paths: he returns to base with her as prisoner. But as his fellow rebels prepare to execute this tough-talking girl with nerves of steel, Flynn makes another choice that will change him forever. He and Lee escape base together, caught between two sides in a senseless war.\r\n\r\nThe stunning second novel in the Starbound trilogy is an unforgettable story of love and forgiveness in a world torn apart by war.\r\n\r\n04. Their Fractured Light [Starbound, #03] - Amie Kaufman &amp; Megan Spooner\r\n\r\nimage\r\n\r\nA year ago, Flynn Cormac and Jubilee Chase made the now infamous Avon Broadcast, calling on the galaxy to witness for their planet, and protect them from destruction. Some say Flynn's a madman, others whisper about conspiracies. Nobody knows the truth. A year before that, Tarver Merendsen and Lilac LaRoux were rescued from a terrible shipwreck—now, they live a public life in front of the cameras, and a secret life away from the world's gaze. Now, in the center of the universe on the planet of Corinth, all four are about to collide with two new players, who will bring the fight against LaRoux Industries to a head. Gideon Marchant is an eighteen-year-old computer hacker known in Corinth's underworld as The Knave of Hearts. He'll climb, abseil and worm his way past the best security measures to pull off onsite hacks that others don't dare touch. Sofia Quinn has a killer smile, and by the time you're done noticing it, she's got you offering up your wallet, your car, and anything else she desires. She holds LaRoux Industries responsible for the mysterious death of her father and is out for revenge at any cost. When a LaRoux Industries security breach interrupts Gideon and Sofia's separate attempts to infiltrate their headquarters, they're forced to work together to escape. Each of them has their own reason for wanting to take down LaRoux Industries, and neither trusts the other. But working together might be the best chance they have to expose the secrets LRI is so desperate to hide","torrent":{"xt":"urn:btih:5cf33960dadaa4f83e742dad903f1c0059cc62bd","amp;dn":"Starbound+Series+-+Amie+Kaufman+%26amp%3B+Megan+Spooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf33960dadaa4f83e742dad903f1c0059cc62bd","infoHashBuffer":{"type":"Buffer","data":[92,243,57,96,218,218,164,248,62,116,45,173,144,63,28,0,89,204,98,189]},"announce":[],"urlList":[]}}