{"title":"Cake TRUEFRENCH BluRay 720p 2015","uid":13199311,"size":4689650185,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5d529ea6fd680f346ad47eafd29ff2674d585197&amp;dn=Cake+TRUEFRENCH+BluRay+720p+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annuaireweb","files":1,"time":1452527916,"description":"Cake.2014.LIMITED.FRENCH.720p.BluRay.x264-Goatlove\r\n\r\nClaire Bennett (Jennifer Aniston) va mal. Il n'y a qu'à voir ses cicatrices et ses grimaces de douleur dès qu'elle fait un geste pour comprendre qu'elle souffre physiquement. Elle ne parvient guère mieux à dissimuler son mal-être affectif. Cassante et parfois même insultante, Claire cède à l'agressivité et à la colère avec tous ceux qui l'approchent. Son mari et ses amis ont pris leurs distances avec elle, et même son groupe de soutien l'a rejetée. Profondément seule, Claire ne peut plus compter que sur la présence de sa femme de ménage Silvana (Adriana Barraza, citée à l'Oscar), qui supporte difficilement de voir sa patronne accro à l'alcool et aux tranquillisants. Mais le suicide de Nina (Anna Kendrick, également citée à l'Oscar), qui faisait partie de son groupe de soutien, déclenche chez Claire une nouvelle fixation. Tout en s'intéressant à la disparition de cette femme qu'elle connaissait à peine, Claire en vient à s'interroger sur la frontière ténue entre vie et mort, abandon et souffrance, danger et salut. Tandis qu'elle se rapproche du mari de Nina (Sam Worthington) et de leur fils, Claire trouvera peut-être un peu de réconfort…","torrent":{"xt":"urn:btih:5d529ea6fd680f346ad47eafd29ff2674d585197","amp;dn":"Cake+TRUEFRENCH+BluRay+720p+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d529ea6fd680f346ad47eafd29ff2674d585197","infoHashBuffer":{"type":"Buffer","data":[93,82,158,166,253,104,15,52,106,212,126,175,210,159,242,103,77,88,81,151]},"announce":[],"urlList":[]}}