{"title":"Bones.S04E09.HDTV.XviD-LOL","uid":4504784,"size":366774323,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5e756a717f85538eca58410f4e08380f9ef0f1a1&amp;dn=Bones.S04E09.HDTV.XviD-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":2,"time":1226548679,"description":"Bones\n\n\nGenre: Crime, Drama, Mystery\nYear: 2008\nCountry: USA\nLanguage: English\nRuntime: 40-45 minutes\nDirector: Hart Hanson\nCast: Emily Deschanel, David Boreanaz, Michaela Conlin, Eric Millegan\n\n\nBones is an American drama television series that premiered on the Fox Network on September 13, 2005. The series is very loosely \nbased on the works of real-life forensic anthropologist Kathy Reichs, who is herself a producer on the show. Its title character, \nDr. Temperance &quot;Bones&quot; Brennan is named after the protagonist of Reichs&amp;#039; crime novel series. The show is a forensics and police \nprocedural drama in which each episode focuses on an FBI case file concerning the mystery behind the human remains brought to \nDr. Brennan&amp;#039;s forensic anthropology team at the Jeffersonian Institution by FBI Special Agent Seeley Booth.\n\nCreated by Hart Hanson, Bones is a joint production by Josephson Entertainment, Far Field Productions and 20th Century Fox Television.\n[1] The current regular cast members are Emily Deschanel, David Boreanaz, Michaela Conlin, Eric Millegan, T. J. Thyne and Tamara Taylor. \nTwo seasons of Bones have been aired so far and the show has returned for a third season on September 25, 2007.[2]Dr. Temperance Brennan \nis a brilliant, but lonely, anthropologist whom is approached by an ambitious FBI agent, named Seely Booth, \nto help the bureau solve a series of unsolved crimes by identifying the long-dead bodies of missing persons by their bone structure. \nBut both Agent Booth and Dr. Brennan and her team come up again a variety of interference from red tape, corruption, and local noncooperation.","torrent":{"xt":"urn:btih:5e756a717f85538eca58410f4e08380f9ef0f1a1","amp;dn":"Bones.S04E09.HDTV.XviD-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e756a717f85538eca58410f4e08380f9ef0f1a1","infoHashBuffer":{"type":"Buffer","data":[94,117,106,113,127,133,83,142,202,88,65,15,78,8,56,15,158,240,241,161]},"announce":[],"urlList":[]}}