{"title":"Planet Earth: Mountains 1080i.DivX.AC3.mkv","uid":3670986,"size":2375246067,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5f50ec54ef4b940b4920f17b05e0d4a786313dfb&amp;dn=Planet+Earth%3A+Mountains+1080i.DivX.AC3.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bell0q","files":1,"time":1177286004,"description":"Planet Earth: Mountains \nVideo: MKV, 3viX 4.5.1 (DivX), 1080i HD\nResolution: 1920x1080 (1.77:1)\nFPS: 29.97 6200fps\nAudio: AC3 5.1+LFE, 48kHz, 384kbps\nTotal Bitrate: ~6.2Mbps\nDuration: 49:41\nSource: HDTV, Discovery HD Theater\nNotes: minor audio desync near end if you have a slow (less than 3GHz) machine.\n\n\nDescription: Humans like to think that once they&amp;#039;ve climbed a peak, they&amp;#039;ve somehow conquered it. But they can only ever be visitors to this hostile world.\n\nPlanet Earth introduces the &amp;#039;real&amp;#039; mountaineers and discovers the secrets of their survival on the mightiest peaks of our planet.\n\nWelcome to an extreme landscape of rock, ice and snow; a vertical world as alien to humans as the surface of another planet.\n\nPlanet Earth takes you on a tour of its mightiest mountain ranges, starting with the birth of a mountain at one of the lowest places on Earth and ending at the summit of Everest.\n\nMountains are home to some of the shyest and most secretive animals on the planet, and this programme will show how they rise to the challenge of mountain life.\n\nIn Ethiopia, Planet Earth ventures into the heart of a volcano to discover one of earth&amp;#039;s rarest phenomena, a lava lake that&amp;#039;s been erupting for over 100 years. The same forces built the Simian Mountains, home to troops of gelada baboons nearly a thousand strong.\n\nIn the Andes, a family of five puma struggle to survive the most unstable mountain weather on the planet.\n\nSurviving the full force of an avalanche in the Rockies are grizzlies that spend their winters denning inside the dangerous slopes. In summer the bears climb the peaks in search of moths which they devour by the thousand.\n\nFrom the icy core of a glacier in the Alps to the largest glacier in the world, this realm of giant peaks is home to the highest land predator on the planet - the snow leopard. Astounding images of the snow leopard hunting on the Pakistan peaks are a world first.\n\nThe wildlife spectacles continue with the first footage of a wild Giant Panda nursing her week-old baby in a mountain cave in China, and an aerial journey alongside demoiselle cranes as they attempt to cross the largest range of mountains on our planet, the Himalayas.","torrent":{"xt":"urn:btih:5f50ec54ef4b940b4920f17b05e0d4a786313dfb","amp;dn":"Planet+Earth%3A+Mountains+1080i.DivX.AC3.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f50ec54ef4b940b4920f17b05e0d4a786313dfb","infoHashBuffer":{"type":"Buffer","data":[95,80,236,84,239,75,148,11,73,32,241,123,5,224,212,167,134,49,61,251]},"announce":[],"urlList":[]}}