{"title":"Sevasadan Upanyas-Hindi","uid":9574345,"size":22030762,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f67690be2598295f5152322a671c03bc67eebc4&amp;dn=Sevasadan+Upanyas-Hindi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bhayaji007","files":1,"time":1391681282,"description":"&quot;Sevadasan&quot; is a novel set in Varnasi, one of India's holiest cities and it examines the descent of one very beautiful Brahmin lady, Suman, from rich, doted-on daughter to prostitute. Suman's luck changed all because her father ( a highly-respected police inspector) succumbed to taking a bribe so that he could incur the dowry expenses for her wedding. He was sent to jail and after his wife spent all their earnings trying to have him released, Suman was sent to her uncle's house where she was ill-treated by his family. In India, especially in the early part of the 20th century, it was a herculian task trying to marry off a penniless girl, but Suman's uncle, Umanath, managed to find her a poor man, Gajadhar, to marry but Suman, who had been used to luxuries in her father's house, found it very hard to be the perfect wife to a poor man. Finally, her husband, dissatisfied with her as a wife, asked her to leave. Having nowhere to go, Suman becomes a tawai'if or courtesan.\n\nBeing a courtesan in those days was to have sunk to the lowest low. If a courtesan had siblings it is unlikely anyone would ever marry them because of their association to the courtesan, but, at the same time, courtesans effortlessly held sway over all the rich and powerful men of the village who would throng to their dance and song performances every night. Through &quot;Sevadasan&quot; Premchand exposes the double standards of the leaders of those days. Suman finally ends up in Sevasadan (House of Service) an educational institution set up by the social reformers of that time to house reformed courtesans.\n","torrent":{"xt":"urn:btih:5f67690be2598295f5152322a671c03bc67eebc4","amp;dn":"Sevasadan+Upanyas-Hindi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f67690be2598295f5152322a671c03bc67eebc4","infoHashBuffer":{"type":"Buffer","data":[95,103,105,11,226,89,130,149,245,21,35,34,166,113,192,59,198,126,235,196]},"announce":[],"urlList":[]}}