{"title":"Edison Glass - Discography (2006-2008) [FLAC]","uid":9021904,"size":1029891215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f836efedbdd842a079ead93fad282c1c19d6acb&amp;dn=Edison+Glass+-+Discography+%282006-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1381284278,"description":"\n  Edison Glass - Discography (2006-2008) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Punk, Emo, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2006 A Burn or a Shiver \n\n  An emo-sounding band with complex instrumentation -- sounds familiar, eh? If you're a rock fan in the early 21st century, it certainly should, as it seems like just about every up-and-coming melodic rock band owed a thing or two to the aforementioned style/approach. And the Long Island, NY, outfit Edison Glass certainly fits this description on their 2006 debut, A Burn or a Shiver. Singers Joshua Silverberg (who doubles on guitar) and Mountain Morin (who doubles on bass) certainly have the &quot;dual melodic vocal emo thing&quot; down pat, while Silverberg and second guitarist James Usher have no problem alternating between clean guitar picking and washes of power chords. But the group's roots prove to be different than most of the competition -- the complex orchestral arrangements of Bach and the reggae-pop of the Police (the latter of which is evidenced at times by Silverberg and Usher's Andy Summers-esque chord voicings). While there is certainly a familiarity to the proceedings, such standout tracks as &quot;Today Has Wings&quot; and the album-opening &quot;My Fair One&quot; prove that Edison Glass is a cut above your average emo band. You get the feeling that if Edison Glass can keep forging forward and inject more of their own style and personality into the sonic stew, the quartet can turn into something truly special over the course of several albums. Keep your eyes and ears peeled.\n\n  2008 Time is Fiction\n\n  Kudos to the artsy foursome for creating a force of indie rock that clearly swims a direction opposite to the tide. The sophomore effort by Credential Recordings' Edison Glass is an overlooked gem for faith-based fans of alternative rock. A combination of Death Cab for Cutie and House of Heroes, the sound works because of its array of styles that are diverse yet cohesive. The boys use of atmospheric rock and jangle pop elements in between experimental jazz creates a whole much better than the sum of its parts. The album ultimately triumphs without an accessible standout hit. This isn't by accident, as Joe Morin sings, &quot;I'll take my chances/Now I can climb to see what I need to&quot; -- an indication that the band knows well its place and the type of listener who will catch on to what they are saying. While it may be an acquired taste for those used to a diet of soundalike Christian music, the group's unpredictable changes in song form and instrumentation suggest a creativity in songwriting absent from many of their contemporaries songbooks.","torrent":{"xt":"urn:btih:5f836efedbdd842a079ead93fad282c1c19d6acb","amp;dn":"Edison+Glass+-+Discography+%282006-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f836efedbdd842a079ead93fad282c1c19d6acb","infoHashBuffer":{"type":"Buffer","data":[95,131,110,254,219,221,132,42,7,158,173,147,250,210,130,193,193,157,106,203]},"announce":[],"urlList":[]}}