{"title":"The Jim Henson Hour Dog City Uncut Muppets DVD","uid":7694546,"size":3862268057,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f9172ea075f7e12fc9f75e3a676ac646b7fff78&amp;dn=The+Jim+Henson+Hour+Dog+City+Uncut+Muppets+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tygerbug","files":88,"time":1349317657,"description":"Here's an uncut Muppet classic for you. Jim Henson won a Primetime Emmy in 1989 for \ndirecting Dog City, and rightly so. This dog-filled parody of 30s and 40s film noir \ngangster films will have you howling with laughter! And here it is with 10 minutes \nof Kermit and company not available on DVD!\n\nAs Rowlf the Dog will tell you, there are a thousand tails tucked away in the mean \nstreets of Dog City. It's a dog-eat-dog world where good mutts live in fear of \nmurderous gangster Bugsy Them and his love of senseless violence. Ace Yu is a \nGerman ex-shepherd who inherits a saloon, The Doghouse, from his late Uncle Harry. \nUnwilling to pay protection money to Bugsy, Ace teams up with a runaway collie \nnamed Colleen to take on Bugsy and his gang.\n\n\nThe 40-minute special inspired a mediocre animated/puppet series on FOX in the 90s, \nin which Kevin Clash and Fran Brill reprised their roles - sort of.\n\nDog City has been released on DVD in the US and UK, but is missing 10 minutes of \nmaterial from when it originally aired as part of NBC's wonderful but short-lived \nThe Jim Henson Hour. Kermit, Digit, Bean Bunny and friends introduced the film as \npart of Muppet Night at the Movies, with Bean Bunny showing two trailers for his \nown feature films, and the All-Dog Network taking us behind the scenes to the \nunfortunate life of a Hollywood &quot;stunt dog&quot; (cat).\n\nArguably, The Jim Henson Hour showed the Muppet team at their creative peak, with \nremarkable live-action fantasy like The Storyteller sharing space with Kermit and \nthe Muppet gang. However, the series failed in the ratings and was quickly \ncancelled. Although certain Jim Henson projects from this era have made it to DVD \nor VHS [The Storyteller, Song of the Cloud Forest, Monster Maker, Miss Piggy's \nHollywood], no complete and uncut Jim Henson Hour episode has ever been released on \nDVD or any other format - with one exception.\n\n\nKSS Films in Japan released a very rare laserdisc of Jim Henson's Dog City, which \nwas dubbed in Japanese but otherwise contained the full Jim Henson Hour episode, \nincluding ten minutes with Kermit and company.\n\nSo here we are then, for the first time in DVD quality. The Jim Henson Hour: Dog \nCity.\n\n\nDog City was written by Tim Burns and stars Kevin Clash, Jim Henson, Fran Brill, \nCamille Bonora, and Jerry Nelson. MuppetTelevision features Steve Whitmire and Dave \nGoelz and a top writing staff including Jerry Juhl, Chris Langham and Bill Prady.\n\nDesigned to look like a retail DVD, this disc is filled with great special features \nas a tribute to The Jim Henson Hour.\n\nYou'll see:\n\n* Dog City Japanese dub\n* Dog City restored NBC TV advertisement\n* Dog City animated episode &quot;The Big Squeak&quot;\n* Behind the Scenes Gallery\n* Rare promo film for The Jim Henson Hour with Kermit and Ace Yu on the set of Dog \nCity\n* Jim Henson Hour clips: &quot;Sweet Vacation,&quot; &quot;Bobby McFerrin,&quot; &quot;Secrets of the \nMuppets,&quot; &quot;Lighthouse Island&quot;\n* Jim Henson Hour Lion Outtake\n* World of Jim Henson &quot;Jim Henson Hour&quot; montage\n* And two easter eggs!\n","torrent":{"xt":"urn:btih:5f9172ea075f7e12fc9f75e3a676ac646b7fff78","amp;dn":"The+Jim+Henson+Hour+Dog+City+Uncut+Muppets+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f9172ea075f7e12fc9f75e3a676ac646b7fff78","infoHashBuffer":{"type":"Buffer","data":[95,145,114,234,7,95,126,18,252,159,117,227,166,118,172,100,107,127,255,120]},"announce":[],"urlList":[]}}