{"title":"Referring Expressions in English and Japanese","uid":6714570,"size":1376346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fc594ab5d90b5d8ca5e948c785e2bde7c5e0e2d&amp;dn=Referring+Expressions+in+English+and+Japanese&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chami1988","files":-1,"time":1317491855,"description":"John Benjamins (6-2011) | PDF | 224 pages | 9027256128 |\n\n\nReferring Expressions in English and Japanese: Patterns of use in dialogue processing /by Etsuko Yoshida. It is a major challenge for linguists to explore the relations between referential choice and the discourse structure in dialogues, because, unlike written modes of discourse, dialogue as an interactional mode of discourse needs careful treatment for linguistic analysis. \n\nThis book investigates how discourse entities are linked with topic chaining and discourse coherence by showing that the choice and the distribution of referring expressions is correlated with center transition patterns in the centering framework. It provides original empirical research into the use of referring expressions in English and Japanese task-based dialogues, and applies and extends theoretical frameworks which attempt to account for local and global discourse coherence. Using a discourse-based integrated approach to anaphora resolution, Yoshida proposes a unified account on the patterns of use of referring expressions. The book will be of interest to discourse analysts, computational linguists, scholars of semantics and pragmatics, and cross-linguistics researchers.","torrent":{"xt":"urn:btih:5fc594ab5d90b5d8ca5e948c785e2bde7c5e0e2d","amp;dn":"Referring+Expressions+in+English+and+Japanese","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc594ab5d90b5d8ca5e948c785e2bde7c5e0e2d","infoHashBuffer":{"type":"Buffer","data":[95,197,148,171,93,144,181,216,202,94,148,140,120,94,43,222,124,94,14,45]},"announce":[],"urlList":[]}}