{"title":"Loren The Amazon Princess v1.2.9 +The Castle of N'Mar","uid":11957454,"size":106453735,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5fc78b9a49e170d9c02d93cd3f2df1561fb175a9&amp;dn=Loren+The+Amazon+Princess+v1.2.9+%2BThe+Castle+of+N%27Mar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rukazer","files":3,"time":1432474496,"description":"About This Game\n\nLoren The Amazon Princess is a fantasy epic combining intricate turn-based battles with a heroic tale of overcoming evil -- with a twist! In this tale, you play as a loyal servant of the hero rather than the hero herself.\n\nTravel by Princess Loren's side as she searches for her lost mother, the Queen of the Amazons. Guide her choices and act as her valiant defender, meeting many colorful characters along the way. As the journey progresses, everyone will grow and change -- character development in games isn't dead! It's also impossible to see all the content in just one playthrough, with so many ways to customize the characters.\n\nHardcore role-playing games with replay value are becoming rarer in today's age of simplification for the masses. The developers of the hit title Planet Stronghold have dedicated themselves to keeping old-school RPGs alive through this new adventure.\nGame Features\nCustomize Your Hero: Play as a male or female warrior or thief. Decide their backstory, initial stats, and personality. Help them rise from humble servant to legendary hero!\n\nTrain Your Characters: Select everyone's skills, weapons, and armor. Over 500 items can be used in 13 armor slots. Class-based skill trees combine with unique character-specific skill trees such as &quot;Gladiator&quot; or &quot;Assassin&quot;.\n\nBattles Demand Strategy: Your tactics will be challenged by over 100 enemies: take advantage of weaknesses and achieve combos with your characters by inflicting and then exploiting status effects. All that character customization has a major effect on how each battle plays out. But never fear: choose between two different modes of play when you start the game, as well as your desired difficulty level.\n\nStory-based Gameplay: Over two novels' worth of in-game text depict vivid characters and flesh out a strong plot that reflects your decisions. Optional interactions abound, such as talking with your party members at camp to learn more about them -- or even to uncover a romance.\n\nInclusive to all demographics. A wide range of romantic interests are provided.\n\nTheme song composed by Matthew Myers and performed by Christina Vee, game soundtrack by Michael Chait","torrent":{"xt":"urn:btih:5fc78b9a49e170d9c02d93cd3f2df1561fb175a9","amp;dn":"Loren+The+Amazon+Princess+v1.2.9+%2BThe+Castle+of+N%27Mar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc78b9a49e170d9c02d93cd3f2df1561fb175a9","infoHashBuffer":{"type":"Buffer","data":[95,199,139,154,73,225,112,217,192,45,147,205,63,45,241,86,31,177,117,169]},"announce":[],"urlList":[]}}