{"title":"Handbook of Surfaces and Interfaces of Materials","uid":14936271,"size":157296008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5feb177445b898e5803af315c5e764719a91d146&amp;dn=Handbook+of+Surfaces+and+Interfaces+of+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465999899,"description":"Handbook of Surfaces and Interfaces of Materials - Hari Singh Nalwa (AP, 2001).pdf\r\n\r\nThis handbook brings together, under a single cover, all aspects of the chemistry, physics, and engineering of surfaces and interfaces of materials currently studied in academic and industrial research. It covers different experimental and theoretical aspects of surfaces and interfaces, their physical properties, and spectroscopic techniques that have been applied to a wide class of inorganic, organic, polymer, and biological materials.\r\nThe diversified technological areas of surface science reflect the explosion of scientific information on surfaces and interfaces of materials and their spectroscopic characterization. The large volume of experimental data on chemistry, physics, and engineering aspects of materials surfaces and interfaces remains scattered in so many different periodicals, therefore this handbook compilation is needed.\r\nThe information presented in this multivolume reference draws on two decades of pioneering research on the surfaces and interfaces of materials to offer a complete perspective on the topic. These five volumes-Surface and Interface Phenomena; Surface Characterization and Properties; Nanostructures, Micelles, and Colloids; Thin Films and Layers; Biointerfaces and Applications-provide multidisciplinary review chapters and summarize the current status of the field covering important scientific and technological developments made over past decades in surfaces and interfaces of materials and spectroscopic techniques with contributions from internationally recognized experts from all over the world. Fully cross-referenced, this book has clear, precise, and wide appeal as an essential reference source long due for the scientific community.\r\n\r\nThe complete reference on the topic of surfaces and interfaces of materials\r\nThe information presented in this multivolume reference draws on two decades of pioneering research\r\nProvides multidisciplinary review chapters and summarizes the current status of the field\r\nCovers important scientific and technological developments made over past decades in surfaces and interfaces of materials and spectroscopic techniques\r\nContributions from internationally recognized experts from all over the world","torrent":{"xt":"urn:btih:5feb177445b898e5803af315c5e764719a91d146","amp;dn":"Handbook+of+Surfaces+and+Interfaces+of+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5feb177445b898e5803af315c5e764719a91d146","infoHashBuffer":{"type":"Buffer","data":[95,235,23,116,69,184,152,229,128,58,243,21,197,231,100,113,154,145,209,70]},"announce":[],"urlList":[]}}