{"title":"Ice Cream Sandwich 4.0.3 Firmware for Samsung Galaxy S 2","uid":7230160,"size":1107464263,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:604edfbd9a3b05db5bcb4ad71900fb8388d70b94&amp;dn=Ice+Cream+Sandwich+4.0.3+Firmware+for+Samsung+Galaxy+S+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"icepax","files":6,"time":1335808941,"description":"ICE CREAM SANDWICH 4.0.3 FIRMWARE FOR SAMSUNG GALAXY S 2\n\n\n------------\nChange Log:\n------------\n1. None. Samsung likes to surprise you!\n\n\n---------\nCredits:\n---------\n1. XWLP8 Stock Kernel firmware courtesy of Intratech.\n2. CF-Root firmware courtesy of Chainfire.\n\nYou can find Intratech and Chainfire and their excellent works for the Android platform at: http://forum.xda-developers.com.\n\n\n------\nNote:\n------\nFirmware tested and worked on Samsung Galaxy S2 mobile phones. The firmware, if update is successful, will upgrade your phone to:\n\na. Android Version: 4.0.3\nb. Baseband Version: I9100XXLPS\nc. Kernel Version: 3.0.15-I9100XWLP8-CL356487 dpi@DELL173 #3\nd. Build Number: IML74K.XWLP8\n\nThis firmware is a vanilla release from Samsung so it does not have any provider's crap in it. Users have informed me that the firmware worked in Australia.\n\nIf you're in another region, you can try this firmware too as it has support for the following languages: English, Cestina, Dansk, Deutsch, Espanol, Estonian, Francais, Hrvatski, Icelandic, Irish, Italiano, Kazakh, Korean, Latviesu, Lietuviu, Macedonian, Magyar, Nederlands, Norsk, Polski, Portugues, Romana, Slovencina, Suomi, Svenska, Turkce, Uzbek and some other languages I can't pronounce.\n\n\n------------\nDISCLAIMER:\n------------\nYOU HEREBY ACKNOWLEDGE BY USING THE SOFTWARES INCLUDED IN THIS TORRENT THAT I'M NOT LIABLE FOR ANY DAMAGE OR BE HELD RESPONSIBLE IN ANY WAY, WHETHER EXPLICIT OR IMPLIED, IF YOU BRICK OR TURN YOUR PHONE INTO A USELESS PAPERWEIGHT. YOU ARE USING THE SOFTWARES AT YOUR OWN RISK.\n\n\n---------------------------\nPrerequisite requirements:\n---------------------------\n1. A rooted Samsung Galaxy S2 Phone.\n\n2. IMPORTANT: If you upgrade via a PC, ensure you have a constant power supply source when you flash the firmware onto your phone. Otherwise, any power outage, will inevitably brick your phone in the process. Best to have your PC connected to a UPS unit in case the power supply from your provider suddenly stopped (i.e. power outage).\n\n\n-------------------------------------\nSteps to install Ice Cream Sandwich:\n-------------------------------------\n\n1. Shut down your phone.\n\n2. Boot your phone into Download mode i.e. Hold Volume Down + Home + Power buttons down simultaneously. Then, press Volume Up button to initiate Download mode.\n\n3. Plug in phone's USB cable: one end into your phone's connector and the other to your PC's USB port or Hub.\n\n4. If you haven't installed the USB drivers in Windows for your Samsung phone, then run &quot;Samsung Mobile Phones USB Drivers 1.4.103.0.exe&quot;. Otherwise, skip this step.\n\n5. Open Odin3 (This version runs in Windows only) and check only &quot;Auto Reboot&quot; and &quot;F. Reset Time&quot; options.\n\n6. Click the &quot;PDA&quot; button and select &quot;GT-I9100_XSA_PDAXWLP8_PHONEXXLPS_CSCXSALP4.tar&quot;. Then hit the &quot;Start&quot; button and wait.\n\n7. Once Odin3 signalled &quot;PASS!&quot;, unplug phone's USB cable. You will now have Ice Cream Sandwich 4.0.3 firmware on your phone.\n\n\n----------\nOptional:\n----------\nTo enable Root permission (i.e. full access) for your phone, you'll need to flash your phone first with:\n\n1. Repeat the above steps (where applicable) but in Step 6 select \n\n&quot;CF-Root-SGS2_XW_XSA_LP8-v5.4-CWM5.tar&quot;\n\nthen with:\n\n1. Repeat the above steps (where applicable) but in Step 6 select &quot;GT-I9100 XWLP8 Stock \n\nKernel.tar&quot;.\n \n\nEnjoy.\n","torrent":{"xt":"urn:btih:604edfbd9a3b05db5bcb4ad71900fb8388d70b94","amp;dn":"Ice+Cream+Sandwich+4.0.3+Firmware+for+Samsung+Galaxy+S+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604edfbd9a3b05db5bcb4ad71900fb8388d70b94","infoHashBuffer":{"type":"Buffer","data":[96,78,223,189,154,59,5,219,91,203,74,215,25,0,251,131,136,215,11,148]},"announce":[],"urlList":[]}}