{"title":"It Happened Here (1965) directed by Kevin Brownlow","uid":7995337,"size":728625128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:606bbfa3a38d98eec2630d5c48e51ccb1b8cb3fc&amp;dn=It+Happened+Here+%281965%29+directed+by+Kevin+Brownlow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":3,"time":1357598646,"description":"Title: It Happened Here\nDirected and produced by Kevin Brownlow\nRuntime: 1:36:24\n\nIMDb:  tt0055024\n\n\n\nThose who have seen the recent torrent called &quot;Winstanley&quot; by Kevin Brownlow will enjoy \nthis first effort by Brownlow and Andrew Mollon\n\n\nExcerpted from the Wiki:\n\nThe film was directed by Kevin Brownlow, who later became a prominent film historian, and Andrew Mollo, who was to become a leading military historian. Brownlow developed the concept of the film when he was eighteen, in 1956. He turned to Mollo, a sixteen-year-old history buff, to help him with the design of costumes and sets. Mollo was intrigued by the project, and became his collaborator.\n\nThe film was in the making for the next eight years, which the Guinness Book of World Records (as of 2003) calls the longest ever production schedule. It was shot in black and white on 16 mm film, giving it a grainy, newsreel feel. The audio quality (and lighting) on the opening reel is rather poor, which makes the dialog difficult to follow for the first few minutes. It had a cast of hundreds, all volunteers, with only two professional actors among them (Sebastian Shaw, Reginald Marsh). (A number of the extras in the film were members of British science fiction fandom, and a portion was previewed at a science fiction convention in Peterborough.\n\nend excerpt.\n\n\nMy notes\n\n\n  Using volunteers in the manner that Peter Watkins does drew me to this film.  It is similar to &quot;The War Game&quot; and &quot;Colloden.&quot;  My local library had purchased it but at the time I knew nothing of Brownlow until the re-release of Winstanley (2009).\n\n  Though not a do it youself effort in the practical sense of the term, &quot;It Happened Here&quot; shows what can be done with minimal production equipment.  The subject of occupation is current.  A comparison of &quot;It Happened Here&quot; with the recent television series &quot;Jericho&quot; is recommended.\n\n   A further exploration of how &quot;newsreel&quot; footage was used in the depiction of war is in &quot;The Victors&quot; (1963)  by Carl Foreman  and currently available on torrents.  For me it is quite telling the difference between what Hollywood stars did in &quot;The Victors&quot; as compared with any crop of Young Lions today.  It's not only telling, it's disheartening.  &quot;The Victors&quot; is one of the great anti-war films.\n\nNotes written January 7th, 2013","torrent":{"xt":"urn:btih:606bbfa3a38d98eec2630d5c48e51ccb1b8cb3fc","amp;dn":"It+Happened+Here+%281965%29+directed+by+Kevin+Brownlow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"606bbfa3a38d98eec2630d5c48e51ccb1b8cb3fc","infoHashBuffer":{"type":"Buffer","data":[96,107,191,163,163,141,152,238,194,99,13,92,72,229,28,203,27,140,179,252]},"announce":[],"urlList":[]}}