{"title":"Bach- Cantatas-Suzuki","uid":4284880,"size":1119765834,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60f69afa8c9808d4daf1bb22a70722e00aba1ed9&amp;dn=Bach-+Cantatas-Suzuki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Permanentus","files":123,"time":1215634599,"description":"J.S. Bach:\n\ncantatas recorded by Masaaki Suzuki and the Bach Collegium Japan, vols. 1-2-3\n\n &lt;a href=&quot;\nhttp://www.bach-cantatas.com/Performers/Suzuki-Vol2.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bach-cantatas.com/Performers/Suzuki-Vol2.htm&lt;/a&gt; (etc.)\n\n\nVolumes 1 and 2 of the Bach Collegium Japan&amp;#039;s Bach cantata cycle concentrated on the composer&amp;#039;s earliest cantatas, written during his two-year tenure as organist at MÃƒÂ¼hlhausen. These cantatas include many memorable moments that clearly indicate how the youthful Bach was experimenting with different instrumental combinations and determining how effective they could be in reinforcing the texts. After Muehlhausen, Bach moved to Weimar to assume the post of court organist. His cantata output nearly ceased and didn&amp;#039;t fully resume until six years later. To put it bluntly, he was a bit rusty - and although they&amp;#039;re well crafted, the four Weimar cantatas offered here generate little of the excitement and display only a trace of the risk-taking exhibited by the works performed in the previous volumes. Nowhere in these pieces does Bach score for percussion, and only twice (in BWV 12) is a trumpet utilized: and even then its potential is relatively downplayed. With very few exceptions, the arias and recitatives tend to be more linear, even-keeled, and ultimately undramatic. Regardless, even low-key Bach is still grand if perhaps not glorious, and Suzuki&amp;#039;s heartfelt renderings of these cantatas are sure to please. \n\nOne of the best things about this third volume is that we hear much more of countertenor Yoshikazu Mera, who was featured only infrequently on Vol. 2. Here he sings in all four cantatas, and his seamless, luminous voice is as irresistible as it is convincing. With its many subtle sustained vocal runs, the opening aria of BWV 54 affords Mera ample opportunity to display his remarkable talent. In his duets with bass Peter Kooij and tenor Makoto Sakurada in BWV 162, Mera beautifully complements his colleagues. It&amp;#039;s well known that at this time Bach was becoming more influenced by Italian style, which explains why he began to include more countertenor arias in his cantatas. And with a countertenor of Mera&amp;#039;s caliber, we can appreciate both Bach&amp;#039;s affinity for the voice and a first-class realization of its expressive possibilities. It should also be noted that in BWV 162 Suzuki has reconstructed the third-movement soprano aria because of a missing obbligato part (which incidentally didn&amp;#039;t stop Nikolaus Harnoncourt from performing what remains of the piece in spite of how undernourished it sounds). Here, after much consideration (painstakingly outlined in the notes), Suzuki opts to supplement the soprano&amp;#039;s role with a recorder obbligato as well as a cello to heighten the organ continuo. The results couldn&amp;#039;t be lovelier, with Yoshimichi Hamada&amp;#039;s lilting recorder beautifully complementing Yumiko Kurisu&amp;#039;s light soprano. BIS&amp;#039;s sound continues to be first rate, with everything superbly integrated in a dry, believably proportionate acoustic space. Likewise, the thorough notes by Tadashi Isoyama and Suzuki remain as erudite and informative as they were in previous volumes. While less than top-drawer Bach, performances of these Weimar cantatas simply don&amp;#039;t get any better.\n\n[i]John Greene, Classictoday.com[/i]\n","torrent":{"xt":"urn:btih:60f69afa8c9808d4daf1bb22a70722e00aba1ed9","amp;dn":"Bach-+Cantatas-Suzuki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f69afa8c9808d4daf1bb22a70722e00aba1ed9","infoHashBuffer":{"type":"Buffer","data":[96,246,154,250,140,152,8,212,218,241,187,34,167,7,34,224,10,186,30,217]},"announce":[],"urlList":[]}}