{"title":"BalabolkaPortable","uid":7792333,"size":10106251,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6159a8ac764ad9782e0ccfe02e66adf52bbad57a&amp;dn=BalabolkaPortable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wearehidden","files":96,"time":1352054909,"description":"Balabolka is a Text-To-Speech (TTS) program. All computer voices installed on your system are available to Balabolka. The on-screen text can be saved as a WAV, MP3, MP4, OGG or WMA file. The program can read the clipboard content, view the text from AZW, CHM, DjVu, DOC, EPUB, FB2, HTML, LIT, MOBI, ODT, PRC, PDF and RTF files, customize font and background colour, control reading from the system tray or by the global hotkeys. The program uses various versions of Microsoft Speech API (SAPI); it allows to alter a voice's parameters, including rate and pitch. The user can apply a special substitution list to improve the quality of the voice's articulation. This feature is useful when you want to change the spelling of words. The rules for the pronunciation correction use the syntax of regular expressions. Balabolka can save the synchronized text in external LRC files or in MP3 tags inside the audio files. When an audio file is played with players on a computer or on modern digital audio players, the text is displayed synchronously (at the same way, as lyrics for songs).","torrent":{"xt":"urn:btih:6159a8ac764ad9782e0ccfe02e66adf52bbad57a","amp;dn":"BalabolkaPortable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6159a8ac764ad9782e0ccfe02e66adf52bbad57a","infoHashBuffer":{"type":"Buffer","data":[97,89,168,172,118,74,217,120,46,12,207,224,46,102,173,245,43,186,213,122]},"announce":[],"urlList":[]}}