{"title":"Adams-Legalized Crime of Banking&amp;Constitutional Remedy(1958)","uid":4531152,"size":464878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6217bd6e28fe621126e682a353bb879be7bdcfe8&amp;dn=Adams-Legalized+Crime+of+Banking%26Constitutional+Remedy%281958%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1227558849,"description":"This is Silas Walter Adams&amp;#039;s amazing book The Legalized Crime of Banking and a Constitutional Remedy (1958) which is a powerful expose of the criminal US Federal Reserve System, dealing principally with the unconstitutional creation of money and the control of credit by private corporations. The american version of a central bank is no better than others as they alone have the monopoly on issuing the worthless paper currency backed by nothing but the blind faith of population in money. The money isn&amp;#039;t simply &quot;given&quot; to the government but is loaned for shark-high interest rates which eventually plunge the whole country into one giant public debt which offcourse will never be repaid back, enabling the bankers to slowly but surely take control over the whole country as people would rather give away their lives than burn the worthless money they are carrying in their purses. The author suggests a concrete, simple solution, which Congress could employ, which would make the transition from private banking to the Treasury without injuring anyone enjoying a constitutional right, or without upsetting our normal course of trade, industry, and agriculture. Under US constitution such a bank should never exist in the first place as the right to coin money is given to the Congress alone but what can one do if some clever guys did exactly what was never intended to be done. Well, Adams knows full well what had to be done in the past and the same still applies today. 145 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:6217bd6e28fe621126e682a353bb879be7bdcfe8","amp;dn":"Adams-Legalized+Crime+of+Banking%26Constitutional+Remedy%281958%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6217bd6e28fe621126e682a353bb879be7bdcfe8","infoHashBuffer":{"type":"Buffer","data":[98,23,189,110,40,254,98,17,38,230,130,163,83,187,135,155,231,189,207,232]},"announce":[],"urlList":[]}}