{"title":"HISTORY OF POP AND ROCK MUSIC - part 380","uid":7213260,"size":1110969400,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:623aeedb61e5beb7f0f35feea2e9d2b6561efe70&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+380&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1335308099,"description":"\nPART  380\n\n\nTHE PRETTY RECKLESS - Make Me Wanna Die (2010)\nTHE PRETTY RECKLESS - Miss Nothing (2010) \nTHE PRETTY RECKLESS - Just Tonight (2010) \nTHE PRETTY RECKLESS - You (2010)\nTHE PRETTY RECKLESS - My Medicine (2012)\nLANA DEL REY - Blue Jeans (Official Video) (2012)\n\n\n\nThe Pretty Reckless are an American alternative rock band from New York. Their debut album, &quot;Light Me Up&quot;, was released on August 30, 2010 in the UK. The album spawned three moderately successful singles most notable; &quot;Make Me Wanna Die&quot;, which topped the UK Rock Charts upon release. The band released their second EP entitled, &quot;Hit Me Like a Man&quot; in early 2012 along with two brand new music videos of songs previously heard on their debut effort. \n&quot;Make Me Wanna Die&quot; was written by Taylor Momsen, Kato Khandwala, Ben Phillips, and produced by Khandwala for their debut studio album, &quot;Light Me Up&quot; (2010). It was released on March 30, 2010 in the United States, as the band's debut single. The intro of the song features a reworked sample of Abba's song &quot;Lay All Your Love On Me&quot;.CHARTS : UK Rock (The Official Charts Company) - # 1, UK Singles (Official Charts Company) - # 16 : European Hot 100 - # 57. \n&quot;Miss Nothing&quot; is the second single by Pretty Reckless to be released from their debut album, &quot;Light Me Up&quot;. The single was released in the U.S. on 27 July 2010 and in the UK on 22 August 2010.\nLead singer, Taylor Momsen, said the song was about &quot;Mary Magdalene after the crucifixion of Jesus.&quot;\n&quot;It is about how Mary felt, and how she was grieving, but I think a lot of people can relate to it.&quot; \n&quot;Just Tonight&quot; is the third single by The Pretty Reckless, taken from their debut studio album.The release date for the single was originally announced as 9 November 2010 before being put back to 13 December. The release date was put back again to 27 December when it was released on digital download. &quot;Just Tonight&quot; received mostly positive reviews from critics. Robert Copsey on Digital Spy gave it four out of five stars, saying &quot;A song about being stuck in a flagging relationship may not tread any new lyrical ground, but when it's backed by a chunky pop/rock melody, thrashing guitars and oh-so smoky vocals, the result is more gratifying than that first sip of blue WKD round ya mate's&quot;. Fraser McAlpine on BBC Radio 1's The Chart Blog gave the song four stars, praising singer Taylor Momsen's vocals and describing the song as &quot;a thoughtful, hurt sort of a song&quot; that &quot;plays straight - from the heart to the heart - and is all the better for it&quot;.\n\n&quot;Blue Jeans&quot; is a song by Lana Del Rey, taken from her second studio album &quot;Born to Die&quot;. The song was released as the singer's third single on April 8, 2012 through Interscope Records. A new official music video was directed by Del Rey and premiered on March 19, 2012.","torrent":{"xt":"urn:btih:623aeedb61e5beb7f0f35feea2e9d2b6561efe70","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+380","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"623aeedb61e5beb7f0f35feea2e9d2b6561efe70","infoHashBuffer":{"type":"Buffer","data":[98,58,238,219,97,229,190,183,240,243,95,238,162,233,210,182,86,30,254,112]},"announce":[],"urlList":[]}}