{"title":"American Cinema of the 1980s Themes and Variations (pdf){Zzzzz}","uid":11524811,"size":2413734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:624ca2fa000f96ae8f3dfc47d41067d3350e57ca&amp;dn=American+Cinema+of+the+1980s+Themes+and+Variations+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416519884,"description":"During the 1980s, American cinema underwent enormous transformations. Blockbusters like Raiders of the Lost Ark, E.T., and The Empire Strikes Back grabbed huge revenues for the studios. At the same time, the growth of home video led to new and creative opportunities for independent film production, resulting in many of the decade's best films. Both large- and small-scale filmmakers responded to the social, political, and cultural conditions of the time. The two-term presidency of Ronald Reagan spawned a new Cold War with the Soviet Union, which Hollywood film both embraced and critiqued. Also during this time, Hollywood launched a long-awaited cycle of films about the Vietnam War, exploring its impact both at home and abroad. But science fiction remained the era's most popular genre, ranging from upbeat fantasies to dark, dystopic visions.\n\nBringing together original essays by ten respected scholars in the field, American Cinema of the 1980s examines the films that marked the decade, including Ordinary People, Body Heat, Blade Runner, Zelig, Platoon, Top Gun, Aliens, Blue Velvet, Robocop, Fatal Attraction, Die Hard, Batman, and sex, lies &amp; videotape.\n\nPublisher: Rutgers University Press (April 25, 2007)\nLanguage: English\nISBN-10: 0813540348\nISBN-13: 978-0813540344\n\nEditorial Reviews\nReview\nPrince offers a year-by-year appropriation of films released in the 1980's....The collection, as a whole, makes clear that the 1980's were the years of blockbusters, sequels, and the release of films on videocassette. Recommended. --Choice\n\nAbout the Author\nSTEPHEN PRINCE is a professor of communication at Virginia Polytechnic Institute","torrent":{"xt":"urn:btih:624ca2fa000f96ae8f3dfc47d41067d3350e57ca","amp;dn":"American+Cinema+of+the+1980s+Themes+and+Variations+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"624ca2fa000f96ae8f3dfc47d41067d3350e57ca","infoHashBuffer":{"type":"Buffer","data":[98,76,162,250,0,15,150,174,143,61,252,71,212,16,103,211,53,14,87,202]},"announce":[],"urlList":[]}}