{"title":"Raphael, 50 aÃƒÂ±os despues","uid":4559314,"size":193953092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:62a8b7a79c11e88406154b3efcc2f9af4f703e21&amp;dn=Raphael%2C+50+a%C3%83%C2%B1os+despues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"puchacheles","files":23,"time":1228610367,"description":"50 aÃƒÂ±os despuÃƒÂ©s es un disco histÃƒÂ³rico por la trayectoria de Raphael y los artistas que cantan con ÃƒÂ©l. SÃƒÂ³lo desde el respeto, la admiraciÃƒÂ³n y el cariÃƒÂ±o compartido puede llevarse a cabo un proyecto semejante, con canciones y artistas que forman parte de la banda sonora de diferentes generaciones. Son 21 artistas los que cantan a dÃƒÂºo con Raphael 20 canciones incontestables y cuya relaciÃƒÂ³n asombra. Todas las canciones se han grabado exclusivamente para este ÃƒÂ¡lbum y dos son inÃƒÂ©ditas y compuestas especialmente para el disco: 50 aÃƒÂ±os despuÃƒÂ©s, de JoaquÃƒÂ­n Sabina, y El cielo puede esperar, de Manuel Martos (Mota). Otras dos tienen un carÃƒÂ¡cter muy especial porque se han conservado las voces de las grabaciones originales de RocÃƒÂ­o DÃƒÂºrcal en CÃƒÂ³mo han pasado los aÃƒÂ±os y de RocÃƒÂ­o Jurado en Como yo te amo, creando nuevos arreglos musicales y grabando encima la voz de Raphael. Joan Manuel Serrat - Cantares Alejandro Sanz - La Fuerza Del CorazÃƒÂ³n JoaquÃƒÂ­n Sabina -50 AÃƒÂ±os DespuÃƒÂ©s (InÃƒÂ©dita) David Bisbal - EscÃƒÂ¡ndalo Juanes - Volverte A Ver Alaska - No Puedo Quitar Mis Ojos De TÃƒÂ­ Enrique Bunbury - Infinito Ana Torroja - Hijo De La Luna RocÃƒÂ­o Jurado - Como Yo Te Amo Ana BelÃƒÂ©n Y VÃƒÂ­ctor Manuel - Quiero Abrazarte Tanto Miguel BosÃƒÂ© - Morir De Amor Vicente FernÃƒÂ¡ndez - Volver, Volver Miguel RÃƒÂ­os - Himno A La AlegrÃƒÂ­a Manuel Martos (Mota) - El Cielo Puede Esperar (InÃƒÂ©dita) Armando Manzanero - Adoro RocÃƒÂ­o DÃƒÂºrcal - CÃƒÂ³mo Han Pasado Los AÃƒÂ±os Paloma San Basilio - Que Seas TÃƒÂº Adamo - Mi Gran Noche JosÃƒÂ© Luis Perales - AmÃƒÂ©rica Paul Anka - A Mi Manera (My Way)","torrent":{"xt":"urn:btih:62a8b7a79c11e88406154b3efcc2f9af4f703e21","amp;dn":"Raphael%2C+50+a%C3%83%C2%B1os+despues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a8b7a79c11e88406154b3efcc2f9af4f703e21","infoHashBuffer":{"type":"Buffer","data":[98,168,183,167,156,17,232,132,6,21,75,62,252,194,249,175,79,112,62,33]},"announce":[],"urlList":[]}}