{"title":"The Beatles Help! 24 Bit Vinyl Pack","uid":9489611,"size":1438269097,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62e5d581ec663c8177feb852c4ac7513d344f878&amp;dn=The+Beatles+Help%21+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1389971590,"description":"\n  The Beatles Help! 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: British Invasion, Folk-Rock, Psychedelic\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n\n  A1 Help!\n  A2 The Night Before\n  A3 From Me To You Fantasy\n  A4 You`ve Got To Hide Your Love Away\n  A5 I Need You\n  A6 In The Tirol\n\n  B1 Another Girl\n  B2 Another Hard Day`s Night\n  B3 Ticket To Ride\n  B4 The Bitter End - You Can`t Do That\n  B5 You're Going To Lose That Girl\n  B6 The Chase\n\n  Two versions\n\n  Capitol (US)\n  JVC MFSL 1-105 (Japan, Dr. Robert)\n\n  Considering that Help! functions as the Beatles' fifth album and as the soundtrack to their second film -- while filming, they continued to release non-LP singles on a regular basis -- it's not entirely surprising that it still has some of the weariness of Beatles for Sale. Again, they pad the album with covers, but the Bakersfield bounce of &quot;Act Naturally&quot; adds new flavor (along with an ideal showcase for Ringo's amiable vocals) and &quot;Dizzy Miss Lizzy&quot; gives John an opportunity to flex his rock &amp; roll muscle. George is writing again and if his two contributions don't touch Lennon and McCartney's originals, they hold their own against much of their British pop peers. Since Lennon wrote a third more songs than McCartney, it's easy to forgive a pair of minor numbers (&quot;It's Only Love,&quot; &quot;Tell Me What You See&quot;), especially since they're overshadowed by four great songs. His Dylan infatuation holds strong, particularly on the plaintive &quot;You've Got to Hide Your Love Away&quot; and the title track, where the brash arrangement disguises Lennon's desperation. Driven by an indelible 12-string guitar, &quot;Ticket to Ride&quot; is another masterpiece and &quot;You're Going to Lose That Girl&quot; is the kind of song McCartney effortlessly tosses off -- which he does with the jaunty &quot;The Night Before&quot; and &quot;Another Girl,&quot; two very fine tunes that simply update his melodic signature. He did much better with &quot;I've Just Seen a Face,&quot; an irresistible folk-rock gem, and &quot;Yesterday,&quot; a simple, beautiful ballad whose arrangement -- an acoustic guitar supported by a string quartet -- and composition suggested much more sophisticated and adventurous musical territory, which the group immediately began exploring with Rubber Soul.","torrent":{"xt":"urn:btih:62e5d581ec663c8177feb852c4ac7513d344f878","amp;dn":"The+Beatles+Help%21+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62e5d581ec663c8177feb852c4ac7513d344f878","infoHashBuffer":{"type":"Buffer","data":[98,229,213,129,236,102,60,129,119,254,184,82,196,172,117,19,211,68,248,120]},"announce":[],"urlList":[]}}