{"title":"Snow White (1987)","uid":10620371,"size":2859784527,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:633916b6466ba5f9ece59c3a6d20250d654a6790&amp;dn=Snow+White+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"moviereep","files":8,"time":1406163434,"description":"PLEEZ SEED!\n\nDame Diana Rigg (TV's &quot;The Avengers&quot;) and Billy Barty (&quot;Willow&quot;) star in this feature-length, live-action, musical version of the classic fairy tale by the Brothers Grimm.\n\nCast:\nDiana Rigg as The Evil Queen, Snow White's evil stepmother\nSarah Patterson as Snow White\nNicola Stapleton as Young Snow White\nBilly Barty as Iddy\nMike Edmonds as Biddy (as Mike Edmunds)\nRicardo Gil as Kiddy\nMalcolm Dixon as Diddy\nGary Friedkin as Fiddy\nArturo Gil as Giddy\nTony Cooper as Liddy\nDoug Sheldon as The King, Snow White's father\nJames Ian Wright as The Prince\nDorit Adi as the Good Queen, Snow White's mother\n\nThe film opens with a handsome young Prince traveling in the woods with his men. The Prince discovers a beautiful young woman, Snow White, lying in a glass coffin, seemingly dead. The seven dwarfs arrive and tell the Prince Snow White's story through flashback.\n\nA handsome and courageous King and his fair Queen rule their kingdom well. While sewing one winter's day, the Queen pricks her finger with her needle and blood falls on the snow outside her windowsill. The King declares that they will have a child with lips as red as a rose, hair as black as ebony and skin as white as snow. After some time, the good Queen gives birth to a daughter, Snow White, but dies shortly after her child is born.\n\nThe King remarries, but the new queen (Diana Rigg) is evil and jealous of Snow White (Nicola Stapleton). When the King and Snow White leave for a hunt, the Evil Queen asks her hunter to take Snow White away and kill her. The hunter succeeds in taking Snow White from her father but is unable to harm her. He lets Snow White flee into the forest, and there she discovers a cottage belonging to seven kindly dwarfs - Iddy, Biddy, Kiddy, Diddy, Fiddy, Giddy and Liddy - who allow her to stay with them. The King is told that Snow White has been eaten by wild animals, and he dies in battle.\n\nMany happy years pass and Snow White (Sarah Patterson) grows into a lovely young woman. When the Evil Queen asks her mirror who the fairest is, she is told that Snow White, who is alive in the forest, is the fairest of them all. The Evil Queen then decides to get rid of the girl herself, trying to kill Snow White three times. First, disguised as a gypsy woman, she gives Snow White a bodice and ties her up so tightly that the girl collapses unconscious, but the dwarfs cut her out of the bodice. Then, the Queen, disguised as an Asian comb seller, pushes a poisoned comb into Snow White's hair, but the dwarfs revive her by removing the comb. The third time, the Evil Queen prepares a poisoned apple and disguises herself as an old peasant woman. Snow White resists at first, until the Evil Queen cuts the apple in half so they may share it. Snow White eats the poisoned half of the apple and falls to the floor. The dwarfs are unable to revive her, and place her inside a glass coffin.\n\nThe film returns to the present, where the dwarfs have allowed the Prince to take Snow White away. While the Prince and his men are transporting her, the coffin accidentally falls off the wagon, forcing the piece of poisoned apple from Snow White's throat, and she awakens. The Prince is enchanted by Snow White and asks her to marry him, and she accepts.\n\nInvitations are sent out to every kingdom for their wedding, and the Evil Queen receives one as well. The Evil Queen is told by her magic mirror that the Prince's bride is the fairest in the land. She smashes her mirror in a fit of rage, which causes her to age rapidly. The Evil Queen rushes to the church and is shocked to see Snow White as the bride. The Evil Queen, now an old hag, limps out of the church and disintegrates into ashes. Snow White and the Prince are married and live happily ever after.\n\nPLEEZ SEED!","torrent":{"xt":"urn:btih:633916b6466ba5f9ece59c3a6d20250d654a6790","amp;dn":"Snow+White+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"633916b6466ba5f9ece59c3a6d20250d654a6790","infoHashBuffer":{"type":"Buffer","data":[99,57,22,182,70,107,165,249,236,229,156,58,109,32,37,13,101,74,103,144]},"announce":[],"urlList":[]}}