{"title":"Dot Hack G.U. Vol. 1 - Rebirth [NTSC] PS2","uid":7686605,"size":3061547174,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:6352efe8f168fa8db8f5f97bd33e6641228a235e&amp;dn=Dot+Hack+G.U.+Vol.+1+-+Rebirth+%5BNTSC%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1348964711,"description":"Dot Hack//G.U. Vol. 1 - Rebirth for the Ps2                      Rel. 10/24/2006\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        RPG\nRating:        Teen\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nGame Description:\n\n.hack//G.U. Vol. 1: Rebirth takes place three years after .hack//QUARANTINE ended. One year after &quot;The Twilight Incident&quot;, a huge fire started in CC Corp destroying most of the original &quot;The World&quot; servers and forcing them to shut the game down soon after. A new version of the &quot;The World&quot; was created one year after the fire called &quot;The World R:2&quot;. You play as Haseo, a PKK (Player Killer Killer) searching for the player killer who Data Drained his friend into a coma, Tri-Edge. \n\nThe player meets reliable friends in Gaspard, Silabus, Atoli, Kuhn and many others later in game. The battle system is still real-time but with mostly hack and slash action. Also, when the player lands a certain number of combos on an enemy and they glow blue and yellow you can perform special Rengeki moves. Rengeki moves get more powerful as you progress through the game. The player also has a morale gauge in the top right corner of your screen. When the gauge is full, the player can perform an Awakening attack with help from his/her party members. There are two types of Awakening attacks, Demon and Beast Awakening. The Demon Awakening lets you unleash powerful magic attacks without using SP (Skill Points). The Beast Awaking makes the player invulnerable to physical attacks for a set period of time while enhancing his/her physical abilities.\n\nNew features added are guilds, arena battles and weapon customization. Guilds are groups people join for various reasons. The player can join at least two this game. Arena battles are basically two teams of three characters battling each other for fun or for championships. Weapon customization can be done with items the player gets on travels or buys in shops to element or status effect to your weapons.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t\t","torrent":{"xt":"urn:btih:6352efe8f168fa8db8f5f97bd33e6641228a235e","amp;dn":"Dot+Hack+G.U.+Vol.+1+-+Rebirth+%5BNTSC%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6352efe8f168fa8db8f5f97bd33e6641228a235e","infoHashBuffer":{"type":"Buffer","data":[99,82,239,232,241,104,250,141,184,245,249,123,211,62,102,65,34,138,35,94]},"announce":[],"urlList":[]}}