{"title":"Jesus of Nazareth","uid":9333451,"size":3261825438,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:63655edb3eda20c5b5181e8d519448ff4af65909&amp;dn=Jesus+of+Nazareth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1386808450,"description":"Jesus of Nazareth\n\n\nThis film, first shown as a mini-series on network television in 1977, has become the standard which all other films on the life of Christ must be put up against. This epic boasts a stellar cast including Sir Lawrence Olivier, Ernest Borgnine, Christopher Plummer, and James Mason. Robert Powell gives what could be the defining performance of his acting career. His likeness to paintings and portraits of Christ are almost eerie in its exactness. His range from the serene to the indignant Christ who knocks over the money-changer's tables is a contrast in great acting. It is obvious by watching Powell that he had done his homework and knew exactly who he was imitating.\n\nThe film stays closely on track with the gospels although it does vary in some minute ways. One scene in which it strays is when Nicodemus comes to Christ during the day, when the gospel of John clearly says it was at night. One can only speculate if the beautiful scenery in Morocco had anything to do with this decision. But the attention to detail and truth permeate this picture and it is not stretching it to say it is lovingly made by director Franco Zeffirelli. This film is for the entire family, although parents of young children should be warned it includes the spearing of some zealots, though not graphically shown, and the violence of Jesus' crucifixion, tame compared to the recent &quot;The Passion Of The Christ.&quot; This depiction of the life of Jesus of Nazareth has yet to be matched by any other film.\n\n\n\nSTORY:\nThis is a story that's been portrayed numerous times. Even so, this one is special in many ways. Covering the lives of Jesus and the accompanying main characters of His time, this film stands-out for Franco Zeffirelli's masterful directing, a great cast, and splendid acting. Some of the actors are virtual unknowns, however all delivered memorable performances. Robert Powell is stunning in his role as Jesus. Anne Bancroft, as Mary Magdolin, is wonderful as well. Though nearly thirty years old, this film still sets the standard for all films in the genre.","torrent":{"xt":"urn:btih:63655edb3eda20c5b5181e8d519448ff4af65909","amp;dn":"Jesus+of+Nazareth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63655edb3eda20c5b5181e8d519448ff4af65909","infoHashBuffer":{"type":"Buffer","data":[99,101,94,219,62,218,32,197,181,24,30,141,81,148,72,255,74,246,89,9]},"announce":[],"urlList":[]}}