{"title":"Ancient Greece: From the Mycenaean Palaces to the Age of Homer","uid":11735246,"size":25902333,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:650fb639092ebbcfc11974c3200658c9ea726a68&amp;dn=Ancient+Greece%3A+From+the+Mycenaean+Palaces+to+the+Age+of+Homer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425544314,"description":"The period between the collapse of the Mycenaean civilization around 1200 BC and the dawning of the classical era four and half centuries later is widely known as the Dark Age of Greece, not least in the eponymous history by A. M. Snodgrass published by EUP in 1971, and reissued by the Press in 2000.\n\nIn January 2003 distinguished scholars from all over the world gathered in Edinburgh to re-examine old and new evidence on the period. The subjects of their papers were chosen in advance by the editors so that taken together they would cover the field. This book, based on thirty-three of the presentations, constitutes the most fundamental reinterpretation of the period for 30 years. The authors take issue with the idea of a Greek Dark Age and everything it implies for the understanding of Greek history, culture and society. They argue that the period is characterised as much by continuity as disruption and that the evidence from every source shows a progression from Mycenaean kingship to the conception of aristocratic nobility in the Archaic period.\n\nThe volume is divided into six parts dealing with political and social structures; questions of continuity and transformation; international and inter-regional relations; religion and hero cult; Homeric epics and heroic poetry; and the archaeology of the Greek regions. Copiously illustrated and with a collated bibliography, itself a valuable resource, this book is likely to be the essential and basic source of reference on the later phases of the Mycenaean and the Early Greek Iron Ages for many years","torrent":{"xt":"urn:btih:650fb639092ebbcfc11974c3200658c9ea726a68","amp;dn":"Ancient+Greece%3A+From+the+Mycenaean+Palaces+to+the+Age+of+Homer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650fb639092ebbcfc11974c3200658c9ea726a68","infoHashBuffer":{"type":"Buffer","data":[101,15,182,57,9,46,187,207,193,25,116,195,32,6,88,201,234,114,106,104]},"announce":[],"urlList":[]}}