{"title":"Rocky Collection","uid":9399755,"size":4435616280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:652aa86cb435718a1660893f1505701ff34a858b&amp;dn=Rocky+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sffs81","files":18,"time":1388050800,"description":"Rocky--- Balboa, a small-time boxer gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed, in a bout in which he strives to go the distance for his self-respect.\n\nRockyII---Rocky struggles in family life after his bout with Apollo Creed, while the embarrassed champ insistently goads him to accept a challenge for a rematch\n\nRockIII---Rocky has been holding the title as the heavyweight champion until he is defeated by a brutal challenger, and now must regain his fighting spirit through a big rematch, trained by an unlikely ally: his old nemesis Apollo Creed\n\nRockyIV---After iron man Drago, a highly intimidating 6-foot-5, 261-pound Soviet athlete, literally destroys Apollo Creed in an exhibition match, Rocky comes to the heart of Russia for 15 pile-driving boxing rounds of revenge.\n\nRockyV---Reluctantly retired from boxing and back from riches to rags, Rocky takes on a new protege who betrays him; As the champ's son must adjust to his family's new life after bankruptcy.\n\nRocky Balboa---Rocky Balboa comes out of retirement to step into the ring for the last time and face the heavyweight champ Mason 'The Line' Dixon.","torrent":{"xt":"urn:btih:652aa86cb435718a1660893f1505701ff34a858b","amp;dn":"Rocky+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652aa86cb435718a1660893f1505701ff34a858b","infoHashBuffer":{"type":"Buffer","data":[101,42,168,108,180,53,113,138,22,96,137,63,21,5,112,31,243,74,133,139]},"announce":[],"urlList":[]}}