{"title":"A todo Gas 3 [DVDRip] [Spanish]","uid":4581326,"size":735221846,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:65870fd85a4b920f29f99b2d319a37088699c5a1&amp;dn=A+todo+Gas+3+%5BDVDRip%5D+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":3,"time":1229438382,"description":"Para Sean Boswell (Lucas Black), las carreras callejeras suponen una vÃƒÂ­a de escape de un hogar infeliz y un entorno superficial. Pero su conducciÃƒÂ³n temeraria le ha vuelto muy impopular con las autoridades locales. Tras sufrir un nuevo accidente, y para no acabar en la cÃƒÂ¡rcel, se aviene a marcharse a vivir con su padre, con el que ya no tenÃƒÂ­a apenas relaciÃƒÂ³n, en su destino militar en Tokio. Sean se siente muy aislado en un paÃƒÂ­s con costumbres y cÃƒÂ³digos de honor extraÃƒÂ±os para ÃƒÂ©l. Su amigo americano Twinkie (Bow Wow) le introduce en el mundo de las carreras drift: un vertiginoso equilibrio entre la velocidad y saber manejarse a travÃƒÂ©s de un peligroso circuito lleno de giros y cambios de sentido imposibles. Sean vuelve a engancharse y vuelve a meterse en lÃƒÂ­os. En su primer dÃƒÂ­a de carreras Sean reta a D.K. (Brian Tee), el &quot;rey del drift&quot;, un campeÃƒÂ³n local conectado con los yakuzas, el sindicato japonÃƒÂ©s del crimen. Tras perder, Sean se ve obligado a pagar su deuda trabajando a las ÃƒÂ³rdenes de Han (Sung Kang), que pronto le admite en su familia de proscritos y le enseÃƒÂ±a el autÃƒÂ©ntico mundo del drifting, en donde la carrera se convierte en una forma artÃƒÂ­stica. Cuando Sean se enamora de la novia de D.K., Neela (Nathalie Kelley), se desata una explosiva serie de acontecimientos que culmina con un enfrentamiento final con su rival. El honor estÃƒÂ¡ en juego y el talento de un piloto se pone a prueba hasta el lÃƒÂ­mite... sÃƒÂ³lo hay lugar para un campeÃƒÂ³n.","torrent":{"xt":"urn:btih:65870fd85a4b920f29f99b2d319a37088699c5a1","amp;dn":"A+todo+Gas+3+%5BDVDRip%5D+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65870fd85a4b920f29f99b2d319a37088699c5a1","infoHashBuffer":{"type":"Buffer","data":[101,135,15,216,90,75,146,15,41,249,155,45,49,154,55,8,134,153,197,161]},"announce":[],"urlList":[]}}