{"title":"Janice Steinberg - The Tin Horse (2013) Epub - lovinit13","uid":9209039,"size":2451934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65dca5cd103f947c4fa7629eb314d62e3cf10906&amp;dn=Janice+Steinberg+-+The+Tin+Horse+%282013%29+Epub+-+lovinit13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lovinit13","files":1,"time":1384746643,"description":"PLEASE SEED.. Thanks :)\n\nFor fans of the beloved classic A Tree Grows in Brooklyn, a sweeping, multi-generational story about twin sisters, one of whom disappears without a trace in 1939, set in the historically Jewish neighborhood of Boyle Heights, California, and modern-day Los Angeles.\n\nAfter years of resistance to the idea, feisty octogenarian Elaine Greenstein finally decides to move from the home in which she raised her family to a retirement community. While she's packing her possessions, she finds a clue to the whereabouts of her twin sister, who disappeared from the little-known Jewish mecca of Boyle Heights on the eve of WWII when the girls were eighteen. Plunging back into memories of her childhood and the momentous historical facts that impacted her family, Elaine recalls her family's stories-those from the Old Country, and tales of immigration travails, and the heartache of being the &quot;smart&quot; one of the twins instead of the &quot;popular&quot; one.\n\nIn an utterly unforgettable, salty voice, Elaine revives the memories of growing up with her twin sister Barbara, her parents, her Zayde, her aunts and her younger sisters as the Greensteins bear the disappointments, heartbreaks, and fallout from the immigrant baggage that they have been unable to shed despite settling in southern California-the land of sunshine and opportunity, fig trees and equality.\n\nJanice Steinberg's novel is not only about the stories that make up our family histories, but also about those we tell ourselves in order to believe in who we've made ourselves out to be","torrent":{"xt":"urn:btih:65dca5cd103f947c4fa7629eb314d62e3cf10906","amp;dn":"Janice+Steinberg+-+The+Tin+Horse+%282013%29+Epub+-+lovinit13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65dca5cd103f947c4fa7629eb314d62e3cf10906","infoHashBuffer":{"type":"Buffer","data":[101,220,165,205,16,63,148,124,79,167,98,158,179,20,214,46,60,241,9,6]},"announce":[],"urlList":[]}}