{"title":"The Whore Next Door XXX","uid":14613966,"size":1461219328,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:663150f826b2dfbdca33520255eb79349a6f6e73&amp;dn=The+Whore+Next+Door+XXX+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SudoSu","files":1,"time":1463182073,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/0Fvzv \nhttp://imgkiss.com/image/0FwB9 \nhttp://imgkiss.com/image/0FL58\r\n\r\nCast: Kylie Ireland, Manuel Ferrara, Roxanne Hall, John Strong, Steve Holmes, Kurt Lockwood, Tee Reel, Tyler Knight, Van Damage, Kayla Marie, Katrina Kraven, Julie Night, Marcos Leon, Jason Horne, Venus\r\n\r\nThe Whore Next Door was something a lot of people probably thought they'd never see; a gal like Kylie Ireland going literally &quot;all the way&quot; into gonzo. She may be twice the age of the current &quot;flavor of the month&quot; gals joining porn but only a fool would deny her sexual stamina, ability and determination to prove her critics wrong. For what it's worth, even a jaded old reviewer like myself found each scene enough to get me wanting some relief so I had to take a break more than a few times while watching this collection of scenes (although I'm a big fan of hers, I still think anyone would objectively see her passion, heat, and chemistry here).\r\n\r\nFrom beginning to end, The Whore Next Door was well worth a rating of Highly Recommended for all it had to offer. Fans of Kylie's like myself will probably consider this the holy grail of porn in some ways but I still hold out hope that she continues to make porn of all kinds and that this is just one more door she's opened to further her own sexual discovery (her parties are some of the most interesting in the porn world I'm told but maybe this will allow people to see her in yet another light). Whatever the case may be, Kylie Ireland seems to be on another path these days and I'll be watching to see what else she has in store for a demanding audience. The Whore Next Door had more fuck for the buck than a dozen of her earlier movies; making me wonder if this might become a series for all to enjoy.\r\n\r\nSail to another one:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:663150f826b2dfbdca33520255eb79349a6f6e73","amp;dn":"The+Whore+Next+Door+XXX+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663150f826b2dfbdca33520255eb79349a6f6e73","infoHashBuffer":{"type":"Buffer","data":[102,49,80,248,38,178,223,189,202,51,82,2,85,235,121,52,154,111,110,115]},"announce":[],"urlList":[]}}