{"title":"Happy.Endings.S03E20.HDTV.x264.PROPER-LOL","uid":8391119,"size":167677810,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66c857f56ab5e34c1f9a5ac70f9b23743dbea475&amp;dn=Happy.Endings.S03E20.HDTV.x264.PROPER-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1366431620,"description":"Happy Endings\n\nGenre: Comedy\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: David Caspe\nCast: Zachary Knighton, Elisha Cuthbert, Eliza Coupe, Adam Pally, Casey Wilson, Damon Wayans Jr.\n\n.: Plot :.\nForget who gets to keep the ring when a couple splits the real question is, who gets to keep the friends? In this modern comedy, a couple's break up will complicate all of their friends' lives and make everyone question their choices. When life throws you for a loop... hold on tight to the people you love. Every circle of friends has someone who's the gravitational center. For years, perfect couple Dave and Alex drew their friends in and held them together. Now that they've split, does this group have the stuff to stay together? Or do Max, Brad, Jane, and Penny have to choose sides? Suddenly every event is a negotiation. Like, who gets to go on the annual ski trip? There are a lot of big questions to be answered, but this group has been together so long, somehow, little by little, they'll figure out how to hold on, even though their center is split up. It helps that Dave and Alex have agreed to stay friends. But there will definitely be other complications down the road like Penny's long-suppressed feelings for Dave. What is the waiting period for dating a friend's ex? This show isn't afraid to ask the embarrassing personal questions that inevitably arise in every long-term, close-knit group of friends. This relatable comedy from executive producer Jamie Tarses (My Boys) and hot new writer David Caspe examines the complex network of long-term friendships. Just because one couple breaks up, does that mean their whole urban family has to fall apart? Nope. It just means life is going to get a lot more complicated.\n","torrent":{"xt":"urn:btih:66c857f56ab5e34c1f9a5ac70f9b23743dbea475","amp;dn":"Happy.Endings.S03E20.HDTV.x264.PROPER-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66c857f56ab5e34c1f9a5ac70f9b23743dbea475","infoHashBuffer":{"type":"Buffer","data":[102,200,87,245,106,181,227,76,31,154,90,199,15,155,35,116,61,190,164,117]},"announce":[],"urlList":[]}}