{"title":"How We Do Harm A Doctor Breaks Ranks about Being Sick in America","uid":9151694,"size":3302989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66fb2ff79498bb7c1b00df68a03c3feb3a394417&amp;dn=How+We+Do+Harm+A+Doctor+Breaks+Ranks+about+Being+Sick+in+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383706422,"description":" Dr. Otis Brawley is the chief medical and scientific officer of the American Cancer Society, an oncologist with a dazzling clinical, research, and policy career. In &quot;How We Do Harm&quot; he exposes the underbelly of healthcare today - the under treatment of the poor, the over treatment of the rich, the financial conflicts of interests physicians face, insurance that doesn't demand the best (or even cheapest) care, and a pharmaceutical behemoth concerned with selling drugs, not providing health. &quot;How We Do Harm&quot; is a call for rational care, drawn from results-based, scientifically reproducible treatments and protocols based on science, and not the new, hot drug. Guided by the maxim he learned in Jesuit high school, &quot;say what you know, what you don't know, and what you believe - and label it accordingly,&quot; Dr. Brawley believes scepticism should be the mainstream. D r. Brawley's personal history serves as a window into an experienced and passionate view of medicine and the politics of treatment, and How We Do Harm is his well-reasoned manifesto for change.\nGenre: Healthcare, Fitness","torrent":{"xt":"urn:btih:66fb2ff79498bb7c1b00df68a03c3feb3a394417","amp;dn":"How+We+Do+Harm+A+Doctor+Breaks+Ranks+about+Being+Sick+in+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66fb2ff79498bb7c1b00df68a03c3feb3a394417","infoHashBuffer":{"type":"Buffer","data":[102,251,47,247,148,152,187,124,27,0,223,104,160,60,63,235,58,57,68,23]},"announce":[],"urlList":[]}}