{"title":"Sleepytime Gorilla Museum - Of Natural History - TQMP","uid":4957136,"size":460241043,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:670643b0efdeadc0486859e9562630f69191e10f&amp;dn=Sleepytime+Gorilla+Museum+-+Of+Natural+History+-+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mio959mao","files":14,"time":1245165174,"description":"After the disbanding of Idiot Flesh, Dan Rathbun and Nils Frykdahl joined with Charming Hostess member Carla Kihlstedt (of which Rathbun and Frykdahl were also members) to form Sleepytime Gorilla Museum with Moe! Staiano and David Shamrock. Their first performance, on June 22, 1999, was to a single banana slug (Ariolimax dolichophallus)[1]. The following night's performance was their first to a human audience.\nSome time during the recording of Grand Opening and Closing (2001), drummer David Shamrock left the band and was replaced with Frank Grau. Grau also co-released the album, instigated their first tour and managed the band.\nDuring the recording of the follow up, Of Natural History (2004), Grau left the band and was replaced with a new drummer Matthias Bossi, formerly of Skeleton Key. The Of Natural History tour saw Moe! Staiano's exit, and new multi-instrumentalist Michael Mellender's entrance.\nOf Natural History is the second album. It continues on the same diverse and eclectic musical lines as its predecessor (Grand Opening and Closing), with even more new elements, like Intelligent dance music (&quot;Bring Back the Apocalypse&quot;) and funk and jazz (&quot;Gunday's Child&quot;). Also notable is the incorporation of a plethora of field recordings and samples into the songs and interludes.\nOf Natural History has a continuity in the sense that all the songs sequence into each other, thus holding the narrative elements better together along the album. The continuity and the coherent feel make Of Natural History very close to a concept album. While the lyrics themselves differ much from song to song, the underlying imposing mood is concerned with the apocalyptic implications caused by human presence on earth; to offer different viewpoints on this, SGM create their own characters and stories (tracks 1 &amp; 2, both of which are a continuation of a story created already on the first album that was non-musical) and borrow from Filippo Tommaso Marinetti, Unabomber, Muriel Rukeyser and Kenneth Patchen (tracks 3, 5, 6, and 9, respectively) in addition to own lyrics.\n\nFLAC and limited covers (what I was able to find searching the web ...)\nvery interesting music\nenjoy\t","torrent":{"xt":"urn:btih:670643b0efdeadc0486859e9562630f69191e10f","amp;dn":"Sleepytime+Gorilla+Museum+-+Of+Natural+History+-+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670643b0efdeadc0486859e9562630f69191e10f","infoHashBuffer":{"type":"Buffer","data":[103,6,67,176,239,222,173,192,72,104,89,233,86,38,48,246,145,145,225,15]},"announce":[],"urlList":[]}}