{"title":"The Shaman's Apprentice (2000) [DivX]","uid":5906636,"size":734235688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67d3803fa72237b9ed94be4571c7e7e6c992531e&amp;dn=The+Shaman%5C%27s+Apprentice+%282000%29+%5BDivX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"geogaddi000","files":-1,"time":1287885207,"description":"The Shaman's Apprentice\n\nEthnobotanist Mark Plotkin's quest to preserve the ancient wisdom of Amazonian shamans.\n\n\nAVI Information\n   Filename: The Shaman's Apprentice.avi\n   Filesize: 734235688 Bytes (700.22 MB)\n   Streams (i.e. Video, Audio): 2\nVideo Stream\n   Compression: divx - DivX\n   Avg. Bitrate: 1677.98 kbit/s\n   Resolution: 640x480\n   Color Depth: 24 bits\n   Running Time: 3231.66 s (53m 51s)\n   Framerate: 29.9700 fps\n   Microseconds Per Frame: 33367 ms\n   Frames: 96853\n   Keyframes: 1011 (Every 95)\nAudio Stream\n   Wave Type: 85 - MPEG Layer 3\n   Avg. Bitrate: 128.00 kbit/s\n   Sample Rate: 48000 Hz\n   Bit Depth: 0 Bits\n   Channels: 2\n   Audio Delay: 0.00 s\n\n\nDirected by Miranda Smith\nProduced by Miranda Productions\nNarrated by Susan Sarandon\nWritten by Abigail Wright\n\n\n\nFor more than twenty years Dr. Mark Plotkin has searched the Amazon for plants that heal. He is an ethnobotanist, a scientist who studies the relationship between indigenous people and plants. He set out on a mission to find a cure for diabetes, a disease that killed both of his grandmothers. THE SHAMAN'S APPRENTICE charts the story of Mark's discoveries, and looks at the astonishing ability of native people to manage their environment.\n\nPeople of the forest have become sophisticated chemists by necessity, utilizing plants for every aspect of their lives. Often, the entire knowledge of a tribe resides in the mind of the shaman - the tribe's doctor and spiritual leader. But the shamans are also the most endangered species in the Amazon. Marooned in time by the loss of traditional ways, many of the native healers have no apprentices. Most are old, and each shaman's death is a kind of extinction. It is these shamans that Mark seeks out, hoping to save their precious knowledge, for it may be vital to the world's future.\n\nTHE SHAMAN'S APPRENTICE is a story of survival against the odds. It interweaves the luminous rainforest world of phenomena and legends with western science and the grim realities of extinction. In the story of one man's quest to preserve the ancient wisdom of our species, we find intelligence, cooperation and hope that could save one of the most glorious places on Earth.\n\n\nGrade Level: Grades 7-12, College, Adult\nUS Release Date: 2001     Copyright Date: 2001\nDVD ISBN: 1-59458-110-X     VHS ISBN: 1-56029-902-9\n\n\nReviews\n\n&quot;Superb, compelling, definitive.&quot;\nEdward O. Wilson, Honorary Curator of Entomology, Museum of Comparative Zoology, Harvard University, and author of Biophilia and The Diversity of Life\n\n&quot;Recommended without reservation. The message is important, and the film is a sensory treat with substantial entertainment value. The life and contributions of Plotkin are quite remarkable. It is a story that is well worth watching.&quot;\nJohn Pezzuto, Pharmaceutical Biology\n\n&quot;In The Shaman's Apprentice, renowned ethnobotanist Mark Plotkin makes a powerful case to save both the Amazon rain forest and the indigenous shamans...The video, with its high production values, is packed with facts and is designed for grades ten through adult; highly recommended.&quot;\nLibrary Journal\n\n&quot;A thoroughly captivating journey into the heart of the rainforest in pursuit of the Shaman's secrets...an unusual and successful blend of the shamanic and the scientific.&quot;\nDr. Tom Lovejoy, Biodiversity Adviser, The World Bank\n\n&quot;Dazzling visuals, cutting edge science and a compelling story make The Shaman's Apprentice a feast for the eyes, the heart, and the mind...one of the most stunning rainforest films ever made.&quot;\nKen Cook, President, Environmental Working Group\n\n&quot;No one has done more to popularize the field of ethnobotany than Mark Plotkin. Plotkin takes the viewer into an exotic landscape where only the shamans, or medicine men, have the cures for a variety of tropical ailments. This film will surely introduce countless viewers to an area of immense interest within ethnobotany: the study of medicinal plants.&quot;\nJohn R. Stepp, founding editor of Journal of Ecological Anthropology\n\n&quot;Interspersed with mythical, dream-like folktales, splendidly retold by Susan Sarandon, this film is a pleasant blend of the mystique and the reality of the pursuit and understanding of indigenous medicinal plant usage...It illustrates a success story about a man who recognized the importance of what he was doing not only for his own benefit but for the benefit of those from whom the information originates.&quot;\nDr. Patricia S. De Angelis, Ph.D. Ethnobotany\n\n&quot;Rarely does one find a documentary that has such universal appeal and applicability. At the same time this film is educational, inspiring, thought-provoking and entertaining--a true gem of the new millennium.&quot;\nJoseph D. Hoffman Ph.D., Professor of Medicinal Chemistry and Arid Land Resource Sciences, University of Arizona\n\n&quot;One of the most profound and inspiring films you are likely to see, The Shaman's Apprentice is a documentary no one should miss...combines extraordinary footage with remarkably insightful commentary.&quot;\nSimeon Herskovitz, Taos Talking Picture Festival Program\n\n&quot;The Shaman's Apprentice is an informed and informative documentary which is very strongly recommended viewing for students of ethnobiology, anthropology, rain forest ecology, and Native American studies.&quot;\nThe Midwest Book Review\n\n&quot;After viewing the film... a student posted the following to the online discussion:\n'I thought this video was great in that it made me look at some things differently. I always made fun of treehuggers and never saw any point in dedicating one's life to the preservation of the rainforest. But after watching this video I think differently about the whole thing. One thing that struck me the most was that the shaman had found a tree that cured the HIV 1 virus. But when they went back to get more off of the tree, it had been cut down! We are killing ourselves as we destroy nature. Who knows what we could have found cures for by now if we had preserved more? It boggles me.'\n...I was struck by The Shaman's Apprentice film's ability to bring about such a radical shift in attitude.&quot;\nHenry D. Delcore, Ph.D., Assistant Professor, Department of Anthropology, California State University, Fresno\n\n&quot;Beautifully produced...suitable for a public audience, upper-level high school classes, or college courses in cultural anthropology, indigenous peoples, development, fieldwork methods, Native American studies, and ethnobotany/indigenous knowledge.&quot;\nJack David Eller, Metropolitan State College of Denver, Anthropology Review Database","torrent":{"xt":"urn:btih:67d3803fa72237b9ed94be4571c7e7e6c992531e","amp;dn":"The+Shaman%5C%27s+Apprentice+%282000%29+%5BDivX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d3803fa72237b9ed94be4571c7e7e6c992531e","infoHashBuffer":{"type":"Buffer","data":[103,211,128,63,167,34,55,185,237,148,190,69,113,199,231,230,201,146,83,30]},"announce":[],"urlList":[]}}