{"title":"RoboForm Pro Desktop and RoboForm2Go v7.8.3.5 ©2012 with pa","uid":7709130,"size":26664985,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:68342445d1e70496026a35fb016046ed98cd2c6f&amp;dn=RoboForm+Pro+Desktop+and+RoboForm2Go+v7.8.3.5+%26copy%3B2012+with+pa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"onttm","files":11,"time":1349761847,"description":"RoboForm Pro Desktop and RoboForm2Go v7.8.3.5 Â©2012 with patch by novice2 / RU-Board [brought to you by onttm]\n\nRoboForm - Easy and Secure password manager and information vault. Remembers passwords, logs you into web sites and fills forms with one-click.\nRoboForm2Go - Secure password manager that works directly from USB key. Take your passwords wherever you go and experience one-click logins.\n\nJust install your choice of RoboForm (Desktop vs Portable) and run the patch (read the patch txt file forarguments[/url] to patch Portable). No need to close RoboForm before patching; the patch will kill the processes for you.  All you need to do is run the RoboForm TaskBar Icon after patching.\n\nEnjoy!\n\n[b][color=Red]NOTE: To date, there is no universal patch for roboform-x64.dll[/color][/b], so you will have to continue using a 32-bit browser or pay for a legitimate Roboform license to enable 64-bit browser support.  When I find a reliable patch/solution I will package it in a new torrent release.\n\n[IMG]http://image.bayimg.com/fadjfaaem.jpg[/IMG]\n[Superfluous info - screens grabbed with Greenshot and stiched together at pixlr.com]\n\nNews and details from current and past versions of RoboForm.\n\nVersion 7.8.3\n* Editor: Add Summary View mode: select a folder, click Summary View button.\n* Identity Editor: fix Western Australia (WA AU) changing to Washington (WA US).\n* Automatically activate RF license when syncing with active Everywhere account.\n* Fix RF creates new activation info passcard even if one already exists.\n* Firefox: fix AutoSave does not work sometimes, it happens randomly.\n* Firefox: fix AutoSave bar sometimes appears in the wrong tab.\n* AutoSave Bar: fix OK button is not shown in some cases.\n* AutoSave Bar: fix Virtual Keyboard popup does not close after clicking OK.\n* AutoSave Bar: fix Folder selection button is redrawn with visual artifacts.\n* Firefox 15+: fix FF may crash when pressing back/forward buttons during page loading.\n* Firefox: fix text in AutoSave bar is partially transparent on light backgrounds.\n* Firefox: fix RF shows 'access denied' message when switching on RF integration.\n* Firefox: fix Add To Links command is present in Firefox but adds to IE favorite.\n* Firefox: fix pure RF2Go does not inject into Firefox-based browser.\n* Firefox: set max supported Firefox version to 20.\n* Filler: fix Contact Us page and login for SaladBars.com is very slow.\n* Chrome: fix assert happens when AutoFill finds no visible inputs on the page.\n* IE 10: fix RF does not fill user account name on gmail.com in IE 10 (Win8).\n* Chrome: make keyboard shortcuts work when there is no lower toolbar.\n* Identity Minidialog: memorize instance selection even before Fill button is clicked.\n* Chrome, Opera: fix RF not doing all checks for phishing and sensitive fields.\n* Make RF attach to 64-bit processes from outside, used to be only 32-bit processes.\n* Sync: fix Clear History command does not work - sync restores the erased history.\n* Sync: fix if auto-sync is turned off, popup may come earlier than requested.\n* Editors: fix minor bugs in editing, speed up Japanese text editing.\n* Do not attach to Citi Virtual Account Numbers login box.\n* Import: add import wizard screen showing results.\n* Import: fix import of Chrome bookmarks, get all of them. \n","torrent":{"xt":"urn:btih:68342445d1e70496026a35fb016046ed98cd2c6f","amp;dn":"RoboForm+Pro+Desktop+and+RoboForm2Go+v7.8.3.5+%26copy%3B2012+with+pa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68342445d1e70496026a35fb016046ed98cd2c6f","infoHashBuffer":{"type":"Buffer","data":[104,52,36,69,209,231,4,150,2,106,53,251,1,96,70,237,152,205,44,111]},"announce":[],"urlList":[]}}