{"title":"Sound of Cinema","uid":8985296,"size":862775822,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68a891f3d92064bd85c726b0e07490aa09cff45e&amp;dn=Sound+of+Cinema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ghw16xxx","files":-1,"time":1380657093,"description":"Sound of Cinema - The Music That Made The Movies.\n\n\nIn a series celebrating the art of the cinema soundtrack, Neil Brand explores\nthe work of the great movie composers and demonstrates their techniques.\n\n\n\nEpisode One\n\n\nNeil begins by looking at how the classic orchestral film score emerged and\nwhy its still going strong today. He traces how, in the 1930s, European-born\ncomposers such as Max Steiner and Erich Wolfgang Korngold brought their Viennese\ntraining to play in stirring, romantic scores for Hollywood masterpieces like\nKing Kong and The Adventures of Robin Hood. But it took a home-grown American\ntalent, Bernard Herrmann, to bring a darker, more modern sound to some of cinemas\nfinest films with his scores for Citizen Kane, Psycho and Taxi Driver\n\nAmong those Neil meets are leading film-makers and composers who discuss their\nwork, including Martin Scorsese and Hans Zimmer, composer of blockbusters like\nGladiator and Inception.\n\n\n\n\nEpisode Two\n\n\nComposer Neil Brand explores how in the second half of the 20th century,\ncomposers and film-makers embraced jazz, pop and rock to bring fresh energy\nand relevance to film scores\n\nHe shows how in the 1960s, films as diverse as the James Bond movies, Italys\nspaghetti westerns and Disneys musicals drew on the talents of pop arrangers\nand composers like John Barry, Ennio Morricone and the Sherman Brothers to\ncreate unforgettable soundtracks. But the role of the film composer would\nsubsequently be challenged by directors like Martin Scorsese and Quentin\nTarantino, who showed that a soundtrack consisting of carefully chosen pop\nsongs could be as effective as a specially written one\n\nNeil's journey sees him meet leading film-makers and composers including Martin\nScorsese and composers Richard Sherman (Mary Poppins, The Jungle Book),\nLalo Schifrin (Bullitt) and David Arnold (Casino Royale)\n\n\n\nEpisode Three\n\n\nIn the last of three programmes in which composer Neil Brand celebrates the\nart of cinema music, how changing technology has taken soundtracks in bold new\ndirections and even altered our very idea of how a film should sound.\n\nNeil tells the story of how the 1956 science fiction film Forbidden Planet ended\nup with a ground-breaking electronic score that blurred the line between music\nand sound effects, and explains why Alfred Hitchcock's The Birds has one of the\nmost effective soundtracks of any of his films - despite having no music. He shows\nhow electronic music crossed over from pop into cinema with Midnight Express and\nChariots of Fire, while films like Apocalypse Now pioneered the concept of sound\ndesign - that sound effects could be used for storytelling and emotional impact.\n\nNeil tracks down some of the key composers behind these innovations to talk about\ntheir work, such as Vangelis (Chariots of Fire, Blade Runner), Carter Burwell\n(Twilight, No Country for Old Men) and Clint Mansell (Requiem for a Dream, Moon)\n","torrent":{"xt":"urn:btih:68a891f3d92064bd85c726b0e07490aa09cff45e","amp;dn":"Sound+of+Cinema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68a891f3d92064bd85c726b0e07490aa09cff45e","infoHashBuffer":{"type":"Buffer","data":[104,168,145,243,217,32,100,189,133,199,38,176,224,116,144,170,9,207,244,94]},"announce":[],"urlList":[]}}