{"title":"Gnosis The Secrets of Solomons Temple Revealed","uid":4868815,"size":478839660,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:699b710c515129fae008d1a06aa365249083d2bd&amp;dn=Gnosis+The+Secrets+of+Solomons+Temple+Revealed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Porkster","files":-1,"time":1240680177,"description":"Philip Gardiner is a best selling UK author who has been researching the world of the esoteric for over 15 years. His critically acclaimed books include: &quot;Proof, Does God Exist?&quot;, &quot;The Shining Ones&quot;, &quot;The Serpent Grail&quot; and &quot;Secrets of the Serpent, In Search of the Sacred Past&quot;.\n\nWith his new DVD, &quot;Gnosis: The Secret of Solomon's Temple Revealed,&quot; Gardiner proposes that not only didn't Solomon's Temple exist as we know it, but in fact had a much deeper significance. Gnosis, the Secret of Solomon's Temple Revealed- Solomon's Temple in Jerusalem, reputed to be the source of the most esoteric knowledge in human history-has fascinated scholars, seekers and dreamers for centuries. For generations, scholars and researchers have tried in vain to discover the fabled Temple of Solomon, only to be confronted by one problem after another. From the Queen of Sheba and the arcane secrets of the Christian Gnostics to the Muslim Sufi and Hindu Avatars, Gnosis weaves a tale that is both profound and precise. Gardiner declares that the truth of Solomon's Temple has been known all along within the realm of esoteric understanding.\n\nOnly one question remains: Is the world ready for the truth? Find the true secret of the Knights Templar and the mysteries of the ancients. Find the truth for yourself in Gnosis. This is the story that has been kept from the ears of mankind for too long. You cannot truly live until you have Gnosis. * Reveals the real secrets brought back by the infamous Knight's Templar * The truth at the heart of ancient Freemasonry * The truth behind the real Grail and the Da Vinci Code * Who were Solomon and Sheba? * The secret of Solomon's Temple * The ancient and sacred nature of our quantum existence Gnosis, the Secret of Solomon's Temple.\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n","torrent":{"xt":"urn:btih:699b710c515129fae008d1a06aa365249083d2bd","amp;dn":"Gnosis+The+Secrets+of+Solomons+Temple+Revealed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"699b710c515129fae008d1a06aa365249083d2bd","infoHashBuffer":{"type":"Buffer","data":[105,155,113,12,81,81,41,250,224,8,209,160,106,163,101,36,144,131,210,189]},"announce":[],"urlList":[]}}