{"title":"Ch4 Embarrassing Bodies Series 5 04of10 PDTV x264 AAC ","uid":9127375,"size":687398595,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6a0984c6cbd591e4baa2c8b21eda6d53a9c7dff5&amp;dn=Ch4+Embarrassing+Bodies+Series+5+04of10+PDTV+x264+AAC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MVGroup","files":-1,"time":1383249561,"description":"Embarrassing Bodies: Series 5\n\nHealth-Medical Documentary hosted by Ashley Jenson, published by Channel 4 in 2013 - English narration\n\n\nInformation\n------------------------------\n\nEmbarrassing Bodies Series 5\nThe nation's favourite doctors are back for a fifth series, with tropical disease specialist Dr James Logan joining the team.\n\n\n1)  Part 1 \nDr Dawn and Dr James head for Thailand to hunt down the embarrassing souvenirs Brits could be bringing home with them after a trip abroad. Dr Logan bravely infests himself with parasitic hookworm, while back in the UK Dr Pixie meets Carol who has an addiction to coffee enemas. And a woman who was one of the first generation to have breast enhancement surgery asks Dr Christian for help.\n\n2)  Part 2 \nThe show travels to Thailand, offering on-the-spot medical advice to those with tropical troubles. Dr James continues his 60-day experiment of living with hookworm buried inside his intestine. In the clinic, Dr Christian helps a woman who had botched cosmetic surgery in Thailand. Dr Pixie sees a patient whose large breasts are ruining her life. Twenty-one-year-old Caroline's diabetes is damaging her sex life and 59-year-old Jarvis is worried about the risk of prostate cancer.\n\n3)  Part 3 \nThe unshockable doctor's tour continues in their search for cringe-worthy conditions in need of a fix. For the first time Dr Christian hits the party island of Ibiza, tackling the issues of too much sun, sea and sex, pitching up a clinic on the beach for clubbers in need, and offering on the spot STI tests for Chlamydia and Gonorrhoea. Back in the UK Dr Dawn meets a man whose buried penis is causing peeing problems. And Dr Pixie advises a young girl with an extreme case bad breath caused by swollen tonsils. Dr James the dentist is back to treat every kind of dental disaster. And the show meets a cyclist whose potentially fatal blood condition hasn't stopped him aiming for Olympic glory.\n\n4)  Part 4 \nDr Christian helps a patient with a vasectomy. Dr Dawn meets a woman whose bowel condition has left her with shocking stomach scars. She also meets a woman who needs advice about her head-banging bedtime behaviour. The seaside tour continues as the truck stops off at Skegness, where there's a man with a wriggly bottom, and another man with a worrying lump on his testicles. Dr Pixie hits the streets and helps the women of Skegness get the measure of obesity. And Dr Christian asks a team of BMX bikers to produce a sperm sample.\n\n5)  Part 5 \nDr Christian helps a man whose rare genetic condition has left him needing new ears. Dr Pixie meets a patient with a leaky back passage. Dr Dawn meets Helen, who has a very unusual symptom - she can see faeces moving inside her intestines. The mobile clinic visits a music festival in the North East, where Dr Pixie sees a lad whose testicles are causing him trouble and a woman with a sizeable breast problem.\n\n6)  Part 6 \nThe doctors visit Tamworth, where Dr Pixie helps a man whose oozing bottom wound hasn't healed in six years. Dr Christian meets a woman with a mysterious whistle. The show meets an art student fitted with pacemakers in his chest. Dr Pixie visits a pop festival in Staffordshire, where microbiologist Professor Val conducts a forensic examination of the loos. And Dr Dawn gives her top tips on everything you need to know about nipples.\n\n7)  Part 7 \nDr Christian heads to Brighton where he meets a man with bother below the belt and a woman with very different breasts. Back at the clinic Dr Pixie meets a guy whose massive weight loss has left him with some unwanted baggage. Dr Dawn helps a little girl who's having trouble in the toilet department and Dr Christian sees a man with a pimple on his penis. Also resident dentist Dr James meets a woman with the worst decay he has ever seen. And in Thailand Dr Dawn asks some lads to have a feel of her prosthetic balls.\n\n8)  Part 8 \nThe team hits the highlands, and Dr Dawn sets up camp at a festival where she meets a man with a problem under his kilt and a couple whose night of passion turned into a balls-up. Professor Val gets up close and personal with sweat, Dr Pixie hears about the condition that's stopping a woman from having sex, Dr Christian meets a woman who's been struggling to hide her growing problem for seven years, and two sisters discuss their rare skin condition that means each night they grow as much skin as most people would in 14 days.\n\n9)  Part 9 \nThe doctors look back at some of their bumpiest cases. Nine months after they first met, the team catch up with the woman who had two large cysts on her head. Dr Dawn is in the Costa del Sol to see a man with a massive hernia. Dr Pixie revisits a woman who picked food out of the pits of her tonsils. And Dr Christian uses a box of willies to teach everyone the difference between good lumps and bad. And how is the patient doing whose nose was ruining his confidence?\n\n10)  Part 10 \nThe team revisits several memorable cases, including a man whose symptom of leaking milk was the first sign of a much more serious condition. Dr Pixie helped a woman with three nipples and a woman desperate to rebalance her imbalanced breasts. Dr Dawn and Dr Pixie show how to self check for breast cancer and which lumps to worry about and what to get checked out. And, it's not just the ladies; men have a whole host of boob worries too. So, whether it's your man boobs or bosoms, the doctors will be revealing all that you need to know to keep your breasts at their best.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img809.imageshack.us/img809/8490/bkks.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img809.imageshack.us/img809/8490/bkks.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img706.imageshack.us/img706/78/2yfz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img706.imageshack.us/img706/78/2yfz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/1403/okcz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/1403/okcz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img17.imageshack.us/img17/4593/eawv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img17.imageshack.us/img17/4593/eawv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img13.imageshack.us/img13/7192/s3hv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img13.imageshack.us/img13/7192/s3hv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img853.imageshack.us/img853/5485/vj12.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img853.imageshack.us/img853/5485/vj12.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img593.imageshack.us/img593/5995/wtmx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img593.imageshack.us/img593/5995/wtmx.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img585.imageshack.us/img585/4374/qz4e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img585.imageshack.us/img585/4374/qz4e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img7.imageshack.us/img7/6712/ixjp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img7.imageshack.us/img7/6712/ixjp.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c08da1a9ae808cf3eef0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1940 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832x468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 48mins\n * Framerate: 25fps\n * Number of Parts: 10\n * Part Size: 658 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.channel4embarrassingillnesses.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4embarrassingillnesses.com/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:6a0984c6cbd591e4baa2c8b21eda6d53a9c7dff5","amp;dn":"Ch4+Embarrassing+Bodies+Series+5+04of10+PDTV+x264+AAC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a0984c6cbd591e4baa2c8b21eda6d53a9c7dff5","infoHashBuffer":{"type":"Buffer","data":[106,9,132,198,203,213,145,228,186,162,200,178,30,218,109,83,169,199,223,245]},"announce":[],"urlList":[]}}