{"title":"Superchick - 2005 - Beauty From Pain","uid":4874698,"size":34241556,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a190799f63079e79ff5cfcc3f7816d8af9c2b55&amp;dn=Superchick+-+2005+-+Beauty+From+Pain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":10,"time":1241062649,"description":"Superchick - 2005 - Beauty From Pain\n\n\nTRACK LISTING:\n\n01 - Anthem\n02 - Pure\n03 - Bowling Ball\n04 - Stories\n05 - Wishes\n06 - Beauty From Pain\n07 - It's On\n08 - Suddenly\n09 - Courage\n10 - We Live\n\n\nADDITIONAL INFORMATION:\n\nInpop Records' power-pop fueled garage rock mega act Superchick graces fans yet again with their long awaited album, Beauty From Pain. Ever since their 2001 Inpop Records' debut, Karaoke Superstar, Superchick has grown in musical maturity with their last two releases, Last One Picked in 2002 and Regeneration in 2003. \n\nSince their hits, &quot;Barlow Girl&quot; and &quot;One Girl Revolution&quot; from Karaoke Superstar, Superchick has progressed to having their music featured in movies like The Glass House, Catch That Kid, Sleepover, and Legally Blonde 2, and even on an upcoming Playstation 2 game. Superchick has become a well-known and well-liked band; even TobyMac's latest project incorporates Superchicks' &quot;Stories,&quot; which also appears on their new album, Beauty From Pain. \n\nAs their fourth release with Inpop Records, Beauty From Pain focuses on the hope that one finds in those times when you're down and out, at the bottom of life. The purpose of the band Superchick itself was to encourage this generation to not succumb to peer pressure; Beauty From Pain seems to make use of this rationale while also showing people that when they're at a low point that they're not alone. As the fourth track on the album, &quot;Stories&quot; touches this aspect deeply with lyrics like: \n\nCause we've been down to the bottom\nStories we've got 'em, when we hit rock bottom\nIf you been there put your hands in the air\nAnd let somebody know that the Most High cares \n\nOf course, being Superchick, they can't start an album without that one girl revolution song that marks the album. So, opening Beauty From Pain is &quot;Anthem,&quot; a strong pop/punk song that takes a stand for girls with their own goals in the world and does the said job extremely well. This catchy, call for reform was an excellent choice to kick off the album. \n\nFollowing &quot;Anthem&quot; is &quot;Pure,&quot; a more pop-inspired song about how when you're focused on God everything just seems to flow, &quot;I bring the pure flow of water around; the rocks of life won't pull me down.&quot; Next on the album is &quot;Bowling Ball,&quot; a rock song that calls out to girls to get out of relationships that they really shouldn't be in. This song touches one personally, especially if they've been in this situation. &quot;Stories&quot; is an energetic rap song that seems move by rather fast although it's not really that short. Bass guitarist Matt Dally's eccentric rapping skills are featured somewhat sparingly on this album, but often appear rather whiney, even at live shows. \n\n&quot;Wishes&quot; appears to be the most over-produced song of the album. It could definitely have amazing significance to people today, but the lyrics could be a little less provoking and more in depth instead of so broad. As the title track, &quot;Beauty From Pain&quot; is the appropriately tragedy-inspired theme song of the album. This slow, melodious piano-based song focuses on the worst part of life when you're so far down and you feel so lonely. The song isn't supposed to make you feel depressed, although you do experience these feelings a little bit, but instead show you that you're not alone in tough times like these. Later in the album, you find &quot;Courage,&quot; the strongest song vocally the band may have ever put out. Melissa Brock's vocal talents are put in the spotlight to be astonished at as she sings about her struggles with an eating disorder. The album ends with &quot;We Live,&quot; an upbeat pop/rap song that focuses on the lessons and love that can come out of tragedies that we face if we don't give up. \n\nOn the whole, I found the album to be rather exciting for a Superchick record. There were moments that I believed that some songs could have been better without all the over-production (Tricia and Melissa's voices sound metallic at times even) and mixing, but the songs altogether are lyrically and musically composed rather well. Some songs carry quite a serious and heavy mood to them, but that comes along with the aspect of life they're focusing on. In the end, this most definitely is a needed add to your collection. Considering the originality of the band, even if you didn't really like Superchicks' past projects, check this one out. \n\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:6a190799f63079e79ff5cfcc3f7816d8af9c2b55","amp;dn":"Superchick+-+2005+-+Beauty+From+Pain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a190799f63079e79ff5cfcc3f7816d8af9c2b55","infoHashBuffer":{"type":"Buffer","data":[106,25,7,153,246,48,121,231,159,245,207,204,63,120,22,216,175,156,43,85]},"announce":[],"urlList":[]}}