{"title":"NUBILE FILMS - Luna Ruiz | Blow The Candles | 07.12.2016 - NEW J","uid":15277773,"size":232408098,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6bbc34140cc61e8529ba95098202ab36d761f2cc&amp;dn=NUBILE+FILMS+-+Luna+Ruiz+%7C+Blow+The+Candles+%7C+07.12.2016+-+NEW+J&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"TechLatina","files":1,"time":1468319591,"description":"NUBILE FILMS - Luna Ruiz | Blow The Candles | 07.12.2016 - NEW JULY 12th,2016 | SD MP4\r\n\r\n\r\n\r\n\r\nDESCRIPTION\r\nThe scene is set for seduction. Luna Ruiz lets Lobo blindfold her and then sits patiently in her bra and panties as he holds up a birthday cake for her to blow out and then taste. She enjoys the sweetness as Lobo offers her small bites, but soon he replaces the taste of cake with the taste of his lips as he offers her equally sweet kisses.\r\n\r\nSlipping Luna's bra off, Lobo returns his fingers to the cake and then applies the frosting to his lover's breasts. Leaning forward, he licks them clean and then lays Luna back for another application of sugar. They both enjoy this gentle pleasure, with Luna gasping softly as Lobo sucks her nipples to rock hardness.\r\n\r\nAfter a brief time where he teases his blindfolded girlfriend by staying just out of her reach, Lobo guides Luna's hands to his chest and then down lower to the stiffie in his briefs. Luna doesn't need to see for what comes next; after a few moments of stroking him into hardness, she leans forward to suck him off until her lips touch his balls.\r\n\r\nLaying Luna back down, Lobo showers her in kisses until he has rolled her panties off to expose her luscious shaved twat. He places a candle on her mound and blows it out with a wish that he can eat out the delectable treat before him. It's not long before his wish comes true as he feasts upon Luna's bare pussy and works her to the edge of cumming with the help of his magic fingers.\r\n\r\nGently lifting Luna up and arranging her on her hands and knees, Lobo finally satisfies them both by pressing into her warm wetness. Luna loves it doggy style where his long slow strokes can rub her in her most tender places. When she falls to her side, Lobo follows her down to spoon with her as he continues to work her twat until she cums with a gasp.\r\n\r\nMoments later, Lobo reaches the end of his own endurance and pulls out. Taking aim, he covers Luna's snatch with his jizz. Now that their lovemaking is complete, he releases her from the blindfold so that they can gaze lovingly into each other's eyes","torrent":{"xt":"urn:btih:6bbc34140cc61e8529ba95098202ab36d761f2cc","amp;dn":"NUBILE+FILMS+-+Luna+Ruiz+%7C+Blow+The+Candles+%7C+07.12.2016+-+NEW+J","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bbc34140cc61e8529ba95098202ab36d761f2cc","infoHashBuffer":{"type":"Buffer","data":[107,188,52,20,12,198,30,133,41,186,149,9,130,2,171,54,215,97,242,204]},"announce":[],"urlList":[]}}