{"title":"Up the Academy (1980)","uid":5562317,"size":1088185589,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6cd42aa07abef5eb8ce070ceabe4dd27cea6230e&amp;dn=Up+the+Academy+%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1273871869,"description":"This is a really poorly made &quot;B&quot; comedy produced by Mad Magazine. Writing, acting, and a production quality all basically suck. Yet I still kind of like it.  :)\n\nHere is what the Wikipedia has to say about it:\n&quot;The movie was an attempt to &quot;cash in&quot; on the phenomenal and unexpected success of National Lampoon's Animal House, which was also a movie made by a comedy magazine about a group of misfits at college. In 1983, Mad publisher Bill Gaines explained the genesis of his magazine's involvement in the film to the Comics Journal:\n\n&quot;What happened is that we had a contract with Warner Brothers to put out a Mad movie. It's like four years old now. They came up with a script that we didn't like, and then they came up with a script using our scriptwriters that they didn't like, but meanwhile they threw this script onto our desk... Although there were many things in it that I thought were offensive and should be removed, generally I liked the script. And I thought, 'Well, in addition to a Mad movie, there's nothing wrong with having something like Lampoon did with Animal House. Animal House was &quot;Lampoon Presents&quot; and really had nothing to do with the magazine, it was just using their name, and it was a good movie, and it was very successful, and it made Lampoon a lot of money. I guess. So we were going to do the same thing. &quot;Mad Magazine Completely Disassociates Itself from Up the Academy&quot;. But that was too long for them, they can't think in that many words. They put the damn thing out without all the deletions they had promised to make, which means they're liars. I'm talking about one of my sister companies [laughter]... And there we were connected with it, and there wasn't much we could do about it. I paid Warner Brothers 30 grand to take Mad's name off for television. So for $30,000 we got out of being associated with it on Home Box Office. It won't say &quot;Mad Magazine Presents&quot; and Alfred E. Neuman won't be in it. And it was well worth $30,000. [laughter]&quot;[1]\nIt was directed by Robert Downey, and starred Wendell Brown, Tommy Citera, Harry Teinowitz, Hutch Parker (younger brother of Parker Stevenson and now known as movie executive J. Hutchison), Tom Poston, Ralph Macchio (his screen debut) and King Coleman. The movie was filmed entirely in Salina, Kansas, mostly on the campus of St. John's Military School.[2]&quot;\n\nAlso according to Wikipedia:\nDirected by\tRobert Downey\nProduced by\tDanton Rissner\nMarvin Worth\nWritten by\tTom Patchett\nJay Tarses\nStarring\tWendell Brown\nTommy Citera\nRon Leibman\nHarry Teinowitz\nHutch Parker\nRalph Macchio\nTom Poston\nKing Coleman\nCinematography\tHarry Stradling Jr.\nEditing by\tBud Molin\nRon Spang\nDistributed by\tWarner Bros. Pictures\nRelease date(s)\tJune 6, 1980 (New York City, New York)\nRunning time\t87 min.\nCountry\t\nLanguage\tEnglish\n\n","torrent":{"xt":"urn:btih:6cd42aa07abef5eb8ce070ceabe4dd27cea6230e","amp;dn":"Up+the+Academy+%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd42aa07abef5eb8ce070ceabe4dd27cea6230e","infoHashBuffer":{"type":"Buffer","data":[108,212,42,160,122,190,245,235,140,224,112,206,171,228,221,39,206,166,35,14]},"announce":[],"urlList":[]}}