{"title":"The Rough Guide to Poker {BBS}","uid":7331022,"size":6686740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6df1d304e2b4b5f1424d4ec3a6afe3b7db441b72&amp;dn=The+Rough+Guide+to+Poker+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1338910596,"description":"The Rough Guide to Poker is the ultimate companion to the world's most famous card game. This essential guide tracks the game's history, from its early beginnings on the Mississippi riverboats, right up to the current global boom in online playing and televised tournaments. Known for its mystique, glamour and notoriety, the guide looks at the game's most famous poker faces, from playing legends Johnny Moss and Thomas &quot;Amarillo Slim&quot; Preston, to US President Richard Nixon and Hollywood celebrities, Brad Pitt and Ben Affleck. There is also section on the rise in popularity of women players, including actress Linda Fiorentino who won her part in Men In Black in a poker match. The guide also looks at the global fascination with poker, from its starring role in recent blockbuster movies to the current buzz in celebrity TV poker. The heart of the guide looks at the many different versions of the game, with detailed explanations on how to play, and plenty of useful, insider advice, tips and secrets on how to become a successful player. From the glamorous casinos of Las Vegas to the top online poker sites - this guide looks at the very best places to play the game and comes complete with a full glossary of poker terms to make sure you get the most from your hand...and that's no bluff! \n\n\nPaperback: 256 pages\nPublisher: Rough Guides (27 Oct 2005)\nLanguage English\nISBN-10: 1843536692\nISBN-13: 978-1843536697","torrent":{"xt":"urn:btih:6df1d304e2b4b5f1424d4ec3a6afe3b7db441b72","amp;dn":"The+Rough+Guide+to+Poker+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df1d304e2b4b5f1424d4ec3a6afe3b7db441b72","infoHashBuffer":{"type":"Buffer","data":[109,241,211,4,226,180,181,241,66,77,78,195,166,175,227,183,219,68,27,114]},"announce":[],"urlList":[]}}