{"title":"Harland-Brave New World-Different Projection(1984)","uid":4645074,"size":574839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6df211acf71207c8b07f1280171451c93f8af71e&amp;dn=Harland-Brave+New+World-Different+Projection%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"red_gonzo","files":1,"time":1231853851,"description":"This is John Harland's amazing book Brave New World - A Different Projection (1984) where the author together with his girlfriend Jill join forces to experience and evaluate various philosophies in order to create a new (and better) world. A rebel of the sixties generation has now matured and found words for his thoughts. In San Francisco John Harland, at nineteen, and an eighteen year old runaway named Jill, joined forces to create a new world. They explored and rejected various alternative lifestyles before discovering what they wanted. Harland tells their experiences and findings and he tells much more. Along with his examination of lifestyles he and Jill explored, he examines what's wrong with the establishment, with emphasis on manipulation by word-conditioning, and looks at many well-known doomsday books, such as Huxley's Brave New World, Orwell's 1984, Zamyatin's We, and H.G. Well's Time Machine. Brave New World is a provocative, multi-dimensional book written from the perspective of a young man now backing his youthful thoughts and actions with experience and clear words. Harland may not be voicing the consensus thoughts of the sixties rebels but his world is startlingly new - and exclusively for the brave. 125 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:6df211acf71207c8b07f1280171451c93f8af71e","amp;dn":"Harland-Brave+New+World-Different+Projection%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df211acf71207c8b07f1280171451c93f8af71e","infoHashBuffer":{"type":"Buffer","data":[109,242,17,172,247,18,7,200,176,127,18,128,23,20,81,201,63,138,247,30]},"announce":[],"urlList":[]}}