{"title":"Peter T. Leeson - The Invisible Hook. The Hidden Economics of Pi","uid":10279378,"size":2004752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e41bfaaf3a01f6b70ca18b107f79ef0bc3b757d&amp;dn=Peter+T.+Leeson+-+The+Invisible+Hook.+The+Hidden+Economics+of+Pi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401675147,"description":"Description\nProduct Details\nBook Title: The Invisible Hook: The Hidden Economics of Pirates\nBook Author: Peter T. Leeson\nPublisher: Princeton University Press (March 31, 2009)\nLanguage: English\nISBN-10: 0691137471\nISBN-13: 978-0691137476\n\n===================================================================================\nBook Description\nPublication Date: March 31, 2009\nPack your cutlass and blunderbuss--it's time to go a-pirating! The Invisible Hook takes readers inside the wily world of late seventeenth- and early eighteenth-century pirates. With swashbuckling irreverence and devilish wit, Peter Leeson uncovers the hidden economics behind pirates' notorious, entertaining, and sometimes downright shocking behavior. Why did pirates fly flags of Skull &amp; Bones? Why did they create a &quot;pirate code&quot;? Were pirates really ferocious madmen? And what made them so successful? The Invisible Hook uses economics to examine these and other infamous aspects of piracy. Leeson argues that the pirate customs we know and love resulted from pirates responding rationally to prevailing economic conditions in the pursuit of profits.\nThe Invisible Hook looks at legendary pirate captains like Blackbeard, Black Bart Roberts, and Calico Jack Rackam, and shows how pirates' search for plunder led them to pioneer remarkable and forward-thinking practices. Pirates understood the advantages of constitutional democracy--a model they adopted more than fifty years before the United States did so. Pirates also initiated an early system of workers' compensation, regulated drinking and smoking, and in some cases practiced racial tolerance and equality. Leeson contends that pirates exemplified the virtues of vice--their self-seeking interests generated socially desirable effects and their greedy criminality secured social order. Pirates proved that anarchy could be organized.\nRevealing the democratic and economic forces propelling history's most colorful criminals, The Invisible Hook establishes pirates' trailblazing relevance to the contemporary world.\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nEconomist Leeson leads readers though a surprisingly entertaining crash course in economics in this study of high seas piracy at the turn of the 18th century. Far from being the bloodthirsty fiends portrayed in popular culture, pirates created a harmonious social order; through the application of rational choice theory, the author explains how a common pursuit of individual self-interest led pirates to create self-regulating, democratic societies aboard their ships, complete with checks and balances, more than half a century before the American and French revolutions brought such models to state-level governance. Understanding the profit motive that guided pirates' actions reveals why pirates so cruelly tortured the crews of ships that resisted boarding, yet treated those who surrendered readily with the utmost respect. Both practices worked to minimize costs to the pirate crew by discouraging resistance that could lead to loss of life and limb for pirates and damage to either the pirates' ship or the cargo aboard. Illustrated with salty tales of pirates both famous and infamous, the book rarely bogs down even when explaining intricate economic concepts, making it a great introduction to both pirate history and economic theory. (June)\n\n===================================================================================\nReviews\nOne of San Francisco Chronicles 100 Best Books for 2009\nWinner of the 2009 Best International Nonfiction Book, Week\nWinner of the 2009 Gold Medal Book of the Year Award in Business and Economics, ForeWord Reviews\n\n&quot;A brisk, clever new book, The Invisible Hook, by Peter T. Leeson, an economist who claims to have owned a pirate skull ring as a child and to have had supply-and-demand curves tattooed on his right biceps when he was seventeen, offers a different approach. Rather than directly challenging pirates' leftist credentials, Leeson says that their apparent espousal of liberty, equality, and fraternity derived not from idealism but from a desire for profit.&quot;--Caleb Crain, New Yorker\n\n&quot;Surprising and engaging . . . . [Leeson's] seminars must be wildly popular.&quot;--Stephen Sedley, London Review of Books\n\n&quot;Economist Leeson leads readers though a surprisingly entertaining crash course in economics in this study of high seas piracy at the turn of the 18th century. . . . Illustrated with salty tales of pirates both famous and infamous, the book rarely bogs down even when explaining intricate economic concepts, making it a great introduction to both pirate history and economic theory.&quot;--Publishers Weekly\n\n&quot;Mr. Leeson's book represents a serious attempt to use the tools of economics to make sense of the institutions of piracy. The book is another example of economic imperialism, the use of economics to make sense of real world phenomena that are outside the standard realm of economic science. It addresses an important force that did, and does, impact world trade. But as the skull and crossbones on its spine suggests, the book is also just fun. . . . [T]he book manages to be entertaining and informative. It is a fun read and provides parents with something to teach their children while looking for pirate treasure left long ago at the beach.&quot;--Edward Glaeser, Economix blog, NYTimes.com\n\n&quot;The Invisible Hook is an excellent book by one of the most creative young economists around.&quot;--Steven D. Levitt, Freakonomics blog\n\n&quot;Peter T. Leeson has done his part to dispel the pirate myths by using economic theory to explain pirate behavior and organization in his exemplary new book. . . . Mr. Leeson has produced a fresh perspective on an old topic. . . . The Invisible Hook is quick-paced but thought-provoking. Based on this work, the reader should look forward to more books by the author.&quot;--Claude Berube, Washington Times\n\n&quot;Piracy has not been Leeson's only obsession. The other has been economics. When he was 17 years old he had supply and demand curves tattooed on his right bicep . . . now the professor has brought his two enthusiasms together in a wonderful (and wonderfully titled) new book. The Invisible Hook is his study of the hidden economics of piracy.&quot;--Daniel Finkelstein, Times\n\n&quot;Jauntily characterising the typical pirate ship as akin to 'a Fortune 500 company', [Leeson] reorients pirates as precursors of Milton Friedman and the Chicago school of economics.&quot;--Ludovic Hunter-Tilney, Financial Times\n\n&quot;One of the finest introductory courses in economics since Henry Hazlitt's Economics in One Lesson. . . . The Invisible Hook is a good addition to the genre of popular economics: a fun and enlightening read, and rock solid in its scholarly bona fides.&quot;--Michael Shermer, Nature\n\n&quot;From countless films and books we all know that, historically, pirates were criminally insane, traitorous thieves, torturers and terrorists. Anarchy was the rule, and the rule of law was nonexistent. Not so, dissents George Mason University economist Peter Leeson in his myth-busting book, The Invisible Hook, which shows how the unseen hand of economic exchange produces social cohesion even among pirates.&quot;--Michael Shermer, Scientific American\n\n&quot;Given the flurry of piracy off the Somali coast in 2009, this relatively short narrative could not be timelier. The Invisible Hook, a play on Adam Smith's famous 'invisible hand,' is an engaging, informative look at the economics of piracy and pirates.&quot;--Choice\n\n&quot;Peter Leeson, an economics professor at George Mason University, offers a fascinating perspective into the world of Blackbeard, 'Black Bart' Roberts and 'Calico Jack' Rackham in his highly readable book The Invisible Hook.&quot;--J. Peter Pham, San Francisco Chronicle\n\n&quot;An engaging and thorough portrait of high seas banditry that goes beyond the pop-culture stereotypes to argue that though often brutal and always mercenary, pirates were ahead of their time when it came to matters of economic fairness and progressive labor practices.&quot;--Kevin Canfield, Mother Jones\n\n&quot;In The Invisible Hook, Peter Leeson deftly explodes piratical myths . . . . [The Invisible Hook] offers many colourful, meticulously researched insights into the behaviour of some of history's most colourful anti-heroes, and it will appeal to anyone with even passing interests in history, politics, sociology and/or economics.&quot;--Michelle Baddeley, Times Higher Education\n\n&quot;Leeson says history cannot explain all piratical paradoxes. Only economics can disentangle the different strands.&quot;--Leon Gettler, The Age\n\n&quot;Leeson hangs the meat of his pirate tale on a sturdy skeleton of economics. . . . The Invisible Hook is a delightful read, thanks to Leeson's engaging writing. He reduces a veritable mountain of facts and history into an entertainingly educational experience.&quot;--Lewis Perdue, Barron's\n\n&quot;This engaging account is fun to read and full of humor, qualities not often associated with an explanation of economic theory. . . . This reviewer speculates that if more economic texts were written like this one, there would be a glut of economics majors to compensate for the shortage of pirates roaming the Atlantic.&quot;--Karl Helicher, Foreword Magazine\n\n&quot;Peter T. Leeson digs into the dollars and cents of piracy. He urges us to see pirates as economic actors, their behavior shaped by incentives, just like the rest of us. Once you're in an economic state of mind, you can begin to understand actions such as lighting one's beard on fire, voting, being decent to black people, and torturing captives 'for fun'--all equally nutty behaviors to the average 18th--century observer. When Leeson is done guiding you through the pirate world, life on a rogue ship starts to look less like a Carnival cruise with cutlasses and cannons and more like an ongoing condo association meeting at sea.&quot;--Katherine Mangu-Ward, Reason\n\n&quot;Cleverly written and witty. . . . [Casts] a penetrating glance at the social and political motives of these odd outlaw communities.&quot;--Daniele Archibugi, Open Democracy\n\n&quot;Delightful. . . . Examines the hidden order behind the literal anarchy of pirates. . . . Entertaining and educational.&quot;--Roger K. Miller, Tampa Bay Tribune\n\n&quot;What possible connection could there be between economics and a book on piracy? A lot, it turns out. Peter Leeson explains this seemingly bizarre connection in page after page of his witty new book, The Invisible Hook.&quot;--David R. Henderson, Regulation Magazine\n\n&quot;[Offers] not only a thumbnail history of piracy but important insights into the economic way of thinking. . . . Fascinating, entertaining and educational.&quot;--Alan W. Bock, Orange County Register\n\n&quot;[A]n eye-opener. . . . The Invisible Hook is a gripping read that sheds as much light on 21st century economics . . . as it does on 17th and 18th century piracy.&quot;--Ethical Corporation Magazine\n\n&quot;The book wittily demonstrates that economic theories and principles, if not the be-all and end-all, can illuminate notable historical trends.&quot;--Stephen Saunders, Canberra Times\n\n&quot;[W]ell-documented and very readable . . . covers pirates from bow to stern. In addition to some descriptions of high seas navigation, maneuvers and stealth that border on high adventure, Leeson supplies plenty of counterintuitive, even surprising, revelations about pirates. . . . And Leeson explains it all with economics. . . . Bottom line: Peter T. Leeson's The Invisible Hook is an insightful hoot, and scores a couple of extra points for originality. Economics-minded readers who enjoy historical adventure or relish over-the-top 'freakonomics' should get a hearty yo-ho-ho out of this book. Not to mention a 360-degree brain twist before diving into that new Michael Crichton novel.&quot;--Seeking Alpha\n\n&quot;This is an enjoyable read that discusses the management style, branding, employee recruitment and retention, compensation and incentives and strategic planning of pirates and why these systems were effective. There are some valuable lessons to be learned.&quot;--Bill Sutton, Sports Business Journal\n\n&quot;Peter Leeson's The Invisible Hook argues that many of the founding principles of capitalist, liberal democracies are not rooted in the Glorious Revolution or the writing of the Declaration of Independence; but the incentive structures necessary to keep a group of rowdy ocean-bound outlaws working as a team of ruthless sea bandits.&quot;--Tim Wilson, IPA Reviews\n\n&quot;It's Freakonomics meets Pirates of the Caribbean. Jack Hirshleifer meets Jack Sparrow. Fischer Black meets Blackbeard. Adam Smith meets Captain Hook. . . . Peter Leeson claims, 'A pirate ship more closely resembled a Fortune 500 company than the society of savage schoolchildren depicted in William Golding's Lord of the Flies.' And by the end of the book, he had me convinced of it.&quot;--Rick Lax, Las Vegas Weekly\n\n&quot;Leave it to an economist to take our current obsession [with pirates] and peer under it in search of a new interpretation. . . . The Invisible Hook is an entertaining economic history of an era and a way of business rarely considered in such a way. Pirates were rational!&quot;--MIT Sloan Management Review\n\n&quot;Peter T. Leeson . . . puts salty flesh on the bones of the pirates' legend in The Invisible Hook, pulling off the formidable trick of being both rigorous and cheeky. . . . Leeson's lights . . . are bright and convincing. . . . [A] jaunty gem of a book. . . . [H]is argument assuredly does bolster the Chicago School case that the dismal science pervades every human endeavor.&quot;--Jonathan Stevenson, Democracy\n\n&quot;Leeson's book is stimulating, provocative, and, of course, a fun read.&quot;--Douglas Marcouiller, Journal of World Trade Review\n\n&quot;For those who are interested in a quick course in free-market political economy, or in a fresh approach to the history of piracy, The Invisible Hook provides many pleasures and provocations.&quot;--Philip Smallwood, Eighteenth-Century Studies\n\n===================================================================================\nFrom the Back Cover\n&quot;A fresh and provocative take on the Golden Age pirates. Leeson writes with clarity and the depth of his research is impressive.&quot;--Colin Woodard, author of The Republic of Pirates\n\n&quot;Peter Leeson has brought the economists' toolkit to the Spanish Main. Piracy is not just a great topic for Walt Disney movies, but also an important economic phenomenon. Leeson's excellent book helps us to understand who pirates were, and why they chose their infamous occupation. He uses economics to make sense of walking-the-plank and the Jolly Roger. This is a fun book, but also a volume rich with insights and analysis.&quot;--Edward Glaeser, Harvard University\n\n&quot;Light of touch and truly eloquent, The Invisible Hook is a terrific read on a fascinating topic. This is a beautifully written book.&quot;--Geoffrey Brennan, Duke University and University of North Carolina, Chapel Hill\n\n===================================================================================\nAbout the Author\nPeter T. Leeson is the BB&amp;T Professor for the Study of Capitalism in the Department of Economics at George Mason University.\n===================================================================================","torrent":{"xt":"urn:btih:6e41bfaaf3a01f6b70ca18b107f79ef0bc3b757d","amp;dn":"Peter+T.+Leeson+-+The+Invisible+Hook.+The+Hidden+Economics+of+Pi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e41bfaaf3a01f6b70ca18b107f79ef0bc3b757d","infoHashBuffer":{"type":"Buffer","data":[110,65,191,170,243,160,31,107,112,202,24,177,7,247,158,240,188,59,117,125]},"announce":[],"urlList":[]}}