{"title":"The Winning Team (1952) Doris Day,Ronald Reagan Eng","uid":5519051,"size":1269545790,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e56f2f9bd7460d3a6d89626daad736410389a4b&amp;dn=The+Winning+Team+%281952%29+Doris+Day%2CRonald+Reagan+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnefp","files":-1,"time":1272385465,"description":"Ronald Reagan delivers one of his best screen performances as baseball great Grover Cleveland Alexander in The Winning Team. The title refers to the mutually supportive relationship between Alexander and his loving wife Aimee (top-billed Doris Day); with this in mind, is it any surprise that the real Aimee Alexander served as the film's technical advisor. While the basic milestones of Alexander's career are adhered to, the film is a typical Hollywood blend of fact and fancy-plenty of fancy. While playing in the minors, Alexander is is hit on the heat by a batted ball, resulting in the dizziness and double vision that would ever after plague him. After toting up a record of 28 wins with the Philadelphia Phillies, Alex is traded to the Cubs, but World War 1 intervenes. On the battlefield, Alex suffers a recurrence of his double vision; and when he plays his first postwar game with the Cubs, he collapses on the field. Warned that his seizures will persist if he doesn't retire, Alex swears the doctor to secrecy. When the dizzy spells continue, Alex turns to drink. Branded an &quot;alky&quot;, he descends to the depths of a House of David-style team, thence to the humiliation of carnival side shows. With the help and support of both Aimee and his old pal Rogers Hornsby (Frank Lovejoy), Alex stages a spectacular comeback, striking out Yankee Tony Lazzeri during the 1926 World Series and leading his team to victory. The script rearranges the chronology of Alexander's life, suggests incorrectly that the Lazzeri strikeout was the last play in the deciding Series game, and-most amusingly-depicts the unloveable Rogers Hornsby as a 100 % sweetheart. Otherwise, The Winning Team provides an excellent showcase for Ronald Reagan-though in later years he expressed some reservations about the script, noting that, by adhering to Warner Bros' insistence that the word &quot;epilepsy&quot; never be spoken, the picture confused audiences as to the true nature of Alexander's affliction. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0045332/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0045332/&lt;/a&gt;\n\nDirector:\nLewis Seiler\n\n        Doris Day\t ... \tAimee Alexander\n\n\tRonald Reagan\t... \tGrover Cleveland Alexander\n\tFrank Lovejoy\t... \tRogers Hornsby\n\tEve Miller\t... \tMargaret Killefer\n\tJames Millican\t... \tBill Killefer\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:38:15\nMovie complete : Yes\n\n[Video]\nResolution : 720x544  4:3\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 1595 Kbps\nQuality Factor : 0,17 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks \n\nJohn","torrent":{"xt":"urn:btih:6e56f2f9bd7460d3a6d89626daad736410389a4b","amp;dn":"The+Winning+Team+%281952%29+Doris+Day%2CRonald+Reagan+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e56f2f9bd7460d3a6d89626daad736410389a4b","infoHashBuffer":{"type":"Buffer","data":[110,86,242,249,189,116,96,211,166,216,150,38,218,173,115,100,16,56,154,75]},"announce":[],"urlList":[]}}