{"title":"Unbreak My Heart: A Memoir - Toni Braxton - Audiobook MP3","uid":10363087,"size":223209313,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e999d3bf422d03008c72a4a0f4e2bd2b335682e&amp;dn=Unbreak+My+Heart%3A+A+Memoir+-+Toni+Braxton+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402838387,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nUnbreak My Heart: A Memoir\n\nWritten by: Toni Braxton\nNarrated by: Robin Eller\nLength: 7 hrs and 43 mins\nFormat: Unabridged\nRelease Date:05-20-14\nProgram Type: Audiobook\n\nThe best-selling solo R&amp;B artist finally opens up about her rocky past and her path to redemption.\n\nWhile Toni Braxton may appear to be living a charmed life, hers is in fact a tumultuous story: A tale of personal triumph after a public unraveling. In her heartfelt memoir, the six-time Grammy Award-winning singer and star of WE tv's hit reality series Braxton Family Values is unapologetically honest in revealing the intimate details of her journey.\n\nToni and the entire Braxton clan have become America's favorite musical family, but what fans may not know is the intense guilt Toni once felt when she accepted a recording deal that excluded her sisters. That decision would haunt Toni for years to come, tainting the enormous fame she experienced as a popular female vocalist at the top of the charts. Despite her early accomplishments, Toni's world crumbled when she was forced to file for bankruptcy twice and was left all alone to pick up the pieces.\n\nAlways the consummate professional, Toni rebuilt her life but then found herself in the midst of more heartache. The mother of an autistic child, Toni had long feared that her son's condition might be karmic retribution for some of the life choices that left her filled with remorse. Later, when heart ailments began plaguing her at the age of 41 and she was diagnosed with lupus, Toni knew she had to move beyond the self-recrimination and take charge of her own healing - physically and spiritually.\n\nUnbreak My Heart is more than the story of Toni's difficult past and glittering success: It is a story of hope, of healing, and, ultimately, of redemption.","torrent":{"xt":"urn:btih:6e999d3bf422d03008c72a4a0f4e2bd2b335682e","amp;dn":"Unbreak+My+Heart%3A+A+Memoir+-+Toni+Braxton+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e999d3bf422d03008c72a4a0f4e2bd2b335682e","infoHashBuffer":{"type":"Buffer","data":[110,153,157,59,244,34,208,48,8,199,42,74,15,78,43,210,179,53,104,46]},"announce":[],"urlList":[]}}