{"title":"My.kitchen.rules.s07e09.ws.pdtv.x264.bf1.mkv","uid":13548237,"size":721818085,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6eaf8b3f4fd234d73ddb8372317f20402392d83d&amp;dn=My.kitchen.rules.s07e09.ws.pdtv.x264.bf1.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigfish5","files":1,"time":1455537156,"description":"My Kitchen Rules 2016 Season 7 Episode 09\r\n\r\nTeams are in for a fiery instant restaurant as Melbourne sisters Tasia and Gracia cook up a storm. Will their family recipes impress the judges and the other teams?\r\nTasia and Gracia VIC\r\nWe fight all the time but I think that’s just how we communicate. \r\nSiblings Tasia, 26, and Gracia, 24, can fight like the best of sisters, but they say it only fuels their passion in the kitchen. After growing up in Indonesia, India and Australia, these homely cooks have very big international influences on their cooking style. Just don’t tell anyone they fear they can’t cook rice without a rice cooker!\r\nYou both recently finished studying...\r\nTasia: I finished my post grad (in 2014) and then last year (2015) I’ve just sort of worked two different part-time jobs hoping I might get into MKR. I did my Bachelor in Psychology and then went on to study counselling. I work part-time at a hotel and part-time at an after school.\r\nGracia: I finished my Masters in March (2015) in Bio Medical and Health Sciences so I studied research and I also work part- time at a restaurant.\r\nHow do you get along in the kitchen?\r\nTasia: We argue a lot, but I think because we hang out most of the time, we kind of work around it. We fight all the time but I think that’s how we communicate, it works with us. I think some people might think just because we argue we might not actually work well in the kitchen but that’s how we communicate.\r\nDo you have lots of family recipes?\r\nTasia: I always ask my grandma for recipes but she doesn’t go by recipes, it’s all in her head. She will just tell you what’s in it, not quantities so you have to go back and work that out yourself. As long as we know the main ingredient and we’ve had it before we can work it out.\r\nGracia: That’s for savoury, but for desserts I tend to need a recipe or I’ll memorise it. We do Asian desserts and I make a lot of ice-cream.\r\nWhat do you love about cooking?\r\nTasia: Cooking is therapeutic for me, even though it’s pressure sometimes I just like the end result of creating something. Cooking is something we are both good at so we feel confident doing it. When we invite our friends over we know we can create something nice for them.\r\nWhat would be a normal dinner for you at home?\r\nGracia: We always have rice on the table every night. There’s always two dishes, not ever just one, always a minimum of two on the table. In our family we do tend to cook too much!\r\nTasia: When we have our friends over, we tend to cook more. And our dad notices that when we go out, Gracia, my mum and I we tend to over order.\r\nWhat are your weaknesses in the competition?\r\nGracia: My stress levels get to me a lot. I think because I’m so used to being organised and I love to be organised, I plan everything to the detailed minute. I have lots of timers in my kitchen and they all go off at different times. And I overthink things before they happen.\r\nTasia: Outside the kitchen, people think I get panicked really easily and I get really stressed.\r\nWhat are your most used ingredients?\r\nGracia: Chilli, we use chilli in everything, garlic, onion and shallots.\r\nTasia: The rice cooker is on 24 hours in the kitchen.\r\nGracia: We just have to show we know how to cook it without a rice cooker!\r\nWhat are your other interests other than cooking?\r\nTasia: We love travelling. Gracia and I travel together every year, either with our family or we go somewhere with friends. We do a lot of shopping together. Gracia is into make-up, she has tonnes; and I love shoes.\r\nAre you competitive?\r\nTasia: We’re more competitive with each other than to other people. She’s my constant rival.\r\nWhat’s your food dream?\r\nGracia: We’ve wanted to take the food journey for a long time but at the same time we’ve got, psychology for her, and science for me as a back up. I want to have a dessert bar.\r\nTasia: Of course we will have a savoury in the dessert bar, we have to!","torrent":{"xt":"urn:btih:6eaf8b3f4fd234d73ddb8372317f20402392d83d","amp;dn":"My.kitchen.rules.s07e09.ws.pdtv.x264.bf1.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eaf8b3f4fd234d73ddb8372317f20402392d83d","infoHashBuffer":{"type":"Buffer","data":[110,175,139,63,79,210,52,215,61,219,131,114,49,127,32,64,35,146,216,61]},"announce":[],"urlList":[]}}