{"title":"[1080p] [NubileFilms.] Leyla Black","uid":8138699,"size":1049269486,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6ebb53c27851f38fdf0f575f2fd0105e908830c3&amp;dn=%5B1080p%5D+%5BNubileFilms.%5D+Leyla+Black&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exmnova","files":1,"time":1360767266,"description":"[1080p] [NubileFilms.] Leyla Black (Summer Passion / 01.11.12)\n\n\nA warm outdoor shower caresses brunette babe Leyla Black's smooth skin as she rinses off after an afternoon of sunbathing. She loves the way the water feels, especially against her sensitive breasts as she massages them beneath the spray. When Totti joins her a few moments later, the afternoon heat pales in comparison to the fire blazing between these two lovers.\nTheir kiss evolves into a deeper passion as Totti leads Leyla away from the shower and squeezes her supple ass in supplication. With a smile, Leyla urges him to kneel at her feet to lick and finger her warm hairy pussy.\nBurning with desire, Leyla falls to her knees and wraps her lips around Totti's engorged dick. Taking it into in her mouth after some leisurely licking and sucking, she proceeds to give him an incredible blow job that seems to go on forever.\nFinally the lovers can't stand to remain apart any longer. Lifting Leyla's leg high in the air, Totti thrusts up to sink his hard cock into her welcoming hole. A few wet and wild thrusts in that position feel incredible, but soon Leyla turns and leans forward with her hands on the shower so that Totti can reenter her from behind.\nEager for something more intimate, the pair settles down on a pool chair with Leyla on top controlling the speed of their lovemaking. They switch from cowgirl with Totti suckling Leyla's hard nipples to reverse cowgirl for even deeper penetration. As Leyla's orgasm comes within close reach, she urges her man to bring her over the edge doggy style as she moans her pleasure.\nFulfilled, Leyla helps her man to his own completion by taking him back into her talented mouth. As he reaches the brink of exploding he pulls out and Leyla open her warm, willing mouth to swallow and savor every drop of his cum.\n\n\nScreens:\n\n &lt;a href=&quot;\nhttp://www.pizzzoimg.info/?v=4m9Lh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pizzzoimg.info/?v=4m9Lh.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.pizzzoimg.info/?v=GIYi2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pizzzoimg.info/?v=GIYi2.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6ebb53c27851f38fdf0f575f2fd0105e908830c3","amp;dn":"%5B1080p%5D+%5BNubileFilms.%5D+Leyla+Black","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ebb53c27851f38fdf0f575f2fd0105e908830c3","infoHashBuffer":{"type":"Buffer","data":[110,187,83,194,120,81,243,143,223,15,87,95,47,208,16,94,144,136,48,195]},"announce":[],"urlList":[]}}