{"title":"I Love a Man in Uniform (1993) Directed by David Wellington","uid":4232402,"size":664207992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f1c0f3bff9cfc058924a5a238d0535980823dc8&amp;dn=I+Love+a+Man+in+Uniform+%281993%29+Directed+by+David+Wellington&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tdub.mov","files":1,"time":1213120979,"description":"Title........| I Love a Man in Uniform\nIMDb URL.....| http://www.imdb.com/title/tt0107179/\nYear.........| 1993\nCountry......| Canada\nRunning Time.| 01:38:27\nResolution...| 720 x 384\nFrame Rate...| 23.98\nVideo Codec..| H.264\nAspect Ratio.| 1.85 (Academy Widescreen)\nAudio Codec..| AAC\nSubtitles....| N/A\nFiles........| 1\nSource.......| VHS (PAL)\n\nThis is the native, 1.85:1 theatrical version of David Wellington's &quot;I Love a Man in Uniform,&quot; starring Tom McCamus. This is yet another great film that never got a proper DVD release. Although released to DVD by A-Pix Entertainment in the U.S., the film on the disc is actually the PG-13, or television-edited version. This was most likely a mistake, since the disc itself is labeled &quot;R,&quot; but in the special features section of the DVD the film is listed as &quot;PG-13.&quot; Furthermore, key parts of the movie have been removed on the DVD, ostensibly because they were inappropriate for television. To top it all off, the movie is 4:3 pan-and-scan, cutting off the left and right sides of the picture. Yes, the DVD is a complete mess and should be avoided at all costs!\n\nFortunately, the European VHS release was done correctly -- the film is in its correct 1.85:1 ratio (letterboxed), and the content is uncut from the theatrical version. The version here was converted from this European VHS release. Painstaking measures were taken to preserve every ounce of quality (or, as much as possible from VHS). The film has been converted back to its 24fps rate from the European 25fps rate, and the audio has been restored to its original pitch. Overall, this is a very good H.264 encode of the movie, and can be played as-is or used to make a proper NTSC DVD.\n\nKeep your eyes peeled for more great encodes of films that have been lost or forgotten due to the myriad of mergers, acquisitions and bankruptcies that have rocked the motion picture industry. We've got to preserve those little bits of history, and do it true to the filmmakers' original vision.\n","torrent":{"xt":"urn:btih:6f1c0f3bff9cfc058924a5a238d0535980823dc8","amp;dn":"I+Love+a+Man+in+Uniform+%281993%29+Directed+by+David+Wellington","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1c0f3bff9cfc058924a5a238d0535980823dc8","infoHashBuffer":{"type":"Buffer","data":[111,28,15,59,255,156,252,5,137,36,165,162,56,208,83,89,128,130,61,200]},"announce":[],"urlList":[]}}