{"title":"Clinical Anatomy of the Lumbar Spine and Sacrum - 4th Ed","uid":7753934,"size":28436245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70057678a051ee2f84ac70a5003b0cc67a3212fb&amp;dn=Clinical+Anatomy+of+the+Lumbar+Spine+and+Sacrum+-+4th+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"siliconball","files":1,"time":1351038543,"description":"A foundation textbook for those requiring an understanding of the structure and biomechanics of the lumbar spine and sacrum. The book aims to bring together in one source all of the elements of anatomy and biomechanics which are clinically relevant to the study of lumbar spinal pain. The text has been designed and presented in a format which makes it suitable for use by physiotherapists, occupational therapists, manual therapists and post graduate medical students in fields concerned with the management and prevention of back pain and related conditions such as rheumatology, orthopaedics, occupational medicine, ergonomics' rehabilitation.\nFollows a clear and logical structure\nMakes the link between the pure anatomy and the clinical problems encountered by practitioners\nOnly gives the details required for effective and safe clinical practice - everything in it is relevant to practice\nText well supported with clear and easy to understand line drawings\nWritten by an internationally known and respected expert in the fields of both clinical anatomy and back pain\nFully reference and evidence based\nExtensively revised and updated but without adding extensively to the existing length\nThe comprehensive coverage and logical structure of the previous editions will be maintained\nNew chapter on Radiographic Anatomy","torrent":{"xt":"urn:btih:70057678a051ee2f84ac70a5003b0cc67a3212fb","amp;dn":"Clinical+Anatomy+of+the+Lumbar+Spine+and+Sacrum+-+4th+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70057678a051ee2f84ac70a5003b0cc67a3212fb","infoHashBuffer":{"type":"Buffer","data":[112,5,118,120,160,81,238,47,132,172,112,165,0,59,12,198,122,50,18,251]},"announce":[],"urlList":[]}}