{"title":"Lisa O Piu - Behind the Bend [2010] [EAC/FLAC]","uid":10653390,"size":175626011,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:70b13f8eff0608db2ccf6ce9c23e848c61962b21&amp;dn=Lisa+O+Piu+-+Behind+the+Bend+%5B2010%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1406645028,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Subliminal Sounds #SUBCD 72\nCountry: SW\nYear: April 13, 2010\nGenre: folk,rock\nFormat: CD\n\n\n\n[b]\n\n\n\n1\tWas It The Moon\t3:48\n2\tSimplicity\t4:39\n3\tDream Of Goats\t3:10\n4\tWorld Falling Down\t1:12\n5\tChild Of Trees\t12:03\n6\tGong For Hours (Jupiter's Under The Moon)\t3:29\n\n\n\n\n\nLisa Isaksson's band's first full-length album, When This Was the Future, was one of the most enjoyable surprises (and strongest debuts) in folk music in 2009. Sadly, the hastily released (less than a year later) Behind the Bend does not quite live up to expectations. It's not that the material isn't good, or that the production is flawed. On the contrary. The problem is that there's little to go around. Behind the Bend clocks in at 28 minutes but is marketed as a full-length release: three songs, one mini-epic, and two instrumentals. Instrumentation-wise, the acoustic guitars take a step toward the background, leaving more room for the harp, which tends to elicit more comparisons to Joanna Newsom (and some of these are grounded). Isaksson's aerial voice is everywhere -- singing, backing, weaving textures -- acting as the life and breath of the music. &quot;Was It the Moon&quot; and &quot;Simplicity&quot; are beautiful songs, sung with seriousness and a touch of carelessness, dreaminess too. The ten-minute &quot;Child of Trees&quot; pairs two strong song parts with a somewhat shakier middle instrumental, but it works out well (although not at all like Newsom's long-form compositions). The closing &quot;Gong for Hours&quot; is simply a series of gong strokes over nature recordings -- very Zen, but a weak way to push the album's length up to that murky line between EP and full-length. Given a few more months, it seems certain that Lisa and company could have written more fantastic songs to wow listeners with their sophomore effort, instead of settling for this full-priced EP.","torrent":{"xt":"urn:btih:70b13f8eff0608db2ccf6ce9c23e848c61962b21","amp;dn":"Lisa+O+Piu+-+Behind+the+Bend+%5B2010%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70b13f8eff0608db2ccf6ce9c23e848c61962b21","infoHashBuffer":{"type":"Buffer","data":[112,177,63,142,255,6,8,219,44,207,108,233,194,62,132,140,97,150,43,33]},"announce":[],"urlList":[]}}