{"title":"(PSP-PSX) Looney Toons Sheep Raider","uid":5955794,"size":340413407,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:716589273dc70f540ae496d8721e190c4b113182&amp;dn=%28PSP-PSX%29+Looney+Toons+Sheep+Raider&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fasthandsdan","files":2,"time":1289711654,"description":"Converted with PSX2PSP. For PSP only and Custom firmware required. Also use the latest popsloader. Source disc was NTSC or USA, so may or may not display properly with PAL or EUR systems. \n\nGame is multi-language. Choose ENGLISH, SPANISH, FRENCH, or PORTUGUESE at title.\n\nInfo shamelessly stolen, copied and pasted from ign:\n\n\\&quot;Based on the hilarious stories of a somewhat obscure classic Warner Bros. cartoon, SHEEP RAIDER marks the re-emergence of Sam Sheepdog and Ralph Wolf. As in the cartoon series, Ralph is always trying to steal the sheep, and Sam is in charge of protecting the furry critters. The game is formatted in the style of a game show, and the inimitable Daffy Duck is playing host. You\\'ll play as the sneaky Ralph, and most of the game\\'s levels revolve around capturing sheep. It\\'s not as simple as it sounds. One level has you jet-packing about, while another requires you to collect a series of gadgets that you\\'ll use to make a giant rubber band eventually repelling from a cliff to pull off your heist. The rubber band later reappears as part of a sheep slingshot that you\\'ll have to construct between two trees. Boasting top-shelf cartoon graphics and tons of original gameplay, SHEEP RAIDER is a brilliant retread of a truly great animated series.\\&quot; \n\nThanks, ign. Couldn\\'t have written it better myself :)\n\nThe game is basicly a 3D platformer with the ultimate goal of stealing Sam's entire flock, one sheep at a time, and one per level. Each level requires stealth and cleverness to overcome obstacles from the environment and Sam himself. You get to make use of plenty of ACME products and there are a slew of guest appearances from various classic cartoon characters some of which help you and others as enemies.\n\nCopy and paste folder with eboot into your memory stick\\'s GAME folder. Any problems or questions feel free to ask.\n\nWorking on M33-6, the king of all custom firmwares.","torrent":{"xt":"urn:btih:716589273dc70f540ae496d8721e190c4b113182","amp;dn":"%28PSP-PSX%29+Looney+Toons+Sheep+Raider","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"716589273dc70f540ae496d8721e190c4b113182","infoHashBuffer":{"type":"Buffer","data":[113,101,137,39,61,199,15,84,10,228,150,216,114,30,25,12,75,17,49,130]},"announce":[],"urlList":[]}}