{"title":"Jane Da Silva series by K.K. Beck (01-02)","uid":9670607,"size":547424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71c086870ea31e6083ce3c89f27f43b9b88f0d3d&amp;dn=Jane+Da+Silva+series+by+K.K.+Beck+%2801-02%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1393454680,"description":"\nKathrine Kristine Beck Marris (born 1950), known mainly by her pen name of K. K. Beck, is an American novelist. She has written over a dozen books, some of which were part of the Iris Cooper novel series and the Jane da Silva novel series.\n\nAn early novel of hers, Death of a Prom Queen (1984) was written under the pen name of Marie Oliver. She wrote a series of other novels, under the name K. K. Beck, such as The Revenge of Kali-Ra in 1999. One of her most recent works, The Tell-Tale Tattoo and Other Stories (2002) is a collection of short stories.\n\nGenre: Mystery\n\n\nA Hopeless Case: \n\nJane da Silva knows a Cole Porter tune and a silky voice will only carry you so far through the urbane cabarets of Europe. So when the young widow's &quot;eccentric&quot; Uncle Harold dies, she jets back to the States to claim the fortune she dearly needs to ransom her Visa card. Unfortunately, Jane finds her inheritance conditional and her situation critical. \n\nIt seems Uncle Harold and his old-codger cronies are part of a secret society dedicated to aiding and abetting offbeat lost causes, and Jane must carry on her uncle's &quot;work&quot; if she expects to see anything resembling a windfall. But just how far will the chic expatriate go when her &quot;hopeless case&quot; forces her to mingle with a sleaze-ball lawyer, a scheming psychiatrist, a sinister New Age cult, a stone-cold corpse--and a ruthless murderer?\n\nAmateur Night: \n\nIt's been a long time since she solved her first &quot;hopeless case&quot; and Jane da Silva is running out of money. Her Uncle Harold's bizarre will provides her with a handsome income if she successfully runs his Foundation for Righting Wrongs and pleases its crusty old board of directors. Through Calvin Mason, the young attorney who befriends her, she finds a new Â¿hopeless case. A real hopeless case. Kevin Shea is a teenage drug addict convicted of holding up a pharmacy and killing the druggist's wife. Kevin is such a low-life even his mother is convinced he's guilty and glad he's behind bars. \n\nNow it appears there was a witness to the murders, a young woman whose prescription was being filled at the time of the murder. The witness might be able to prove that Kevin is innocent of the murder. Jane learns that four women with the same name all live in remote areas of Vancouver Island, one of them the missing witness.\n\nThere's someone else who wants to find the missing witness too, someone who isn't afraid to turn to murder when Jane gets too close for comfort. Jane's breath-taking and dangerous romp through the northern wilderness leads her to the Tip Top Club, a stripper bar, where she faces down the clever killerÂ¿and wraps up a satisfactory hopeless case, proving that everyone deserves justice.","torrent":{"xt":"urn:btih:71c086870ea31e6083ce3c89f27f43b9b88f0d3d","amp;dn":"Jane+Da+Silva+series+by+K.K.+Beck+%2801-02%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c086870ea31e6083ce3c89f27f43b9b88f0d3d","infoHashBuffer":{"type":"Buffer","data":[113,192,134,135,14,163,30,96,131,206,60,137,242,127,67,185,184,143,13,61]},"announce":[],"urlList":[]}}