{"title":"Golden Age of Video Games - Full Torrent Collection v1.1","uid":10868945,"size":507425,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:71e09bf07d60bca0ff271c92c2d0253598685f7c&amp;dn=Golden+Age+of+Video+Games+-+Full+Torrent+Collection+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anon62627","files":-1,"time":1408952045,"description":"This is the full torrent collection for the Golden Age of Video Games rom / ISO / emulators collection. It contains all the torrents needed to download the Golden Age of Video Games.\n\nNOTE: this is a new version of the full torrent collection as the following torrents in the previous version somehow became corrupted -\n\n&quot;Golden Age of Video Games - MSX&quot;\n&quot;Golden Age of Video Games - Sega 32X&quot;\n&quot;Golden Age of Video Games - Sega Master System&quot;\n\nAs you can see, new versions of these torrents are in this release, and tested working! Apologies for any inconveniences that may have been caused by the previous version.\n\nSo anyway, what is the Golden Age of Video Games? Well, I spent over ten years researching and playing full game collections (over 10,000 games) of previous generations of video game systems to create a collection that I feel represents the &quot;golden age of video games&quot;. With this collection, posterity may now play a nearly comprehensive collection of the best classic games (even the obscure ones) without tons of research or sorting through full ROM collections that are 90% crud.\n\nNote that due to size, the Sega Saturn and Playstation games of the collection are NOT included in the torrents. However, they are listed in the Documentation folder of the Emulators torrent so that you can attain them in other ways.\n\nNote also that this particular torrent contains only other torrents that each allow you to download the a particular sub-collection of the games themselves.\n\nFor questions, updates, and ongoing discussion, please refer to this forum thread - https://forum.demonoid.ph/index.php?topic=2944.0\n\nLastly, please seed and thanks!","torrent":{"xt":"urn:btih:71e09bf07d60bca0ff271c92c2d0253598685f7c","amp;dn":"Golden+Age+of+Video+Games+-+Full+Torrent+Collection+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e09bf07d60bca0ff271c92c2d0253598685f7c","infoHashBuffer":{"type":"Buffer","data":[113,224,155,240,125,96,188,160,255,39,28,146,194,208,37,53,152,104,95,124]},"announce":[],"urlList":[]}}