{"title":"Circuit Breakers PSX (PSOne) 4-player racing works on PC thru eP","uid":8544464,"size":347399346,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:723c322e192569f9922b4c32e77e9306beb11bd0&amp;dn=Circuit+Breakers+PSX+%28PSOne%29+4-player+racing+works+on+PC+thru+eP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1370485345,"description":"Circuit Breakers originally for PSX (PSOne) \nThis is a CD-Image (MDS/MDF) copy of the original PAL version of the game.\n\nI have tested it working with PAL BIOS in ePSXe PC/Windows emulator as well as an old Playstation (burn to a CD-R at 8x or slower!) I'm sure it will work in other emulators and I heard it runs good on the oldskool/modded PS3's\n\n4-player racing. Its a hectic and fun game thats great to make a drinking game of.\n\n\n&quot;CIRCUIT BREAKERS is new kind of racing game. Rather than racing on road courses, the tracks are more like roller coaster rides, with hairpin turns and drastic drops. And, like a roller coaster, there are no walls to keep you on the track. So, missing a turn will throw you into the abyss and cost you valuable time. Your ability to stay on course is tested in three play modes: World Series, Battle, and Time Trial. In World Series, try to beat seven opponents in 16 different races. Battle mode allows you to challenge three friends to a race. If you find the track too crowded, tackle the Time Trial mode and create new world records for each track. In all modes, the courses are littered with power ups including rocket boosters, shrinkers, and oil slicks that give the player a competitive edge. If you're tired of the same old racing games, give CIRCUIT BREAKERS a try.\nRelease Date: Sep 2, 1998&quot;\n\n\nCircuit Breakers is a racing game similar to Micro Machines and Ignition, where the vehicles resemble toys viewed from above. The game lets the player control cars (of various models), boats and submarines that change according to the track.\n\nThe tracks have power-ups. They can be collected and activated and have negative and positive effects. Most are standard power-ups from this type of game, like speed boosts and oil leaks. Some are more bizarre, making the vehicle bigger or smaller, or making it bounce or fly.\n\nThe tracks are organized by theme and difficulty. By winning races the player receives access to increasingly more challenging tracks. The game controls are particularly sensitive, and getting out of the path often makes the vehicle explode.\n\nInstead of a fixed camera, the game usually changes angles when the vehicle reaches certain points of the track. The camera can go as low as behind the vehicle, and go high to a &quot;bird's eye&quot; viewpoint.\n\nMulti-player mode has its own set of tracks. It supports up to 4 players (using a multi-tap or on PC-Emulator)\n\n\n\nThis game is great fun with 2, 3 or 4 players! The camera may seem weird at first, but it is part of the game's fun once you learn how to use it to your advantage to knock out your &quot;friends&quot;.\n\nThis website has more info on how to work with iso's/roms for the emulators as well as a list of tested-working emulators and a direction download for the U version of the game: http://www.emuparadise.me/Sony_Playstation_ISOs/Circuit_Breakers_%5BU%5D/36681 (I haven't tried their ISO so can't couch for it).","torrent":{"xt":"urn:btih:723c322e192569f9922b4c32e77e9306beb11bd0","amp;dn":"Circuit+Breakers+PSX+%28PSOne%29+4-player+racing+works+on+PC+thru+eP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723c322e192569f9922b4c32e77e9306beb11bd0","infoHashBuffer":{"type":"Buffer","data":[114,60,50,46,25,37,105,249,146,43,76,50,231,126,147,6,190,177,27,208]},"announce":[],"urlList":[]}}