{"title":"Street Drum Corps &amp; Bert McCracken-Happy Xmas (War Is Over)","uid":5201353,"size":158607364,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7298ad3bdcdba31a88ecb86733caceb11b989539&amp;dn=Street+Drum+Corps+%26+Bert+McCracken-Happy+Xmas+%28War+Is+Over%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260184042,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nStreet Drum Corps feat. Bert McCracken - Happy Christmas (War Is Over)\n\n\n\n&quot;Happy Xmas (War Is Over)&quot; is a Christmas song by John Lennon, Yoko Ono and the Plastic Ono Band. It was recorded at Record Plant Studios in New York City in late October of 1971, with the help of producer Phil Spector. It features soaring, heavily echoed vocals, and a sing-along chorus. The children singing in the background were from the Harlem Community Choir and are credited on the song's single.\n\nAlthough the song is a protest song about the Vietnam War, it has become a Christmas standard and has appeared on several Christmas albums.\n\nStreet Drum Corps, along with Bert McCracken recorded a cover available on the Christmas album The Taste of Christmas that was also released as a single.\n\nStreet Drum Corps is a punk rock percussion band that was started in April 2004 by Bobby Alt (S.T.U.N., Faculty X), Adam Alt (Circus Minor), and Frank Zummo (TheStart).\n\nThe group uses instruments such as hand drums, acoustic drum kits, buckets, kitchenware, recycled aluminium garbage cans, rain barrels, marching band equipment, and even power tools to produce a grinding effect.\n\nIn past performances, Street Drum Corps has enjoyed the company of members of Stomp, No Doubt, Bad Religion, Good Charlotte, Linkin Park, Atreyu, 30 Seconds to Mars, Strung Out, Alexisonfire, and many others. Bert McCracken of The Used and Airin Older of Sugarcult has performed with Street Drum Corps several times, and shares the stage with them for the song &quot;Flaco 81&quot; as well as part of his own band's set on their current tour. Joining the Van's Warped Tour, the band was featured in a documentary, Wake Up Screaming, about the Warped Tour experience. Recently SDC has been touring with the Rockstar Taste of Chaos tour, appearing on stage during the Deftones performances.\n\nRobert Edward McCracken (born February 25, 1982), known professionally as Bert McCracken, is the lead singer of the American rock band The Used.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7298ad3bdcdba31a88ecb86733caceb11b989539","amp;dn":"Street+Drum+Corps+%26+Bert+McCracken-Happy+Xmas+%28War+Is+Over%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7298ad3bdcdba31a88ecb86733caceb11b989539","infoHashBuffer":{"type":"Buffer","data":[114,152,173,59,220,219,163,26,136,236,184,103,51,202,206,177,27,152,149,57]},"announce":[],"urlList":[]}}