{"title":"Dennis C. Mueller - Constitutional Democracy [2000][A]","uid":10395593,"size":24852607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7317bdb1979e1c88b2547ff940572f7235207697&amp;dn=Dennis+C.+Mueller+-+Constitutional+Democracy+%5B2000%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403263256,"description":"Description\nProduct Details\nBook Title: Constitutional Democracy\t\nBook Author: Dennis C. Mueller\nPaperback: 400 pages\nPublisher: Oxford University Press; New Ed edition (November 30, 2000)\nLanguage: English\nISBN-10: 0195144074\nISBN-13: 978-0195144079\n\n===================================================================================\nBook Description\nPublication Date: November 30, 2000 | ISBN-10: 0195144074 | ISBN-13: 978-0195144079 | Edition: New Ed\nThis volume systematically examines how the basic constitutional structure of governments affects what they can accomplish. At a time when Americans are more and more disillusioned about government's fundamental ability to reach solutions for domestic problems, and when countries in the former Soviet block and around the world are rewriting their constitutions, the relationship between government and constitution is especially important. Political economist Dennis Mueller illuminates the links between the structure of democratic government and its outcomes by drawing comparisons between the American system and other systems around the world. Working from the &quot;public choice&quot; perspective in political science, the book analyzes electoral rules, voting rules, federalism, citizenship, and separation of powers, making it a valuable resource for anyone curious about the world's political environment.\n\n===================================================================================\nReviews\n&quot;...Constitutional Democracy is a useful addition to the literature on public choice theory and on constitutions. It opens up an interesting area for discussion and deserves to be widely studied.&quot;--The American Journal of Legal History\n\n&quot;...An extaordinarily interesting book. Those who dislike public choice literature because of its frequent use of symbolic notation and first or second derivatives will be pleasantly surprised by Mueller's book. It is almost entirely prose and leaves the mathematical proof of his statements to notes. A tremendous advantage of Mueller's book is that it provides material for the teaching of many courses.&quot;--The Law and Politics Book Review\n\n&quot;...Mueller has done a superb job in bringing together in one volume a very complete coverage of the essential economics....Constitutional Democracy will become the standard reference for those who take the next step to constitutional economics.&quot;--Constitutional Political Economy\n\n===================================================================================\nAbout the Author\nDennis C. Mueller is Professor of Economics at the University of Vienna.\n===================================================================================","torrent":{"xt":"urn:btih:7317bdb1979e1c88b2547ff940572f7235207697","amp;dn":"Dennis+C.+Mueller+-+Constitutional+Democracy+%5B2000%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7317bdb1979e1c88b2547ff940572f7235207697","infoHashBuffer":{"type":"Buffer","data":[115,23,189,177,151,158,28,136,178,84,127,249,64,87,47,114,53,32,118,151]},"announce":[],"urlList":[]}}