{"title":"The Phil Hendrie Show 1999-2005 mp3 fixes by nirv","uid":10642639,"size":2115888715,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:73ff35ef7192c90d8db336208cac1d7c72a92b3d&amp;dn=The+Phil+Hendrie+Show+1999-2005+mp3+fixes+by+nirv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nirvy","files":154,"time":1406495356,"description":"2014-07-06\nver 1.0\n\nThis is just a short write-up for the Phil Hendrie Ultimate Collection fixes.\nThe official Phil Hendrie Show website has almost every classic show from 1999-2006 in high quality. However, there \nare varying issues with some of the shows. Some entire shows are missing, some clips or segments inside of a certain show are missing, \nor some have sound quality issues. \n\nFor the full list of detailed information on each show, see the only guide you'll ever need to the Phil Hendrie Show\nthat is still being revised to this day: https://docs.google.com/spreadsheet/ccc?key=0AqIcqsWTtH3HdGVrcnl2ZXJyN21LQy1weG81R3E0NUE#gid=0\n\nPlease transfer these files into their proper folders along with the official Phil Hendrie mp3s obtained from the website. Remove \nthe original broken mp3s and put them into a separate folder for backup. Listen to my fixes and you will see that it makes the Hendrie collection far more \nOCD-compliant as you no longer have to jump around reruns, find .wmv or .rm files that contain missing segments, or search around online for bootlegs of missing \nshows; with these files, you now have a near-complete classic collection. If you find the fixed mp3s are perfect, feel free to delete the original bungled ones you \ngot from Hendrie's site.\n\nAll changes and edits made to this fixed collection were done in Adobe Audition CC 2014. Bootleg files that were originally .asf (Real Media Stream) files \nwere converted to .wav with FormatFactory 3.3.5 and saved as an mp3. Quality was retained.\n\nEach fixed year has an included .sfv file. This file is used to verify the CRC of a file to make sure it is 100% complete on your hard drive. \nA good tool to use to open this sfv to verify your downloads is QuickSFV: http://www.quicksfv.org/download.html\n\nLegend:\n(Filled) means the show was rerun on another date and was copied and named appropriately. \nThe original mp3 on the original air date was not available, but a rerun is just as good. The loudness may have been adjusted to match the other hours.\n(Fixed) means a part of the show was missing, or the file played too fast and Phil sounded like a Chipmonk. Or segments were copied from the .wma or .rm and \nintegrated at the correct time in the show. Generally technical errors.\n(Bootleg) means somebody recorded the show live somehow. Often a direct Real Media stream or directly from a radio source. Bootlegs are not idea, but they will be used if it's all we have.\n(Incomplete) Source file is from PhilHendrieShow.com, but it's missing content one way or another. \n\nFeedback and criticism welcome!\nShould you find any problems with the content or if something was pasted into the wrong file, let me know on the PhilHendrieShowFans forums! &lt;a href=&quot;\nhttp://philhendrieshowfans.com/forum/memberlist.php?mode=viewprofile&amp;u=13636&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://philhendrieshowfans.com/forum/memberlist.php?mode=viewprofile&amp;u=13636&lt;/a&gt;\n\nYou can also email me at\n\nSkype: bitcrunch (I much prefer Skype calls over emails or text.)\n\nAlso, if you have missing content from shows marked incomplete, be sure to contact me so I can fill it. I would like to have as complete a Hendrie collection \nbetween 1999-2006 as possible. \n\nKnown missing or incomplete shows:\nPhil Hendrie Show - 2000-01-26 - Hour 1 (first show from Premiere Radio Networks)\nPhil Hendrie Show - 2000-06-01 (all 3 hours)\nFor incomplete shows, please read the file names or the Ultimate Phil Hendrie Show Guide for details.\n\n\nThanks:\nJackball (provided a huge 310GB Hendrie archive)\nkiwi_ (provided missing files and noted many corrections in show descriptions. continues to share his collection despite his slow connection!)\nrolypolyman (for his huge effort in creating the Ultimate Phil Hendrie Show Guide--the best most complete guide available. he's a goddamned Jedi)\noh_god_i_gotta_rock (provided the last few missing HQ wmv and rm files. you are awesome dude)\nBudDickman (provided show descriptions and the first HQ versions of the rare &quot;Best Of&quot; CDs.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:73ff35ef7192c90d8db336208cac1d7c72a92b3d","amp;dn":"The+Phil+Hendrie+Show+1999-2005+mp3+fixes+by+nirv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73ff35ef7192c90d8db336208cac1d7c72a92b3d","infoHashBuffer":{"type":"Buffer","data":[115,255,53,239,113,146,201,13,141,179,54,32,140,172,29,124,114,169,43,61]},"announce":[],"urlList":[]}}