{"title":"Mark Eric - A Midsummer's Day Dream (1969) MP3@320","uid":9634513,"size":81977360,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:741eb1497a0915ef7c86251a68de6b3de20c70c8&amp;dn=Mark+Eric+-+A+Midsummer%27s+Day+Dream+%281969%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":13,"time":1392829994,"description":"Mark Eric (whose real name is Mark Eric Malmborg) wasn't the most original composer of his day, and yet years after its 1968 release his long out-of-print one-off soft pop LP for Revue (a UNI/MCA subsidiary) commands a fairly high price from soft pop collectors who've managed to nab themselves a copy. The reason? A Midsummer's Day Dream is treasured by collectors as one of the more perfect blends of soft pop and surf pop, with appropriately accenting vibraphones and French horns, pseudo-studio jazzy/soft pop melodies, &quot;bah bah bah&quot; harmonies, and moody string arrangements reminiscent of Curt Boettcher's productions of Sagittarius and the Millennium. \n\nEric's charming, somewhat imperfect falsetto (in a somewhat obvious homage to Brian Wilson) hints at a subterranean layer of loneliness throughout. His self-penned, broken-hearted Beach Boys-style ballads (think Pet Sounds/Friends) are, in fact, the perfect vehicle for his faltering upper-register voice. Highlights include &quot;California Home&quot; (about a homesick airplane flight away from L.A.); an end-of-summer lament, &quot;Where Do the Girls of the Summer Go&quot;; and &quot;Don't Cry Over Me,&quot; with its gorgeous blend of harmonic filigree and sophisticated studio sheen. Eric -- who as an actor appeared on TV's The Partridge Family as the pal of Snake (a biker played by a pre-Meathead Rob Reiner) -- apparently never recorded another album.","torrent":{"xt":"urn:btih:741eb1497a0915ef7c86251a68de6b3de20c70c8","amp;dn":"Mark+Eric+-+A+Midsummer%27s+Day+Dream+%281969%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"741eb1497a0915ef7c86251a68de6b3de20c70c8","infoHashBuffer":{"type":"Buffer","data":[116,30,177,73,122,9,21,239,124,134,37,26,104,222,107,61,226,12,112,200]},"announce":[],"urlList":[]}}