{"title":"Reggae 24 Bit Vinyl Pack","uid":8996818,"size":3222066148,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:749f3492ae90ee459f03842e32d5aef94c9895af&amp;dn=Reggae+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1380884224,"description":"\n  Reggae 24 Bit Vinyl Pack\n  \n  Genre: Reggae\n  Styles: Political Reggae, Roots Reggae, Rocksteady\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1975 Jimmy Cliff - Brave Warrior \n  1976 Peter Tosh - Legalize It\n  1978 Jimmy Cliff - Give Thanx \n  1980 Lee &quot;Scratch&quot; Perry - The Return of Pipecock Jackxon\n\n  Jimmy Cliff\n \n  It's one of the music industry's great ironies that today, outside of reggae circles, Jimmy Cliff is perhaps better known for his film appearances than his music. Even after a string of hits, the singer never quite managed to break into the mainstream, although he seemed poised for international stardom during the late '60s/early '70s. The singer was born in St. Catherine, Jamaica, on April 1, 1948, with the less prosaic name James Chambers. His talent was evident from childhood, and he began his career appearing at local shows and parish fairs. Feeling ready for the big time at the age of 14, he moved to Kingston and took the surname Cliff to express the heights he intended on reaching. Cliff recorded two unsuccessful singles before he was spotted by Derrick Morgan, who brought him to Leslie Kong. His first single for the budding producer, &quot;Hurricane Hattie,&quot; was an instant hit. Unusually, Cliff remained with Kong until the producer's death; most Jamaican artists flit from studio to studio. The singer's loyalty was rewarded, however, by a string of follow-up hits. In the early years, the pair helped set the ska scene alight, both in Jamaica and in Britain, where the singer's singles were picked up by Island Records. &quot;Miss Jamaica,&quot; &quot;King of Kings,&quot; &quot;One Eyed Jacks,&quot; and &quot;Pride and Passion&quot; have since become classics of the original ska era.\n\n  Peter Tosh\n\n  Singer, musician, composer, and rebel Peter Tosh cut a swathe through the Jamaican musical scene, both as a founding member of the Wailers and as a solo artist. He toured with the Rolling Stones and had an international hit with a duet with Mick Jagger, then toured again to equally rapturous world audiences as the headlining act. His words would cause an uproar at the One Peace concert, but then unlike fellow Wailer Bob Marley, Tosh always made his true feelings known. He was born Winston Hubert McIntosh on October 19, 1944, in the small rural village of Grange Hill, Jamaica. Like so many young island teens searching for a better life, he left home at 15 and headed for Kingston. Once there, he made his way to Joe Higgs' tenement yard, joining other aspiring youths eager for the vocal coaching lessons the singing star provided to local teens. Amongst these youthful wannabes were Bunny, Bob Marley, and the much younger Junior Braithwaite; the four, buttressed by backing vocalists Cherry Green and Beverley Kelso, joined forces initially as the Teenagers before eventually settling on the moniker the Wailers.\n\n  Lee &quot;Scratch&quot; Perry\n\n  Some call him a genius, others claim he's certifiably insane, a madman. Truth is, he's both, but more importantly, Lee Perry is a towering figure in reggae -- a producer, mixer, and songwriter who, along with King Tubby, helped shape the sound of dub and made reggae music such a powerful part of the pop music world. Along with producing some of the most influential acts (Bob Marley &amp; the Wailers and the Congos to name but two) in reggae history, Perry's approach to production and dub mixing was breathtakingly innovative and audacious -- no one else sounds like him -- and while many claim that King Tubby invented dub, there are just as many who would argue that no one experimented with it or took it further than did Lee Perry.","torrent":{"xt":"urn:btih:749f3492ae90ee459f03842e32d5aef94c9895af","amp;dn":"Reggae+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"749f3492ae90ee459f03842e32d5aef94c9895af","infoHashBuffer":{"type":"Buffer","data":[116,159,52,146,174,144,238,69,159,3,132,46,50,213,174,249,76,152,149,175]},"announce":[],"urlList":[]}}