{"title":"Folder Lock v6.1.5-Latest {Sanpork}","uid":4736976,"size":6302338,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:750aab2e91219c481ebf5f81a7e90593785c783b&amp;dn=Folder+Lock+v6.1.5-Latest+%7BSanpork%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sanpork","files":1,"time":1235371031,"description":" Folder Lock is fast file-security software that can password-protect, lock, hide, and encrypt any number of files, folders, drives, pictures, and documents in seconds. Locked files are undeletable, unrenamable, unmovable, hidden, and inaccessible. You can lock, scramble, or encrypt depending on speed and security. Folder Lock is fully portable, so you can protect your files on USB flash drives, disks, CD-RWs, notebooks, and hard disks, and it doesn't require installation on another PC. Folder Lock protects files in Windows, DOS, and Safe modes, even when you change your OS or boot from a disk. Folder Lock doesn't let you delete its own program folder, and it can't be uninstalled without the correct password. Additional options include Stealth Mode, Hacker Attempt Monitoring, Shred files, AutoLock, Auto Shutdown PC, Lock your PC, Erase PC tracks, 256-bit Blowfish Encryption and Context Menu in Explorer.\n\nWhat is Folder Lock?\n\nFolder LockÃ‚Â® is a fast data encryption and password protection software for Windows. It can simultaneously encrypt, lock and password protect your files, folders, drives, USB drives and even CD/DVD-RW.\n\nFolder Lock creates encrypted storages called 'Lockers'. You can keep as many of your private files &amp; folders in your Locker and password protect it with a single click. You can transfer, secure and backup these Lockers. Lockers are portable, you can keep them in USB Flash Drives, CD/DVD (R-RW), &amp; notebooks or transfer them via email or upload. Lockers are even undeletable on the computer where Folder Lock is installed.\n\nYou can treat Lockers just as you would treat them in physical world. Each user can have their own Lockers. However, a single user can create multiple Lockers with different passwords as well. With Folder Lock, you can choose either to encrypt using 256-bit AES on-the-fly encryption or lock files, folders and drives anywhere on your computer. Each Locker can contain your encrypted files as well as your personal list of locked items.\n\nFurthermore, Folder Lock's options like hack attempt monitoring, stealth mode, data shredding, history cleaning &amp; auto protection can enhance data security beyond anything ever achieved. In addition, a locker's delete, move and rename are password protected to prevent data loss.\n\nFolder Lock is Windows Vista / 2003 / XP / 2000 compatible and is the most downloaded File Security program in the market today.\n\nChanges in Version 6.1.6 (February 21, 2009):\n- Folder Lock is now 64-bit Windows compatible on all flavors i.e. Windows Vista 64-bit, Windows XP 64-bit, Windows Server 2008 and also Windows 7.0.\n- A new Portability feature is also added in this version, allowing you to protect data on USB drives and External drives without any hassle and without the need to install Folder Lock on the other end. \n\n\nPlease Help Seeding","torrent":{"xt":"urn:btih:750aab2e91219c481ebf5f81a7e90593785c783b","amp;dn":"Folder+Lock+v6.1.5-Latest+%7BSanpork%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"750aab2e91219c481ebf5f81a7e90593785c783b","infoHashBuffer":{"type":"Buffer","data":[117,10,171,46,145,33,156,72,30,191,95,129,167,233,5,147,120,92,120,59]},"announce":[],"urlList":[]}}