{"title":"Mental Case v. 2.0.4 [K]racked","uid":6963155,"size":25138815,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:75e3a7d45eb1db79197ee2b25ab4257f9244727f&amp;dn=Mental+Case+v.+2.0.4+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1326830046,"description":"Official Web Site: &lt;a href=&quot; http://www.mentalcaseapp.com/mac/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.mentalcaseapp.com/mac/&lt;/a&gt;\n\nDescription\nMental Case is The Study App. Combining traditional flashcards with the latest learning techniques, Mental Case can help get stuff into your head. It's the premium study app for your Mac, iPad, or iPhone/iPod touch.\n\nUse it to learn a language, brush up on your human anatomy, or study for the bar exam. Enter your information directly, or import it from web sites like FlashcardExchange.com and Quizlet.com. Mental Case automatically schedules your notes for study, and can sync them to your iPad, iPhone or iPod touch.\n\nFeatures: \n\n* Enter mental notes with images, video, audio, and formatted text.\n\n* Include as many facets ('sides') in your notes as you like.\n\n* Flip through your notes in the unique 3D browser.\n\n* Group notes in stacks, and nest your stacks in cases ('folders') as\n  deeply as you like.\n\n* Create smart stacks based on search rules.\n\n* Flag and tag notes.\n\n* Choose from several automated study schedules tailored to your goals,\n  including long-term learning and cramming options.\n\n* Download notes directly from FlashcardExchange.com and\n  Quizlet.com.\n\n* Import and export your notes in many different formats.\n\n* Sync over Wi-Fi with a Mental Case app on your iPad, iPhone, or iPod\n  touch.\n\n* Use global hot keys to quickly capture any piece of information, from\n  whatever app you are working in.\n\n* Take photos with your FaceTime camera.\n\n* Grab screen shots to use in your notes directly from inside Mental\n  Case.\n\n* Study your mental notes in gorgeous slideshows.\n\n* Study multiple choice quiz slideshows.\n\n* View graphical slideshow statistics, including estimates of memory\n  retention.\n\n* Print your slides in many different layouts.\n\nSyncing with iOS\n\nMental Case 2 can sync in the same way as Mental Case 1.9 over Wi-Fi with Mental Case apps on iOS. The way you begin a sync differs slightly: To sync Mental Case 2, tap 'Start Sync' in the iOS app. Your iOS device should appear in the Mac app in the source list on the left. Select it there, and follow the instructions.\n\nWARNING: At this time, the iOS edition of Mental Case does not support all features of Mental Case for Mac. There is no support for formatted text, no multiple-choice quizzes, and it can only handle a maximum of two facets (sides) per note. An update is planned to address these shortcomings. In the meantime, it may not be suitable for studying all types of notes.\n\nWhat's New:\n\n* Improved import of learning schedule from Mental Case 1.9\n\n* Added more slide timing options\n\n* Improved layout of multiple choice slides with images\n\n* QuickLook now works with multiple choice slides\n\n* All Notes now shows all stacks, not just top-level stacks\n\n* Small improvements in the Export panel\n\n* Order of stacks in sync panel is now correct\n\n* Fixed a crashing bug when dragging notes in a filtered list\n\nSystem Requirements:\n\nIntel Mac, OS X.7 or greater\n\n--- PLEASE SEED ---\n\n","torrent":{"xt":"urn:btih:75e3a7d45eb1db79197ee2b25ab4257f9244727f","amp;dn":"Mental+Case+v.+2.0.4+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e3a7d45eb1db79197ee2b25ab4257f9244727f","infoHashBuffer":{"type":"Buffer","data":[117,227,167,212,94,177,219,121,25,126,226,178,90,180,37,127,146,68,114,127]},"announce":[],"urlList":[]}}