{"title":"Eric Clapton 24 Bit Vinyl Pack","uid":8473290,"size":18525982665,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:770ff0c535ac59dfcf9fdf461b1dd81bbe62da9b&amp;dn=Eric+Clapton+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1368544453,"description":"\n  Eric Clapton 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock, Blues\n  Styles: Album Rock, Blues-Rock, British Blues, Hard Rock\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Eric Clapton\n  Money and Cigarettes\n  From the Cradle\n  Journeyman\n  Rush\n  Live from Madison Square Garden with Steve Winwood\n  461 Ocean Boulevard\n  Complete Clapton (1966-1981 and 1982-2006)\n  EC Was Here\n  No Reason to Cry\n  Slowhand (Japan)\n  Unplugged\n  Blues Breakers with John Mayall\n  Just One Night  \n\n  By the time Eric Clapton launched his solo career with the release of his self-titled debut album in mid-1970, he was long established as one of the world's major rock stars due to his group affiliations -- the Yardbirds, John Mayall's Bluesbreakers, Cream, and Blind Faith -- which had demonstrated his claim to being the best rock guitarist of his generation. That it took Clapton so long to go out on his own, however, was evidence of a degree of reticence unusual for one of his stature. And his debut album, though it spawned the Top 40 hit &quot;After Midnight,&quot; was typical of his self-effacing approach: it was, in effect, an album by the group he had lately been featured in, Delaney &amp; Bonnie &amp; Friends.\n\n  Not surprisingly, before his solo debut had even been released, Clapton had retreated from his solo stance, assembling from the D&amp;B&amp;F ranks the personnel for a group, Derek &amp; the Dominos, with whom he played for most of 1970 and recorded the landmark album Layla and Other Assorted Love Songs. Clapton was largely inactive in 1971 and 1972, due to heroin addiction, but he performed a comeback concert at the Rainbow Theatre in London on January 13, 1973, resulting in the album Eric Clapton's Rainbow Concert (September 1973). But Clapton did not launch a sustained solo career until July 1974, when he released 461 Ocean Boulevard, which topped the charts and spawned the number one single &quot;I Shot the Sheriff.&quot;\n\n  The persona Clapton established over the next decade was less that of guitar hero than arena rock star with a weakness for ballads. The follow-ups to 461 Ocean Boulevard, There's One in Every Crowd (March 1975), the live E.C. Was Here (August 1975), and No Reason to Cry (August 1976), were less successful. But Slowhand (November 1977), which featured both the powerful &quot;Cocaine&quot; (written by J.J. Cale, who had also written &quot;After Midnight&quot;) and the hit singles &quot;Lay Down Sally&quot; and &quot;Wonderful Tonight,&quot; was a million-seller. Its follow-ups, Backless (November 1978), featuring the Top Ten hit &quot;Promises,&quot; the live Just One Night (April 1980), and Another Ticket (February 1981), featuring the Top Ten hit &quot;I Can't Stand It,&quot; were all big sellers.\n\n  Clapton's popularity waned somewhat in the first half of the '80s, as the albums Money and Cigarettes (February 1983), Behind the Sun (March 1985), and August (November 1986) indicated a certain career stasis. But he was buoyed up by the release of the box set retrospective Crossroads (April 1988), which seemed to remind his fans of how great he was. Journeyman (November 1989) was a return to form. It would be his last new studio album for nearly five years, though in the interim he would suffer greatly and enjoy surprising triumph. On March 20, 1991, Clapton's four-year-old son was killed in a fall. While he mourned, he released a live album, 24 Nights (October 1991), culled from his annual concert series at Royal Albert Hall in London, and prepared a movie soundtrack, Rush (January 1992). The soundtrack featured a song written for his son, &quot;Tears in Heaven,&quot; that became a massive hit single.","torrent":{"xt":"urn:btih:770ff0c535ac59dfcf9fdf461b1dd81bbe62da9b","amp;dn":"Eric+Clapton+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"770ff0c535ac59dfcf9fdf461b1dd81bbe62da9b","infoHashBuffer":{"type":"Buffer","data":[119,15,240,197,53,172,89,223,207,159,223,70,27,29,216,27,190,98,218,155]},"announce":[],"urlList":[]}}