{"title":"Santa's Empire - Europa Universalis IV mod","uid":11029705,"size":28438300,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7731e6524392b1a8acc8defcb9dcdd605b230533&amp;dn=Santa%27s+Empire+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1410707217,"description":"Santa's Empire - Europa Universalis IV mod\n\nExtract 7zip to your C:Users[user]Documents Paradox Interactive Europa Universalis IV mod folder\n\n\nHo ho ho! Merry Christmas! \n\nYou are Santa Claus, one of the most loved characters on the planet. Every year you reward good children with presents and punish the bad ones. You inspire people with your good-will and your morals. All is well for Santa! Ho ho ho! \n\nHowever, things will change soon. The world has changed a lot since you were a tad wee lad in the 11th century. Nowadays large nations fight each other over supremacy on the world stage. New entities rise up to challenge old ones. New gunpowder technology wreak havoc across the vast battlefields. Plagues and diseases devastate the people of Europe. Soon the only force that keeps the world in relative balance, catholicism, will face it's own hardships as new religious movements rise up and gain power across Europe. \n\nSanta Claus, you're the only one who can save this world from destroying itself - and in turn, destroying Christmas. Spread Christmas to everyone - everyone must join together, help each other, be nice to each other and forget about the power struggles that plague the world. Get everyone to be joyful, to share and give, to love. \n\nAnd if anyone opposses you - kill them. \n\nWhat this mod offers: \n- Play as Santa and with his mighty empire that encompasses Finland, Iceland, Greenland and Canada. \n- Unique overpowered Santa ideas with Christmas theme. \n- Nice and smooth Christmas music to guide you on your way to Christmas-y dominance!","torrent":{"xt":"urn:btih:7731e6524392b1a8acc8defcb9dcdd605b230533","amp;dn":"Santa%27s+Empire+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7731e6524392b1a8acc8defcb9dcdd605b230533","infoHashBuffer":{"type":"Buffer","data":[119,49,230,82,67,146,177,168,172,200,222,252,185,220,221,96,91,35,5,51]},"announce":[],"urlList":[]}}