{"title":"Harry Potter y la Piedra Filosofal","uid":4911568,"size":1469917231,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:786cc282c6bdfc6f7755e2d76a4c4b0ad3f26977&amp;dn=Harry+Potter+y+la+Piedra+Filosofal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annia","files":2,"time":1243190829,"description":"El 2 de noviembre de 1981, tres personas de misterioso aspecto se reÃƒÂºnen afuera de una casa en Little Whinging. Los tres individuos (Albus Dumbledore, Minerva McGonagall y Rubeus Hagrid) son magos pertenecientes a una comunidad de hechiceros que existe en paralelo al mundo de los muggles (o humanos no-magos) y depositan a un bebÃƒÂ© en la entrada del NÃƒÂºmero 4 de Privet Drive. \nEl bebÃƒÂ© crece bajo el nombre de Harry Potter siendo poco mÃƒÂ¡s que un marginado en la casa de sus tÃƒÂ­os los Dursley, hasta que al cumplir los 11 aÃƒÂ±os unas cartas de remitente desconocido llegan a la casa suburbana. Las cartas traen la noticia de que el niÃƒÂ±o ha sido admitido en el Colegio Hogwarts de Magia y HechicerÃƒÂ­a ya que, al igual que sus padres, ÃƒÂ©l tiene sangre mÃƒÂ¡gica. Se descubre entonces que los Potter no murieron en un accidente de autos como se le dijo a Harry sino que fueron asesinados en la noche de Halloween por un hechicero tenebroso conocido como lord Voldemort, que aterrorizÃƒÂ³ a los magos aÃƒÂ±os atrÃƒÂ¡s. Pero algo ocurriÃƒÂ³ esa noche, algo que le impidiÃƒÂ³ asesinar a Harry siendo un bebÃƒÂ© y que lo hizo desaparecer. \nEn el colegio, Harry conocerÃƒÂ¡ a Ronald Weasley, un chico pelirrojo que vive a la sombra de sus muchos hermanos y a Hermione Granger, una jovencita con altas aspiraciones acadÃƒÂ©micas. Los tres se volverÃƒÂ¡n grandes amigos y se verÃƒÂ¡n envueltos en una trama de secretos y mentiras en torno a un antiguo objeto legendario escondido en la escuela el cual desea robar una fuerza maligna. ","torrent":{"xt":"urn:btih:786cc282c6bdfc6f7755e2d76a4c4b0ad3f26977","amp;dn":"Harry+Potter+y+la+Piedra+Filosofal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"786cc282c6bdfc6f7755e2d76a4c4b0ad3f26977","infoHashBuffer":{"type":"Buffer","data":[120,108,194,130,198,189,252,111,119,85,226,215,106,76,75,10,211,242,105,119]},"announce":[],"urlList":[]}}