{"title":"100 Years Of Wildlife Films-(WTC-SWE)","uid":4590540,"size":1153429943,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78bcfe96d38a56a34c0a6bb560824db7f4ffc0ec&amp;dn=100+Years+Of+Wildlife+Films-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1229807909,"description":"BBC:\n----\n\n\n                        100 YEARS OF WILDLIFE FILMS\n                       -----------------------------\n\n\nBill Oddie highlights the passionate, eccentric and pioneering individuals who have often risked life and limb to break new boundaries in wildlife films. He charts the extraordinary changes in technology that have driven the industry forward, and reveals how the last hundred years of wildlife films has as much to do with our social attitudes as it has to do with the animals themselves.\n\nWith stunning, exciting and sometimes shocking footage, the documentary explores the changing trends throughout the last century, from shooting animals for fun in the 1930s to campaigning to save them from extinction today. As Oddie says: &quot;To me the ultimate aim, the hope, the prayer behind every wildlife film... it's to make us care about the natural world and say 'here's something we love - we don't want to lose it'.&quot;\n\nPlus, film-makers explain the challenges that filming animals can pose, we find out more about the pioneers, discover who was first to film underwater - and who narrowly escaped death to get the shots they wanted\n\n\nEver since 1907, when a flickering film about birds enthralled a cinema audience, we've been fascinated by watching the natural world on film. For 100 years wildlife films have taken us to places and shown us things we would never be able to see - the excitement, the strangeness, the danger of the wild. Today, our interest in the wonders of the natural world is stronger than ever.\n\n Accompanying the lavish BBC two-hour special, &quot;Top 100 Wildlife Moments&quot; dives into the archives to find the 100 wildlife moments that best celebrate the glories and the eccentricities of this astonishingly popular and enduring culture. You can discover the history of the wildlife moving image: the first heady days when an ant juggling a matchbox was big box office; the charismatic and sometimes controversial celebrity presenters; the astonishing behaviour of animals and plants; the boggling oddities of nature; the animals now extinct that poignantly only exist on film.\n\n You can explore 100 years of revelation - from the black-and-white silent footage that started it all to the almost magical photography techniques seen today in programmes like &quot;Planet Earth&quot;. From famous faces of wildlife TV to extraordinary animal (and plant) behaviour, natural history filming has changed the way we look at and think about our world. It's all here - so weird, you couldn't make it up; so wonderful, you wouldn't want to miss it.\n\n\n\nPRESENTED BY: Bill Oddie\n-------------------------\n\n\n\nTitle: 100 Years Of Wildlife Films\nYear:  2007\nFile Size: 1,07 GB  \nFormat:AVI\nVideo Length: 01:58:50\nVideo Codec: XviD\nVideo Resolution: 688x400\nVIdeo Bitrate: 1263 kbit/s\nFPS:  25.000000\nAudio Bitrate: 127 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2\nSubtitles:(N/A)\n  \n \n \n\n\nENJOY:\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\n\n*** HIGHLY RECOMMENDED DOWNLOAD***","torrent":{"xt":"urn:btih:78bcfe96d38a56a34c0a6bb560824db7f4ffc0ec","amp;dn":"100+Years+Of+Wildlife+Films-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78bcfe96d38a56a34c0a6bb560824db7f4ffc0ec","infoHashBuffer":{"type":"Buffer","data":[120,188,254,150,211,138,86,163,76,10,107,181,96,130,77,183,244,255,192,236]},"announce":[],"urlList":[]}}