{"title":"Advanced Fibrous Composite Materials for Ballistic Protection","uid":15365579,"size":22734641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a30cde1a8f00bfbdb960410cafacfc3db8d5352&amp;dn=Advanced+Fibrous+Composite+Materials+for+Ballistic+Protection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469071275,"description":"Advanced Fibrous Composite Materials for Ballistic Protection - X. Chen (WP, 2016).pdf\r\n\r\nAdvanced Fibrous Composite Materials for Ballistic Protection provides the latest information on ballistic protection, a topic that remains an important issue in modern times due to ever increasing threats coming from regional conflicts, terrorism, and anti-social behavior.\r\n\r\nThe basic requirements for ballistic protection equipment are first and foremost, the prevention of a projectile from perforating, the reduction of blunt trauma to the human body caused by ballistic impact, the necessity that they are thermal and provide moisture comfort, and that they are lightweight and flexible to guarantee wearer’s mobility.\r\n\r\nThe main aim of this book is to present some of the most recent developments in the design and engineering of woven fabrics and their use as layering materials to form composite structures for ballistic personal protection. Chapter topics include High Performance Ballistic Fibres, Ultra-High Molecular Weight Polyethylene (UHMWPE), Ballistic Damage of Hybrid Composite Materials, Analysis of Ballistic Fabrics and Layered Composite Materials, and Multi-Scale Modeling of Polymeric Composite Materials for Ballistic Protection.\r\n\r\n\r\n\r\nContributions from leading experts in the field\r\nCutting edge developments on the engineering of ballistic materials\r\nComprehensive analysis of the development and uses of advanced fibrous composite materials","torrent":{"xt":"urn:btih:7a30cde1a8f00bfbdb960410cafacfc3db8d5352","amp;dn":"Advanced+Fibrous+Composite+Materials+for+Ballistic+Protection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a30cde1a8f00bfbdb960410cafacfc3db8d5352","infoHashBuffer":{"type":"Buffer","data":[122,48,205,225,168,240,11,251,219,150,4,16,202,250,207,195,219,141,83,82]},"announce":[],"urlList":[]}}