{"title":"Pelt - Pearls From The River","uid":6401744,"size":62319696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7ad40b6454bd9412223d81bc7e2498d6705903b9&amp;dn=Pelt+-+Pearls+From+The+River&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RioPental","files":3,"time":1305694005,"description":"Mp3 vbr\n\n\nIn the two years between Ayahuasca and Pearls from the River, the members of Pelt collaborated with some of the luminaries of the psychedelic folk underground, including members of Charalambides, Rake, Dredd Foole, and Cul de Sac guitarist Glenn Jones. With this in mind, one might expect Pearls From the River to be a wildly experimental and exploratory release. But on the contrary, Pearls is almost straightforward traditional Indian modal music. Three lengthy acoustic &quot;ragas&quot; make up the album, and despite the presence of the banjo (which is the lead instrument on the opener, &quot;Up the North Fork&quot;) and guitar (both six- and 12-string) it's hard to imagine a Western group incorporating any more Eastern influence into its sound without losing itself and becoming a pure pretender. Pelt is right on the line with this one, but it's a very fine line. Any further and you might be forced to ask yourself, &quot;why not just listen to the real deal?&quot; and go seek out some Nikhil Banerjee records instead. Still, if you're looking for something less rhythmically intense than you're average Jackie-O Motherfucker or Sunburned Hand of the Man album, something more about the drone than the beat, you can't go wrong with this dark, intoxicating set. Great music for staring into the void.\n\n","torrent":{"xt":"urn:btih:7ad40b6454bd9412223d81bc7e2498d6705903b9","amp;dn":"Pelt+-+Pearls+From+The+River","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ad40b6454bd9412223d81bc7e2498d6705903b9","infoHashBuffer":{"type":"Buffer","data":[122,212,11,100,84,189,148,18,34,61,129,188,126,36,152,214,112,89,3,185]},"announce":[],"urlList":[]}}