{"title":"8MM (remastered soundtrack).mp4","uid":11702988,"size":4135773871,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7cc11cde2171fa16557c342fd09714f3bc5565fe&amp;dn=8MM+%28remastered+soundtrack%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MoofieMan","files":1,"time":1423995721,"description":"Private investigator Tom Welles is hired by the recently widowed Mrs. Christian who has found a startling pornographic film in her late husband's possessions. In the film a teenage girl is apparently killed and Welles is pretty sure it's a genuine snuff film. He takes the case, first going through records of runaways finally identifying the girl and learning that she may have run off to California. There he enters the seedy underworld of pornography with the help of Max California, a porn store clerk. His principal clue is the masked man who killed the girl as he has a unique tattoo on his hand. He soon finds the culprits but there is little satisfaction in resolving the mystery. (written by garykmcd on IMDB)\n\nStars Nicholas Cage, Jaoquim Phoenix, James Gandolfini and Catherine Keener.\n\nWhilst I'm not a big Nicholas Cage fan, this is an excellent film where he's not too overpowering and the support acting is great, so it comes off pretty well. It's one of those movies I can watch over and over again and not get bored with it. The vision is clear as a bell and the soundtrack has been remastered to my usual standards, i.e. all dialogue is very audible, while not detracting from the music and sound effects.\n\nVideo: BDrip x264 1280x540 @ 4020kbps\nAudio: AC3 Stereo 2.0 Remastered (vocal compression, levelling, amplification to -1dB) @ 448kbps\nContainer: MP4\n\nThanks to all who seed! You are the lifeblood of the system","torrent":{"xt":"urn:btih:7cc11cde2171fa16557c342fd09714f3bc5565fe","amp;dn":"8MM+%28remastered+soundtrack%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cc11cde2171fa16557c342fd09714f3bc5565fe","infoHashBuffer":{"type":"Buffer","data":[124,193,28,222,33,113,250,22,85,124,52,47,208,151,20,243,188,85,101,254]},"announce":[],"urlList":[]}}