{"title":"Scott McKenzie-San Francisco(Be Sure To Wear Flowers In Your Ha","uid":5632977,"size":98537476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7e0203a3a5ee07f5be20f2b374b4b738ed589bd0&amp;dn=Scott+McKenzie-San+Francisco%28Be+Sure+To+Wear+Flowers+In+Your+Ha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1276763532,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nScott McKenzie - San Francisco (Be Sure To Wear Flowers In Your Hair) (2nafish)\n\n\n\n&quot;San Francisco (Be Sure to Wear Flowers in Your Hair)&quot; is a song, written by John Phillips of The Mamas &amp; the Papas, and sung by Scott McKenzie. It was written and released in 1967  to promote the Monterey Pop Festival.\n\nMcKenzie's song became an instant hit. The lyrics tell the listeners, &quot;If you're going to San Francisco, be sure to wear some flowers in your hair&quot;. Due to the difference between the lyrics and the actual title, the title is often quoted as &quot;San Francisco (Be Sure to Wear Some Flowers in Your Hair)&quot;. &quot;San Francisco,&quot; released on 13 May 1967, was an instant hit. By June 1967, it commanded the number four spot on the Billboard Hot 100 in the United States. Meanwhile, the song rose to number one in the United Kingdom and most of Europe. The single is purported to have sold over 7 million copies worldwide. The song is credited with bringing thousands of young people to San Francisco, California during the late 1960s.\n\nIn Central Europe, young people adopted &quot;San Francisco&quot; as an anthem for freedom, and it was widely played during Czechoslovakia's 1968 Prague Spring uprising against Soviet rule.\n\nThe song has been featured in several films, including Frantic, The Rock and Forrest Gump.\n\nScott McKenzie (born Philip Blondheim, January 10, 1939, Jacksonville, Florida) is an American singer, best known for his 1967 hit single and generational anthem, &quot;San Francisco (Be Sure to Wear Flowers in Your Hair)&quot;.\n\nPhillips wrote and produced &quot;San Francisco (Be Sure To Wear Flowers In Your Hair)&quot;, which was released in 1967, for McKenzie. John Phillips played guitar on the recording and Michelle Phillips played bells. The bass line of the song was supplied by session musician Joe Osborn. It became a Top 10 hit in the United States and a number one in the UK and several other countries. It sold over seven million copies globally, and was awarded a gold disc.\n\nMcKenzie followed the song with &quot;Like An Old Time Movie&quot;, also written and produced by Phillips, which was a minor hit. His first album, The Voice of Scott McKenzie was followed with an album called Stained Glass Morning. He stopped recording in the early 1970s and lived in Joshua Tree, California and Virginia Beach.\n\nIn 1986, he started singing with a new version of The Mamas and the Papas. With Terry Melcher, Mike Love and John Phillips, he co-wrote the number 1 single for the Beach Boys, &quot;Kokomo&quot; (1988).\n\nBy 1998, he had retired from the road version of The Mamas and Papas, and currently resides in Los Angeles, California. He appeared at the Los Angeles tribute concert for John Phillips in 2001, amongst other 1960s contemporary acts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7e0203a3a5ee07f5be20f2b374b4b738ed589bd0","amp;dn":"Scott+McKenzie-San+Francisco%28Be+Sure+To+Wear+Flowers+In+Your+Ha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0203a3a5ee07f5be20f2b374b4b738ed589bd0","infoHashBuffer":{"type":"Buffer","data":[126,2,3,163,165,238,7,245,190,32,242,179,116,180,183,56,237,88,155,208]},"announce":[],"urlList":[]}}