{"title":"Holocaust? What They Hide From You","uid":11775184,"size":5110612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f33309c8e599e698be22ee60464d0b3ed7ab989&amp;dn=Holocaust%3F+What+They+Hide+From+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427254170,"description":"This booklet cost its author nine months in prison and many thousands of euros in fines. Monsieur Reynouard was born in France in 1969, is a qualified chemical engineer and graduate of the ISMRA (Institute of Sciences of Atomic Matter and Radiation&quot;) in Caen. This booklet was written in 2005 in French and then distributed to a number of public offices and officials in France. Its 16 pages contain (as the reader will see) dramatic and easy-to-read explanations of a number of core revisionist arguments, all of which knock holes in the stories built up around World War II's concentration camps. This power of this booklet alarmed the French democratic Gestapo, and M. Reynouard was promptly charged under the infamous &quot;Gayssot Act,&quot; which makes it a criminal offence in France to &quot;contest&quot; or dispute certain &quot;crimes against humanity,&quot; as defined by the Charter of the Nuremberg Tribunal (IMT) of 1945-46. When his case finally came to court in 2007, M. Reynouard was sentenced to one year's imprisonment, a fine of 10,000 euros and ordered to pay &quot;damages&quot; of 3,000 euros to Jewish associations, posing as &quot;anti-racists&quot; called LICRA [International League against racism and antisemitism]. M Reynouard appealed, but in June 2008, a senior court in Colmar upheld the original sentence and ordered him to pay a total of 60,000 euros. This latter figure was made up of a doubling of the original fine (20,000 euros), assorted damages, the cost of a mandatory publication of the court ruling and assorted &quot;fees.&quot; The punishment was unprecedented in French legal history. Even now, M Reynouard remains under strict controls. He has been charged again in a new matter lined to revisionism by the French &quot;justice&quot; system and is not allowed to leave France, not even to visit his wife and eight children who live in Belgium. He also has to report every week to his local police station. His crime, you might ask? Book publishing","torrent":{"xt":"urn:btih:7f33309c8e599e698be22ee60464d0b3ed7ab989","amp;dn":"Holocaust%3F+What+They+Hide+From+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f33309c8e599e698be22ee60464d0b3ed7ab989","infoHashBuffer":{"type":"Buffer","data":[127,51,48,156,142,89,158,105,139,226,46,230,4,100,208,179,237,122,185,137]},"announce":[],"urlList":[]}}