{"title":"Sun Dial - Other Way Out [1990] [FLAC]","uid":8100560,"size":316598584,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:803080e20d7723cbc6750d34561d929044c1f804&amp;dn=Sun+Dial+-+Other+Way+Out+%5B1990%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":10,"time":1359959426,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Sun Dial\nRelease: Other Way Out\nDiscogs: 756811\nReleased: 1990\nLabel: UFO Records\nCatalog#: UFO 1 CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Psychedelic Rock\n\nTracklisting:\n\n01. Plains Of Nazca (7:21)\n02. Exploding In Your Mind (5:15)\n03. Magic Flight (6:26)\n04. World Without Time (9:04)\n05. She's Looking All Around (7:20)\n06. Visitation (2:43)\n07. Other Side (3:38)\n08. Lorne Blues (4:01)\n\nSun Dial's first album came out in 1990, but it was as determinedly retro an effort as anything released that year; Gary Ramon and his bandmates clearly worshiped at the altar of all that was psychedelic, and there wasn't the smallest bit of irony in their approach on Other Way Out. Many latter-day psych bands sound as if they're trying as hard as they can to capture the lysergic sound of the late '60s, but Sun Dial never betray any such effort: they simply seem to have dropped through a wormhole in time from the UFO Club into Balham Market, and their natural and unaffected embrace of drifting melodic structures, guitars floating on clouds of fuzz, phase shift and wah-wah, splashy drumming that colors the music as much as keeping time and firm, thick basslines that anchored the music in some sort of reality are genuine enough to convince most folks who haven't looked at the liner notes that this was put to tape in 1969, not 1989. Sun Dial's commitment to the sound of vintage psych, space rock, and early prog rock means that plenty of the tunes meander quite a bit (the shortest tune is four minutes long, and &quot;She's Looking All Around&quot; ambles along for more than ten), which means Other Way Out is about sound and feel more than songs, and if you're not deep into British psychedelia in the classic style, this album will probably test your patience. But if you're a true believer, Sun Dial's journey through the center of their own consciousness by way of the electric guitar is a trip you'll enjoy, and on Other Way Out, the group sound as accomplished and assured on their debut as other bands do after decades of hard work. [In 2010, Sun Dial's Shrunken Head Records gave Other Way Out a deluxe reissue in honor of the album's 20th birthday; the album was fully remastered and expanded from a six-song LP into a two-CD set featuring a whopping 29 tracks and two-hours-and-twenty-four minutes of music. Along with the original album, this set includes the Exploding in Your Mind EP, some non-LP singles, studio outtakes, remixes, and unreleased tracks, including a few stylistic detours, such as the garage rocker &quot;Carousel&quot; and the acoustic-styled &quot;Fountain.&quot; Given the sheer scope of this edition, those with a casual interest in Sun Dial will probably find this more than they can swallow, but for obsessive fans of these U.K. psych revivalists, this is a true feast and the definitive look at their formative year.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:803080e20d7723cbc6750d34561d929044c1f804","amp;dn":"Sun+Dial+-+Other+Way+Out+%5B1990%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803080e20d7723cbc6750d34561d929044c1f804","infoHashBuffer":{"type":"Buffer","data":[128,48,128,226,13,119,35,203,198,117,13,52,86,29,146,144,68,193,248,4]},"announce":[],"urlList":[]}}