{"title":"For the Love of Money (2012) RET Menu DVDR DD 5.1 Eng NL Subs","uid":8333257,"size":4299937840,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8059802175a18d8f73d627dc619228b4a3c593a8&amp;dn=For+the+Love+of+Money+%282012%29+RET+Menu+DVDR+DD+5.1+Eng+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marjanb","files":-1,"time":1364924069,"description":"For the Love of Money (2012) RET Menu DVDR DD 5.1 Eng NL Subs\n\nFor the Love of Money (2012) \n\nVerenigde Staten\nMisdaad / Drama\n93 minuten\n\ngeregisseerd door Ellie Kanner\nmet James Caan, Edward Furlong en Jeffrey Tambor\n\nTel Aviv, 1973. De jonge Izek groeit op in een louche casino vol met gangsters dat zich achter de bar van de familie bevindt. Wanneer het geweld en de misdaad meer en meer een probleem gaan vormen voor hem en zijn familie verhuist Izek met zijn familie naar Los Angeles. In de hoop een nieuw leven te kunnen beginnen vervolgt hij zijn ambitie om ondernemer te worden door kleine bedrijfjes op te zetten, onroerend goed aan te kopen en een garagebedrijf te runnen. Het succes lijkt hem in de schoot geworpen te worden en na verliefd te zijn geworden op de knappe Aline lijkt het geluk ook aan zijn zijde te staan. Echter duurt het niet lang voordat de misdaad hem weer gevonden heeft. Hij wordt bedreigd door een gevaarlijke gangster, zijn criminele neef en zelfs een Colombiaanse drugsbaron. Als diegenen dicht bij hem de verleiding van het grote geld niet kunnen weerstaan, wordt hij omringd door geweld en heeft hij geen andere keus dan de confrontatie aan te gaan.\n\nStoryline\n\nSpanning over two decades, &quot;For the Love of Money&quot; follows the true account of an Israeli immigrant who searches for his piece of the American dream. The story begins in Tel Aviv in 1973, where a young Izek is raised in a seedy, gangster filled illegal casino that operates behind his family's bar. The casino is a haven for unsavory characters who seek to corrupt him to their way of life. When the violence and crime finds its way to him and his family, Izek (Yuda Levi) and his family relocate to Los Angeles. Hoping to start anew, he pursues his ambitions to become a young entrepreneur by developing small businesses, purchasing real estate, and running an auto repair shop. Success seems to find him at every turn and after falling in love with the beautiful Aline (Delphine Chaneac), luck seems to be on his side. However, it isn't long before the world of crime that Izek tried to escape so long ago continues to doggedly follow him every step of the way. Threatened by a dangerously ...\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1730294/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1730294/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/73044&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/73044&lt;/a&gt;\n\nMovie..............: For the Love of Money (2012)\nGenre..............: Misdaad / Drama\nSource.............: For the Love of Money 2012 COMPLETE R1 NTSC DVDR-CME\nFormat.............: DVDR\nRuntime............: 110 minuten.\nMenu...............: Yes edited\nBreedte ...........: 720 pixels\nHoogte..............: 480 pixels\nBeeldverhouding...: 4:3\nFramerate .........: 29,970 fps\nStandaard.........: NTSC\nVideo..............: DVD SOURCE Video Max. Bitrate ... n/a\nAudio..............: English DD 5.1\nSubtitles.NL.......: Vertaald door: Granny, Os2Lover, Romarijn en Depositair, Heel goed Team Klasse job\nControle...........: Granny\n\nEnjoy the Movie\n\nDon`t quit after you finished the download, but keep seeding.  \n.","torrent":{"xt":"urn:btih:8059802175a18d8f73d627dc619228b4a3c593a8","amp;dn":"For+the+Love+of+Money+%282012%29+RET+Menu+DVDR+DD+5.1+Eng+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8059802175a18d8f73d627dc619228b4a3c593a8","infoHashBuffer":{"type":"Buffer","data":[128,89,128,33,117,161,141,143,115,214,39,220,97,146,40,180,163,197,147,168]},"announce":[],"urlList":[]}}