{"title":"Sonny and Cher - I Got You Babe (Beat Club)(2nafish)","uid":5846994,"size":101709828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:80b74f2309b99a1b24513c72762195a23ff5e7c5&amp;dn=Sonny+and+Cher+-+I+Got+You+Babe+%28Beat+Club%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1285229747,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Got You Babe&quot; is a 1965 number-one hit single by American pop music duo Sonny &amp; Cher.\n\nSonny Bono, a songwriter and record producer for Phil Spector, wrote the song for himself and his wife, Cher, late at night in their basement. Noted session drummer Hal Blaine  performed the drums for the song. Bono was inspired to write the song to capitalize on the popularity of the term &quot;babe,&quot; as heard in Bob Dylan's &quot;It Ain't Me Babe&quot; which was a hit for The Turtles.\n\nUpon recording and releasing the song, &quot;I Got You Babe&quot; became the duo's biggest single, their signature song, and a defining recording of the early hippie countercultural movement. In August 1965, the single spent three weeks at the number-one spot on the Billboard Hot 100 and number nineteen on the R&amp;B charts in the United States. The duo's single also hit number one in the United Kingdom.\n\nThe song has been frequently covered and featured in film and television, including Sonny and Cher's own The Sonny and Cher Comedy Hour. &quot;I Got You Babe&quot; made a bit of a comeback when it was heavily featured as Phil Connor's alarm clock wake up music in the 1993 movie Groundhog Day. Upon re-release, the single re-charted in the UK, reaching #66.\n\nThe song was later covered by Cher in a music video that featured Beavis and Butthead as a rapt audience to Cher's performance. In the video, the idiot pair refer to her former husband Bono as a dork and a wuss, to which Cher agrees.\n\nSonny and Cher last performed the song together during an impromptu reunion on NBC's Late Night with David Letterman on Nov. 13, 1987. The song placed at #444 on Rolling Stone's list of the 500 Greatest Songs of all time.\n\nCher performed the song with R.E.M. on February 14, 2002, at the Kodak Theatre in Los Angeles. It was her first performance of the song without Sonny.\n\nSonny &amp; Cher were an American pop music duo, actors, singers and entertainers made up of husband-and-wife team Sonny and Cher Bono in the 1960s and 1970s. The couple started their career in the mid-1960s as R&amp;B backing singers for record producer Phil Spector.\n\nThe pair first achieved fame with two hit songs in 1965, &quot;Baby Don't Go&quot; and &quot;I Got You Babe&quot;. Signing with Atco/Atlantic Records, they released three studio albums in the late 1960s, as well as the soundtrack recording for an unsuccessful movie, Good Times. In 1972, after four years of silence, the couple returned to the studio and released two other albums under the MCA/Kapp Records label.\n\nIn the 1970s, they also positioned themselves as media personalities with two top ten TV shows in the US, The Sonny &amp; Cher Comedy Hour and The Sonny &amp; Cher Show. The couple's career as a duo ended in 1975 following their divorce. In the decade they spent together, Sonny and Cher sold 80 million records worldwide.\n\nPerforming under her first name, Cher went on to a highly successful career as a solo singer and actress, while Sonny Bono was eventually elected to Congress as a U.S. Representative from California. The duo were inducted to the Hollywood Walk of Fame in 1998, right after Sonny's death.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:80b74f2309b99a1b24513c72762195a23ff5e7c5","amp;dn":"Sonny+and+Cher+-+I+Got+You+Babe+%28Beat+Club%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b74f2309b99a1b24513c72762195a23ff5e7c5","infoHashBuffer":{"type":"Buffer","data":[128,183,79,35,9,185,154,27,36,81,60,114,118,33,149,162,63,245,231,197]},"announce":[],"urlList":[]}}