{"title":"Selling Sickness 2007 (Link-TV) MPEG-4","uid":4295371,"size":230823713,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:829ccea3c0cd82975cb6d14b62efd148fbda2564&amp;dn=Selling+Sickness+2007+%28Link-TV%29+MPEG-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":2,"time":1216059355,"description":"Selling Sickness 2007 (Link-TV) MPEG-4\n~An Ill For Every Pill~\n\nIcarus Productions 2005\n\n70 mins\n220 mgs\n\nSELLING SICKNESS exposes the unhealthy relationship between society, medical science and the pharmaceutical industry.\n\nDrug manufacturers today fund aggressive marketing campaigns designed to create public awareness of previously unknown diseases, or known by less dramatic names. Shyness thus becomes branded as &amp;#039;Social Anxiety Disorder,&amp;#039; constant worry becomes &amp;#039;Generalized Anxiety Disorder,&amp;#039; and premenstrual tension is now &amp;#039;Premenstrual Dysphoric Disorder.&amp;#039; The sale of SSRI anti-depressant medications used to treat these and other diseases, such as Paxil, Zoloft and Prozac, has become an annual $20 billion market.\n\nThe film features commentary from paid medical consultants to the drug companies, patients, researchers, patient advocates, advertisers, attorneys, and psychiatrist Dr. David Healy, a critic of the pharmaceutical industry. SELLING SICKNESS also visits trade shows and professional conferences to show how the pharmaceutical industry promotes the use of its drugs within the medical community.\n\nCo-written by Ray Moynihan (author of the book Selling Sickness, 2005), an internationally respected health journalist and current guest editor at The British Medical Journal, the documentary reveals aspects of the drug trade not mentioned in commercials or magazines, including the deceptive use of clinical trials sponsored by the pharmaceutical companies, the highly addictive nature and many adverse side effects (like suicidal impulses among adolescent patients) of popular SSRI anti-depressants. At an FDA hearing in Washington, D.C., the testimony of parents who have lost their children to suicide starkly emphasizes the need for greater regulation of these heavily promoted and prescribed anti-depressants.\n\nIn a society where the techniques for selling diseases has become even more sophisticated than the medical science which develops cures for them, where everyday emotional problems are touted as epidemic diseases, SELLING SICKNESS sounds a vitally important cautionary note.\n\nSee also:Big Bucks, Big Pharma Discovery 2007 (Discovery Channel) MPEG-4, 168 mgs\nat: http://www.sonofshun.com/forums/viewtopic.php?t=8421 or","torrent":{"xt":"urn:btih:829ccea3c0cd82975cb6d14b62efd148fbda2564","amp;dn":"Selling+Sickness+2007+%28Link-TV%29+MPEG-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"829ccea3c0cd82975cb6d14b62efd148fbda2564","infoHashBuffer":{"type":"Buffer","data":[130,156,206,163,192,205,130,151,92,182,209,75,98,239,209,72,251,218,37,100]},"announce":[],"urlList":[]}}