{"title":"Ferlin Husky - Country Music Is  Stay","uid":6875345,"size":275232450,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:82a679599936447c99535cd3c4e4ed8a9fb3696a&amp;dn=Ferlin+Husky+-+Country+Music+Is++Stay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":34,"time":1323396082,"description":"Ferlin Husky - Country Music Is Here To Stay -\nThe Complete Simon Crum aka Ferlin Husky On Capitol\nEMI Music Special Markets/Collector's Choice Music\n72435-40232-2-4/CCM-295-2\n2002\n\nTracklist :\n\n    Don't Be Mad\n    Country Music Is Here To Stay\n    Cuzz Yore So Sweet\n    Ooh, I Want You\n    Stand Up, Sit Down, Shut Your Mouth\n    My Gallina\n    Country Music Fiddler\n    Morgan Poisoned The Water Hole\n    A Hillbilly's Deck Of Cards\n    Enormity In Motion (Poetry In Motion)\n    Bop Cat Bop\n    Muki Ruki\n    I Fell Out Of Love With Love\n    I Feel Better All Over (More Than Anywhere Else)\n    Cuzz Yore So Sweet [Alternate Version]\n    Little Red Webb\n    It Tickles\n    Goodbye Cruel World\n    Excuse Me Stranger\n    Simon Crum Needs A Hit\n    That's What I'd Do\n\n\n\n________________________________________\n\n    It's appropriate that Country Music Is Here to Stay: The Complete Simon Crum a.k.a. Ferlin Husky on Capitol was released on Collectors' Choice Music, because this is precisely the kind of music that appeals to collectors. Simon Crum was the alter ego of Ferlin Husky, who created him in the mid-'50s as an outlet for his novelty songs, which were always popular in country music, as evidenced by the popularity in the '50s of Homer &amp; Jethro. The thing about country novelties is, no matter how well they're done, they date very quickly and they can often be way too much to take in one setting. Such is the case with the Simon Crum recordings, which cover a lot of different musical territory from rockabilly to white-bread pop, mock jazz, and, of course, straight-ahead country, and also show that Husky was a skillful imitator, capable of doing anybody from Elvis Presley to Ernest Tubb. All of this is interesting in theory and, played in short doses of a track or two, it's pretty amusing, largely because Husky is indeed so skilled. But there is a big, big caveat -- to listen to more than one or two tracks in a row takes a Herculean effort for anybody who isn't a crazed novelty fanatic (and, if you're not in the mood, even one track can be a bit much). That's where the collectors angle comes in. By the time CCM released this in 2002, anybody who would be purchasing Simon Crum on CD would be interested enough to want it all, not just a selection -- after all, if you're interested in this stuff enough to hear it once, you want to immerse yourself, even if it can be a bit much at times -- which is where this complete collection comes in. There may not be track-by-track notes, but Greg Adams writes a very good overview, and this does serve up 21 tracks, including five previously unreleased songs, including three written by Dallas Frazier. There's no question that this appeals to a limited audience, but that audience will undoubtedly be satisfied by this collection, not in the least because it covers an area so specialized it's a wonder it came out at all on CD, especially at this late date.\n\n    -- Stephen Thomas Erlewine","torrent":{"xt":"urn:btih:82a679599936447c99535cd3c4e4ed8a9fb3696a","amp;dn":"Ferlin+Husky+-+Country+Music+Is++Stay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a679599936447c99535cd3c4e4ed8a9fb3696a","infoHashBuffer":{"type":"Buffer","data":[130,166,121,89,153,54,68,124,153,83,92,211,196,228,237,138,159,179,105,106]},"announce":[],"urlList":[]}}