{"title":"Doug Sahm (&amp; The Tex Mex Trip) - Groover's Paradise 1974@256","uid":3426250,"size":66438686,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83db2ccc02b21778566ab9b8330b35dc37e1c324&amp;dn=Doug+Sahm+%28%26+The+Tex+Mex+Trip%29+-+Groover%5C%27s+Paradise+1974%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzard","files":15,"time":1136025998,"description":"Doug Sahm - Groover's Paradise 1974\n[IMG]http://img521.imageshack.us/img521/3546/doug7ks.jpg[/IMG]\n\nsize:          63 mb\nbitrate:     256\n\nHook Tex-Mex music legend Doug Sahm up with the CCR rhythm section of Doug Clifford and Stu Cook and Creedence producer Russ Gary, and what do ya get? Probably the most coherent and poppiest record of his career (Doug did tend to ramble), one emblazoned with the unique artwork of local Austin artist Kerry Fitzgerald a.k.a. Kerry Awn and also featuring future Asleep at the Wheel member Link Davis, Jr. on various instruments. We?ve added new notes by Colin Escott that place this 1974 release in its proper (warped) perspective; it?s a favorite of many a Sahm devotee, now finally on CD. A 'Collectors? Choice Music' exclusive! Includes 'Groover?s Paradise; Devil Heart; Houston Chicks; For the Sake of Rock ?n? Roll!; Beautiful Texas Sunshine; Just Groove Me; Girls Today (Don?t Like to Sleep Alone); La Cacahuata (Peanut); Her Dream Man Never Came', and 'Catch Me in the Morning'.\n\nAnyone who finds hippies irritating might want to throw this record across the room -- and that's a good review right there, since it has been long established via intense scientific study that music which somehow motivates people to throw records across the room is usually quite good. No exception to this rule here, as fans of Doug Sahm often choose this as a personal favorite, while it is also one of the better side projects of the Creedence Clearwater Revival rhythm section. If Sahm was writing the review himself in 1974, he would have no doubt described the whole thing as some kind of &quot;trip&quot;; after all, this expression is used three times alone on the back cover of this album, actually less than one might expect considering the stoned-out nature of the accompanying comics. These black-and-white illustrations by Kelly Fitzgerald are a great part of the record's enduring charm, but the music itself is deeper than the coolie hippie vibe. This is simply a great roots rock album, and like much of Sahm's work it is loaded with complex details as well as loving interplay between the musicians. These tracks indicate a mastery of many basic forms such as blues, rhythm &amp; blues, norteno, country, and Cajun and the players always seem to be probing beyond this to find something new. Creedence Clearwater Revival drummer Doug Clifford produced as well as played, and did a superior job, irrigating the proceedings with a range of available Sahm streams like some kind of master gardener. The use of horns is excellent, not only providing plenty of punch in the arrangements but memorable effects such as the spooky baritone sax solo on &quot;Just Groove Me.&quot; A large section of the sonic spread is always reserved for Sahm's lush guitar playing, including lots of rock, country, and blues licks, while bassist Stu Cook sometimes adds additional guitar, expertly mocking the patented hypnotic John Fogerty sound for an effect that is not unlike Sahm sitting in on a Creedence album. Of course, the range of that classic '60s and '70s rock group seems quite limited compared to Sahm, who whips off an expert version of the Tex-Mex instrumental &quot;La Cacahueta,&quot; the only track here which he did not compose himself. The well-crafted yet daringly personal and unembarrassed songs include haunting country-influenced ballads such as &quot;Her Dream Man Never Came,&quot; as well as really top-notch examples of good old rock &amp; roll, the hilarious &quot;For the Sake of Rock 'N' Roll&quot; and the bewitchingly cooking &quot;Devil Heart.&quot; The second side of the original vinyl is one of this artist's most perfect set of songs. The final track, &quot;Catch Me in the Morning,&quot; is one of several on this album that benefits from a long, satisfying arrangement -- hardly the kind of simple dirt that is often tossed off the shovel in the quest for roots rock. The band tends to move through these pieces with confidence, as if already expecting to have lost the attention of the simpletons in the crowd. At the same time, there are those listeners who will find it hard to believe a simple song, let alone such a magnum opus, could be created from the almost nonexistent message of this song. &quot;Call me in the morning, I am too tired to talk right now,&quot; is just about all this song says, and it is one of the marvels of Sahm that he is able to parlay a near-operatic sense of importance into such a typical part of daily life. Giving him an instrumental credit for being a &quot;dreamer&quot; -- nicely enough, it comes right after the credit for bajo sexto -- is one of the most appropriate details, or &quot;trips,&quot; on Groover's Paradise.\n\n[IMG]http://img251.imageshack.us/img251/2993/cover4cf.jpg[/IMG]\n\nGroover's Paradise (1xCD)\nReleased: February 14, 2005\n\nTracks\n1. Groover's Paradise\n2. Devil Heart\n3. Houston Chicks\n4. For The Sake Of Rock 'n' Roll\n5. Beautiful Texas Sunshine\n6. Just Groove Me\n7. Girls Today (Don't Like To Sleep Alone)\n8. La Cacahuata\n9. Her Dream Man Never Came\n10. Catch Me In The Morning\n\nRelease Info\nPersonnel include: Doug Sahm (vocals, guitar, piano); Link Davis Jr. (vocals, fiddle, alto saxophone, tenor saxophone, baritone saxophone, piano, organ); Stu Cook (guitar, bass guitar); Doug Clifford (drums).\nCollectors' Choice Music  518 2005","torrent":{"xt":"urn:btih:83db2ccc02b21778566ab9b8330b35dc37e1c324","amp;dn":"Doug+Sahm+%28%26+The+Tex+Mex+Trip%29+-+Groover%5C%27s+Paradise+1974%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83db2ccc02b21778566ab9b8330b35dc37e1c324","infoHashBuffer":{"type":"Buffer","data":[131,219,44,204,2,178,23,120,86,106,185,184,51,11,53,220,55,225,195,36]},"announce":[],"urlList":[]}}