{"title":"DivX Plus Pro 8.1.1 [theLEAK]","uid":6374857,"size":48313032,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8426456c5285144b5abf1f200a863b9e44a8eade&amp;dn=DivX+Plus+Pro+8.1.1+%5BtheLEAK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theLEAK","files":4,"time":1304820807,"description":"DivX Plus Player (version 8) is a standalone media player. This player is a successor to DivX Player (versions 6 and 7) and Playa (version 5), made by the Project Mayo team that later became DivX, Inc\n\n\nThe DivX Plus Converter (version 8) introduced a dramatically changed interface from its predecessor. The former had a small round interface that allowed for little more than selecting the type of output and displayed the number of videos in the queue. The DivX Plus Converter interface contains a large window that exposes each video that has been added in a row with drop-down options for quality, size, audio, subtitles and more. Another notable change is while both the previous and DivX Plus versions have 15-day trials, the DivX Plus Converter still allows users to create DivX Plus HD files for free after the trial is complete.\n\n\nDivX Plus Web Player (formerly known as DivX Web Player and DivX Browser Plug-In) is a web browser plug-in for playing embedded video on web pages. Web Player supports playing DivX (.divx), AVI (.avi), Matroska (.mkv), MP4 (.mp4) and QuickTime (.mov) video formats on Google Chrome, Internet Explorer, Mozilla Firefox and Safari.\n\nIt also supports multiple audio tracks and muxed UTF-8 subtitles and is able to save video files locally upon completing of full-length buffer.\n\n\n\n\n\n\nInstruction:\n\n1) Double click on the application called &quot;DivXInstaller&quot;\n\n**There will be a pop up message saying: An update for DivX Plus software is available. Would you like to install the latest components?\n\nCLICK NO\n\n\n2) Once installation is finish, double click on the file called &quot;reg.x86.x64&quot;\n\n3) Enjoy!\n\n\n\n\n\n\nAny problem during or after the installation, comment below.\n\n-theLEAK team\t\t","torrent":{"xt":"urn:btih:8426456c5285144b5abf1f200a863b9e44a8eade","amp;dn":"DivX+Plus+Pro+8.1.1+%5BtheLEAK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8426456c5285144b5abf1f200a863b9e44a8eade","infoHashBuffer":{"type":"Buffer","data":[132,38,69,108,82,133,20,75,90,191,31,32,10,134,59,158,68,168,234,222]},"announce":[],"urlList":[]}}