{"title":"Wilson Phillips - Release Me  (2nafish)","uid":5236682,"size":146974724,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8454e5f5a036d72618bafd04e8115247366917e4&amp;dn=Wilson+Phillips+-+Release+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1261567853,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Release Me&quot; is a song written and recorded by Wilson Phillips, their second single from their debut album Wilson Phillips. It hit number one on the Billboard Hot 100 on September 15, 1990 and spent two weeks at number-one. It also topped the adult contemporary chart for one week that same year.\n\nWilson Phillips is the Grammy Award nominated 1990 debut album by Wilson Phillips. The singles, &quot;Hold On&quot;, &quot;Release Me&quot; and &quot;You're in Love&quot;, all hit number one on the US Billboard Hot 100 singles chart, while &quot;Impulsive&quot; reached the top five. The album sold 5 million copies in the US and over 10 million worldwide making Wilson Phillips, at the time, the best selling female group of all time breaking a record previously held by The Supremes.\n\nWilson Phillips is an American vocal group consisting of Carnie Wilson, Wendy Wilson and Chynna Phillips.\n\nTheir 1990 self-titled debut album sold over 10 million copies worldwide, and scored three number one singles on the Billboard Hot 100 making the trio, at the time, the best-selling female group of all time. In 1990, the group won the Billboard Music Award for Hot 100 Single of the Year for Hold On, and in addition was nominated for four Grammy Awards and two American Music Awards.\n\nWilson Phillips released their debut album, Wilson Phillips, in 1990.\n\nTheir debut single, &quot;Hold On&quot;, hit #1 on the U.S. Billboard Hot 100 chart on June 9, 1990, bumping Madonna's &quot;Vogue&quot; off the top spot. The single was also #1 on the US Billboard Adult Contemporary and became a worldwide hit, peaking at #2 in Australia, #6 in the UK, #7 in Ireland, #10 in Sweden, and at #15 in the Netherlands, Germany, and Switzerland. The single also won Wilson Phillips the Billboard Music Award for Hot 100 Single of the Year for 1990.\n\nThe second and fourth singles from the album also became number-one singles on the Billboard Hot 100: &quot;Release Me&quot; (2 weeks) and &quot;You're in Love&quot; (1 week). The singles &quot;Impulsive&quot; and &quot;The Dream Is Still Alive'&quot;, peaked at #4 and #12, respectively, on the Hot 100.\n\nIn 1992, Wilson Phillips also made rock history as Billboard declared their debut album the best selling album of all time by an all female group, peaking at #2 on the Billboard 200 album chart, and selling over 5 million copies in the US and over 10 million copies worldwide, which also made Wilson Phillips, at the time, the best selling female group of all time, breaking the previous record set by The Supremes.\n\nIn June 1992, Wilson Phillips released their second album, Shadows and Light. The album was deeply personal and adopted a more serious tone, with tracks exploring issues such as child abuse (&quot;Where Are You&quot;) and their estrangement from their fathers (&quot;Flesh and Blood&quot;, &quot;All the Way From New York&quot;). The first single, &quot;You Won't See Me Cry,'&quot; peaked at #20 in the US and #18 in the UK, the first time they had a higher-ranking single in the UK than in the US. The album peaked at #4 on the Billboard 200 and was certified platinum.\n\nShortly after the release of Shadows and Light, Chynna Phillips announced plans for a solo career, and the group decided to split up.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8454e5f5a036d72618bafd04e8115247366917e4","amp;dn":"Wilson+Phillips+-+Release+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8454e5f5a036d72618bafd04e8115247366917e4","infoHashBuffer":{"type":"Buffer","data":[132,84,229,245,160,54,215,38,24,186,253,4,232,17,82,71,54,105,23,228]},"announce":[],"urlList":[]}}