{"title":"Silence: Lectures and Writings by John Cage","uid":8065999,"size":1336860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:848a9f5c999b13874cd90123e4747f1dd7d1baa0&amp;dn=Silence%3A+Lectures+and+Writings+by+John+Cage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ArielC","files":1,"time":1359180826,"description":"Silence \n\nLectures and Writings by John Cage\n\nWesleyan (1961)\n\nPDF\n\n233 pages\n\nJohn Cage is the outstanding composer of avant-garde music today. The Saturday Review said of him: &quot;Cage possesses one of the rarest qualities of the true creator- that of an original mind- and whether that originality pleases, irritates, amuses or outrages is irrelevant.&quot; &quot;He refuses to sermonize or pontificate. What John Cage offers is more refreshing, more spirited, much more fun-a kind of carefree skinny-dipping in the infinite. It's what's happening now.&quot; -The American Record Guide\n\n&quot;There is no such thing as an empty space or an empty time. There is always something to see, something to hear. In fact, try as we may to make a silence, we cannot. Sounds occur whether intended or not; the psychological turning in direction of those not intended seems at first to be a giving up of everything that belongs to humanity. But one must see that humanity and nature, not separate, are in this world together, that nothing was lost when everything was given away.&quot;\n\n&quot;SILENCE starts with the finest dedications of modern times--'To Whom It May Concern'--and past that you embark on one of the most entertaining and rewarding intellectual voyages that contemporary literature affords.&quot;\n--Alfred Frankenstein, San Francisco Chronicle\n\n&quot;One of the most entertaining and rewarding intellectual voyages that contemporary literature affords.&quot;--San Francisco Chronicle","torrent":{"xt":"urn:btih:848a9f5c999b13874cd90123e4747f1dd7d1baa0","amp;dn":"Silence%3A+Lectures+and+Writings+by+John+Cage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848a9f5c999b13874cd90123e4747f1dd7d1baa0","infoHashBuffer":{"type":"Buffer","data":[132,138,159,92,153,155,19,135,76,217,1,35,228,116,127,29,215,209,186,160]},"announce":[],"urlList":[]}}