{"title":"Pat Benatar - Heartbreaker [ZDF Kultnacht 1979].VOB","uid":6329553,"size":194895872,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8502930ed7e6676012dda9ca4670637d11bbbda5&amp;dn=Pat+Benatar+-+Heartbreaker+%5BZDF+Kultnacht+1979%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1303229631,"description":"Pat Benatar - Heartbreaker [ZDF Kultnacht 1979].VOB\n\n\nHQ very rare ZDF Kultnacht tv show promo performance music video. Kultnacht (English: Cult Night) is a tv show broadcast by Second German Television, ZDF, is a public-service German television broadcaster based in Mainz, a city in Germany and the capital of the German federal state of Rhineland-Palatinate. It is run as an independent non-profit institution, which was founded by the German federal states.\n\nZDF has also been relayed by cable since the days of the first cable pilot projects. The first Europe-wide satellite broadcast via Astra 1C began in August 1993 during the IFA (&quot;International Broadcasting Exhibition&quot;) in Berlin. In the same decade, these new technologies were used to enable digital broadcasting of ZDF. Today, ZDF is available free-to-air throughout Europe via Astra 1H\n\n&quot;Heartbreaker&quot; is a song recorded by Pat Benatar on her 1979 album In the Heat of the Night. Written and composed by Geoff Gill and Clint Wade, it reached #23 on the U.S. Billboard Hot 100. It is a staple on her live shows. \n\nWhile not confirmed as an influence, the lyrics of &quot;Heartbreaker&quot; are similar to the song of the same title by the Crystals with &quot;Heartbreaker, dream-maker, love-taker&quot; being strikingly alike to the Crystals' lyric &quot;Heartbreaker, hip shaker, troublemaker&quot;.\n\nIn the Heat of the Night is the debut album of Pat Benatar, released in 1979. It peaked at #12 on the Billboard 200 on the strength of her breakthrough hit &quot;Heartbreaker&quot;, plus covers of Nick Gilder's &quot;Rated X&quot;, John Mellencamp's &quot;I Need a Lover&quot;, The Alan Parsons Project's &quot;Don't Let it Show&quot;, Sweet's &quot;No You Don't&quot;, and Smokie's &quot;If You Think You Know How To Love Me&quot; and &quot;In the Heat of the Night.&quot; The album also included the hit &quot;We Live For Love.&quot;\n\nPat Benatar (born Patricia Mae Andrzejewski January 10, 1953) is an American singer and four time Grammy winner. She had considerable commercial success particularly in the United States. During the 1980s, Benatar had two RIAA-certified Multi-Platinum albums, five RIAA-certified Platinum albums, three RIAA-certified Gold albums and 19 Top 40 singles, including &quot;Love Is A Battlefield&quot;, &quot;Hit Me With Your Best Shot&quot;, and &quot;We Belong&quot;. Benatar was one of the most heavily played artists in the early days of MTV.\n(video has a mostly-transparent white &quot;2DF&quot; logo at the top left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Heartbreaker_(Pat_Benatar_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Heartbreaker_(Pat_Benatar_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KahIJaAdK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KahIJaAdK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:22\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:8502930ed7e6676012dda9ca4670637d11bbbda5","amp;dn":"Pat+Benatar+-+Heartbreaker+%5BZDF+Kultnacht+1979%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8502930ed7e6676012dda9ca4670637d11bbbda5","infoHashBuffer":{"type":"Buffer","data":[133,2,147,14,215,230,103,96,18,221,169,202,70,112,99,125,17,187,189,165]},"announce":[],"urlList":[]}}