{"title":"Will Ferrell-Afternoon Delight (Soundtrack: Anchorman)(2nafish)","uid":5411531,"size":147331076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:862d4a3c9ca7b4f6c77f443df590c539ab506f3c&amp;dn=Will+Ferrell-Afternoon+Delight+%28Soundtrack%3A+Anchorman%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267769615,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWill Ferrell - Afternoon Delight  (Soundtrack: Anchorman: The Legend of Ron Burgundy)(2nafish)\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n&quot;Afternoon Delight&quot; is a 1976 song by the Starland Vocal Band, written by Bill Danoff, featuring close harmony and sexually suggestive lyrics. It became a number-one U.S. Billboard Hot 100 single on July 10, 1976. The song has been inducted in the Rock and Roll Hall of Fame\n\nConcurrent to the Starland Vocal Band's version, country singer Johnny Carver had a Top 10 version of his own on the Billboard Hot Country Singles chart.\n\nIn the 1990s and 2000s, &quot;Afternoon Delight&quot; was featured in several film and television shows, albeit often in an ironic sense, such as Get a Life (Chris Wins a Celebrity), Good Will Hunting, PCU, Boogie Nights, The Rules of Attraction, The Spirit of '76, Starsky &amp; Hutch, Arrested Development (as part of a plot point in the episode &quot;Afternoon Delight&quot;), The Simpsons (&quot;The Fat and the Furriest&quot;), Rules of Engagement, Sports Night Complete Savages, South Park and Anchorman: The Legend of Ron Burgundy; it was featured prominently in a 1991 episode of Murphy Brown, where a number of the characters flashed back to the Bicentennial Celebration in 1976. In 1983, The Circle Jerks also covered this song as one of the six cover versions on &quot;Golden Shower of Hits (Jerks on 45)&quot;, which appears on their third album with the same title. A British experimental folk music band Current 93 used an industrial-style cover version as an introduction to their performances of their 2009 album.\n\nThe name for the song comes from the name of a special menu of the same name at Clyde's restaurant in Georgetown.\n\nAnchorman: The Legend of Ron Burgundy is a 2004 comedy film written by Will Ferrell and Adam McKay. The film is a tongue-in-cheek take on the culture of the 1970s, particularly the then-new Action News format. It portrays a San Diego TV station where one female reporter (Christina Applegate) struggles to become the first Anchorwoman. This film is number 100 on Bravo's 100 funniest movies, and 113 on Empire's 500 Greatest Movies of All Time.\n\nThe film made $28.4 million in its opening weekend, and $89.3 million worldwide in its total theatrical run. A companion film assembled from outtakes and abandoned subplots, titled Wake Up, Ron Burgundy: The Lost Movie, was released straight-to-DVD in late 2004. In May 2008, it was confirmed that a sequel to Anchorman is in the planning stages.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:862d4a3c9ca7b4f6c77f443df590c539ab506f3c","amp;dn":"Will+Ferrell-Afternoon+Delight+%28Soundtrack%3A+Anchorman%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862d4a3c9ca7b4f6c77f443df590c539ab506f3c","infoHashBuffer":{"type":"Buffer","data":[134,45,74,60,156,167,180,246,199,127,68,61,245,144,197,57,171,80,111,60]},"announce":[],"urlList":[]}}