{"title":"Jive Bunny The Mastermixers - The Album 1989 [FLAC] Kitlope","uid":6721998,"size":278119026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:864005aba5b20d1779c1e61316179329f333a6de&amp;dn=Jive+Bunny+The+Mastermixers+-+The+Album+1989+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":12,"time":1317776256,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 864005ABA5B20D1779C1E61316179329F333A6DE\nFile Size: 265.23 MB\nYear: 1989\nLabel: Atco / Telstar\nCatalog #: CD 91322\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nJive Bunny and the Mastermixers were a 1980s and early 1990s novelty pop music act from Rotherham, Yorkshire, England. The face of the group was Jive Bunny, a cartoon rabbit who appeared in the videos, and also (as a human being in a costume) did promotional appearances for them. Doncaster DJ and producer Les Hemstock created and mixed the J.Bunny concept for father and son team John and Andrew Pickles.[1] Ian Morgan a fellow DJ and producer also engineered and mixed the first albums. Morgan was replaced in the early 1990s by DJ and producer Mark &quot;The Hitman&quot; Smith.\n\nJive Bunny's three number ones were &quot;Swing the Mood&quot;,[1] &quot;That's What I Like&quot; and &quot;Let's Party&quot;.[2] All three songs used sampling and synthesisers to combine pop music from the early rock and roll era together into a medley. The results were somewhat like Jaap Eggermont's Stars on 45, although he had hired &quot;sound-alike&quot; singers and musicians to recreate the music from scratch.\n\nThe act had eleven entries in the UK singles chart between July 1989 and November 1991. Each track used a sampled instrumental theme to join the old songs together, in much the same way as dance music megamixes. &quot;Swing the Mood&quot; began with Glenn Miller's famous &quot;In the Mood&quot; (a recording from 1939), followed immediately by rhythmic re-editing of Bill Haley and His Comets' &quot;Rock Around the Clock&quot;, Little Richard's &quot;Tutti Frutti&quot; and the Everly Brothers' &quot;Wake Up, Little Susie&quot;. &quot;Swing the Mood&quot; was #1 for five weeks on the UK singles chart in 1989, and quickly caught on in the United States, where it reached #11 on the Billboard Hot 100 chart.\n\n&quot;That's What I Like&quot; featured the theme music from the television police drama Hawaii Five-O, with overlaid excerpts from rock hits like Chubby Checker's &quot;The Twist&quot; and Ernie Maresca's &quot;Shout, Shout (Knock Yourself Out)&quot;. &quot;Let's Party&quot; (released originally in the U.S. as &quot;March of the Mods&quot;) used &quot;March of the Mods&quot; (also known as the Finnjenka Dance), interpolating Del Shannon's &quot;Runaway&quot; and The Wrens' &quot;Come Back My Love&quot; among others. In the UK &quot;Let's Party&quot; was a Christmas hit with samples of Wizzard's &quot;I Wish It Could Be Christmas Everyday&quot;, Slade's &quot;Merry Xmas Everybody&quot; and Gary Glitter's &quot;Another Rock 'N' Roll Christmas&quot;. Recently this has been remixed to remove the Gary Glitter track to avoid controversy over his subsequent criminal convictions should any radio stations wish to play it over the Christmas period. They did not have permission to use the original Wizzard recording so Roy Wood re-recorded the part of the track for them.\n\nThe original European medleys featured the original recordings by the original artists. Legalities prevented certain of the original recordings to be reused in America, so the American Jive Bunny releases substituted later re-recordings of the same tunes by Bill Haley, Del Shannon and others.\n\nThe original idea for the project came from Hemstock on the DJ-only Mastermix DJ service. The original Swing The Mood mix appeared on Issue 22 of Mastermix's monthly album release. John Pickles (father of Andy) was strictly speaking never in the band, but the owner of the label and effectively the manager.\n\nHemstock later became a trance DJ working with Paul Van Dyk. Pickles Jr., went on to found the hard house record label, Tidy Trax, with fellow DJ Amadeus Mozart. Morgan became a successful club DJ and Smith later worked in the music industry as a label manager and producer.\n\nThe Mastermix DJ Music Service is now in its 25th year and still supplies mixes and DJ compilations on CD and digital download.\n\n\n\n\n\n\nJive Bunny: The Album 1989\n\n\n\nJive Bunny: The Album is the debut album by Jive Bunny and the Mastermixers. It was released in 1989 by Telstar Records and peaked at number two on the UK Albums Chart. It was the Christmas number two album that year.\n\n\nTracks: \n\n\n1.\tSwing The Mood\n2.\tRock And Roll Party Mix\n3.\tLover's Mix\n4.\tDo You Wanna Rock\n5.\tThat's What I Like\n6.\tGlen Miller Medley\n7.\tSwing Sisters Swing\n8.\tHopping Mad\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:864005aba5b20d1779c1e61316179329f333a6de","amp;dn":"Jive+Bunny+The+Mastermixers+-+The+Album+1989+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864005aba5b20d1779c1e61316179329f333a6de","infoHashBuffer":{"type":"Buffer","data":[134,64,5,171,165,178,13,23,121,193,230,19,22,23,147,41,243,51,166,222]},"announce":[],"urlList":[]}}