{"title":"Arduino Wearables {BBS}","uid":7565005,"size":9288567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86412ea7383482a6300d79ec6425cefe69f59695&amp;dn=Arduino+Wearables+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345837097,"description":"You've probably seen LED-decorated t-shirts and hats, and maybe even other electronic gadgets embedded in clothing, but with Arduino Wearables you can learn to make your own wearable electronic creations.\n\nThis book is an introduction to wearable computing, prototyping, and smart materials using the Arduino platform. Every chapter takes you all the way from idea to finished project. Even if you have no experience with Arduino, this book will get you set up with all the materials, software, and hardware you need; you'll complete simple projects first, and then build on your growing expertise to make more complex projects. By the end of the book, you'll have learned:\n\n    * Electronics basics\n    * How to prototype successfully\n    * Arduino programming\n    * How to design and build your own wearable Arduino creations\n\nAlong the way you'll create fun and inspiring wearables, such as: \n\n    * An LED bracelet: learn the basics of wearable electronics\n    * A synthesizer tie: accept user input and create output in response\n    * A solar-powered glow in the dark bag: create self-sufficient wearables\n    * A shape memory flower: store state and manipulate your wearables\n    * An EL wire dress: add designer touches to your wearables\n    * A beatbox hoodie: use a voice-activated sequencer and skin resistance to create the coolest of urban wearables\n\nArduino Wearables is the complete guide to getting started with Arduino and wearable computing. The 10 inspiring projects to make, learn from, and build upon will equip you for creating your own projects; the only limit is your imagination.\n\n\n# Paperback: 336 pages\n# Publisher: Apress; 1 edition (July 4, 2012)\n# Language: English\n# ISBN-10: 1430243597\n# ISBN-13: 978-1430243595","torrent":{"xt":"urn:btih:86412ea7383482a6300d79ec6425cefe69f59695","amp;dn":"Arduino+Wearables+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86412ea7383482a6300d79ec6425cefe69f59695","infoHashBuffer":{"type":"Buffer","data":[134,65,46,167,56,52,130,166,48,13,121,236,100,37,206,254,105,245,150,149]},"announce":[],"urlList":[]}}