{"title":"101 Facts You Should Know About Food.pdf","uid":6054866,"size":11898865,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:867b07727bb979c77833e67a7d7b27d9f9631aea&amp;dn=101+Facts+You+Should+Know+About+Food.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikelove","files":1,"time":1292868758,"description":"The author of the essential read &quot;Everything You Need to Know: Bird Flu&quot; presents 101 things you really should know about the food you eat...The way fast food changes brain chemistry can make it as addictive as heroin. Eating less could be the best way to stop growing old. 47 per cent of broiler chickens sold suffer from crippling bone disorders. A typical family throws away 30-50 kg of food packaging a month. From the extraordinary distance our food can travel to reach our tables to the remarkable benefits of eating avocados, John Farndon shows the amazing, often shocking, truth behind the food we eat.\n\n\nCovering everything from the big businesses that control food production around the world to the dangers of food dyes, this book reveals the complex facts behind the simplest of meals. Find out just what GM food is and why you may eat it unknowingly, how food gets its flavour, how some foods are not as nutritious as they should be, how bringing exotic foods to your table may literally cost the Earth, and much more. This is an essential guide to the facts behind food, the one vital thing in your life besides air and water - and the world's biggest business.","torrent":{"xt":"urn:btih:867b07727bb979c77833e67a7d7b27d9f9631aea","amp;dn":"101+Facts+You+Should+Know+About+Food.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867b07727bb979c77833e67a7d7b27d9f9631aea","infoHashBuffer":{"type":"Buffer","data":[134,123,7,114,123,185,121,199,120,51,230,122,125,123,39,217,249,99,26,234]},"announce":[],"urlList":[]}}