{"title":"Adblock Plus v1.0.1 Android","uid":7889353,"size":1894418,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:877b86f53702e759419c093e88365f017216d10c&amp;dn=Adblock+Plus+v1.0.1+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ARMANI","files":-1,"time":1354688323,"description":"Adblock Plus v1.0.1\n\n\n\nName: Ad-block Plus\n\n\nVersion: v1.0.1\n\n\nDescription: It blocks all online advertising when browsing, and when using your favorite apps like Angry Birds. It is 100% free and makes your Android device much more enjoyable.\n\n\nAd-block Plus blocks: mobile ads, video advertising, banners, push notifications, display advertising, HTML5 advertising, and much more.\n\n\nPLEASE NOTE: Adblock Plus might have limited functionality, depending on the Android version on your device and whether your device has been rooted:\nRooted: Blocks ads over Wi-Fi and 3G\nNon-rooted with Android 4 (or later): Blocks ads over Wi-Fi\nNon-rooted with Android 3 or earlier: Some manual configuration is required. Please visit our website to learn how to setup your own proxy: https://adblockplus.org/en/android-config#proxy\nAlso, Android does not allow ads to be blocked on SSL encrypted websites.\n\n\nAdblock Plus is an open-source, community driven project. Many volunteers are contributing to the development and maintenance of Adblock Plus. Currently, there are over forty continuously updating filter lists in over a dozen different languages, ensuring that all obtrusive ads remain blocked.\n\n\nPlease note that Adblock Plus will probably become the highest data-using application on your Android device. However, this is only because Adblock Plus needs to filter the data to ensure that the ads can be blocked. Adblock Plus is actually only using a fraction of the data shown on your device.\n\n\nWhat's in this version:\n\n* Added an option to make notification icon transparent\n* Fixed various application crashes \n\n\n\n\n","torrent":{"xt":"urn:btih:877b86f53702e759419c093e88365f017216d10c","amp;dn":"Adblock+Plus+v1.0.1+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877b86f53702e759419c093e88365f017216d10c","infoHashBuffer":{"type":"Buffer","data":[135,123,134,245,55,2,231,89,65,156,9,62,136,54,95,1,114,22,209,12]},"announce":[],"urlList":[]}}