{"title":"Have Gown, Will Wed by Killian McRae","uid":9715917,"size":3301977,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87a425ec65b5d1026ac55f03fbc0eb05e7880de8&amp;dn=Have+Gown%2C+Will+Wed+by+Killian+McRae&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1394159179,"description":"\nBack in college, the bras-before-bros sisterhood decided to live for achievement in the boardroom, not the bedroom. Rosalind Betters embraced that philosophy, pursuing her career and little else. But when her last single friend, Kamakshi, announces her engagement in of all things, an arranged marriage, Rosalind reevaluates the merits of matrimony. \n\nIn her typical gung ho fashion, she names a date, books a venue, hires a caterer, and picks out a dress, all before finding a groom. Taking a lesson from Kamakshi and too busy to do otherwise, Rosalind hires San Francisco's best headhunter, Xavier Hommes, to find her better half for her. \n\nAt first, Xavier thinks Rosalind is one of those eccentric personalities for which the city is famous. As he comes to know her, however, Xavier finds himself hating his task for reasons he never would have suspected. If Rosalind really wants a man who will make her happy, she need look no further. As W-Day approaches and Rosalind starts falling for someone Xavier himself headhunted, he walks the line between professionalism and passion, trying to decide if competing to become Mr. Betters is worth the risk to his commission, his reputation, and Rosalind's happiness.\n\nGenre: Romance","torrent":{"xt":"urn:btih:87a425ec65b5d1026ac55f03fbc0eb05e7880de8","amp;dn":"Have+Gown%2C+Will+Wed+by+Killian+McRae","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a425ec65b5d1026ac55f03fbc0eb05e7880de8","infoHashBuffer":{"type":"Buffer","data":[135,164,37,236,101,181,209,2,106,197,95,3,251,192,235,5,231,136,13,232]},"announce":[],"urlList":[]}}