{"title":"Showdown (Western) {Murphy} [1963]","uid":8229321,"size":763988869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8864ed918d81c5a9a34f427241fd60996851cd8d&amp;dn=Showdown+%28Western%29+%7BMurphy%7D+%5B1963%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alien99","files":-1,"time":1362687358,"description":"Found this floating around on one of my drives.  so so on quality i'm sure\nit came from a vhs but being a Audie Murphy film maybe all that will ever be available.  \nTechnical Specs\nSound Mix:\nMono (Westrex Recording System)\nColor:\nBlack and White  \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0057497/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0057497/&lt;/a&gt;\n\nStoryline\n\nA cowboy has to get 12,000 dollars in stolen bonds from the ex-girlfriend of his partner, or the gang holding him hostage will kill him.\n\n\nReview\n\n\nThings get more complicated when Bert's purported girl, a saloon singer named Estelle, enters the picture. She has a couple of dramatic scenes, including an extended monologue, that must have made the actress (Kathleen Crowley) quite happy but tend to slow the movie down. Only when Chris is on his own against the remaining gang members in rugged terrain does the picture get interesting. Unfortunately, there are not enough of these scenes to save the movie. Murphy's very good in a patented role as a decent ordinary guy caught up in the machinations of lawbreakers, but he would have been better in color and with a more thought-out script. There's a sense here that the production was just a bit on the hurried side.\n\nStrother Martin plays a town drunk and L.Q. Jones plays a silent member of the gang. Both are among the town's prisoners chained to the same post early in the film. They're seen in shots together but don't interact. These two actors would make a memorable team six years later as the squabbling &quot;gutter trash&quot; bounty hunters Coffer and T.C. in Sam Peckinpah's THE WILD BUNCH.\n\nAccording to &quot;No Name on the Bullet: A Biography of Audie Murphy,&quot; by Don Graham, Murphy was quite upset when he learned that SHOWDOWN was being filmed in black-and-white and almost stopped working. &quot;I'm not gonna act,&quot; is how he put it. The producer eventually talked him into finishing the movie, but Murphy vowed, &quot;This is the last picture I'm gonna do in black and white.&quot; It was.\n","torrent":{"xt":"urn:btih:8864ed918d81c5a9a34f427241fd60996851cd8d","amp;dn":"Showdown+%28Western%29+%7BMurphy%7D+%5B1963%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8864ed918d81c5a9a34f427241fd60996851cd8d","infoHashBuffer":{"type":"Buffer","data":[136,100,237,145,141,129,197,169,163,79,66,114,65,253,96,153,104,81,205,141]},"announce":[],"urlList":[]}}