{"title":"Coast To Coast AM 10-30-2014 - Ebola, UFOs &amp; Secrecy.mp3","uid":11336910,"size":55525660,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8935aaa8bf5458f7a1c7d603d6200ed60c258b98&amp;dn=Coast+To+Coast+AM+10-30-2014+-+Ebola%2C+UFOs+%26amp%3B+Secrecy.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Isaac09","files":-1,"time":1414716062,"description":"Ebola, UFOs &amp; Secrecy\n\n\nDate:\t10-30-14\nHost:\tGeorge Noory\nGuests:\tLinda Moulton Howe, Lori McDonald\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 33mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 52.6 MiB (99%)\n\n\n\nEarthfiles investigative reporter Linda Moulton Howe discussed the current Ebola outbreak; a breakthrough at the UK's Ministry of Defense on the Rendlesham event; a gigantic black triangle seen by 25 U.S. Army Infantry south of Baghdad; and Robert Salas' experiences at Malmstrom AFB of astounding UFO interference. No one has explained how the Ebola RNA filovirus, simpler than the HIV RNA retrovirus, can kill so aggressively and rapidly, Linda noted. She spoke with virologist Thomas Geisbert, Ph.D., who is now trying to develop an Ebola vaccine at the Galveston National Laboratory. He has not seen evidence that the virus could be transmitted by air, but there could be a higher concentration of the virus in body fluids with this particular strain that would allow it to spread by a simple touch of skin, he said. Further info.\n\nIn an interview with retired USAF Tech Sgt. John Burroughs, he detailed how the MoD admitted it had withheld at least 18 classified UFO files, even after they claimed they'd transferred all such documents to the British National Archives. Burroughs was one of the airmen exposed to lights, craft and presumed dangerous ionizing radiation in Rendlesham Forest in December 1980. John asks, &quot;How could the MoD have said that Rendlesham was of no defense significance, that UFOs and UAPs are not of defense significance, when so much of this stuff in the Condign report (subject of his FOIAs) is classified defense?&quot; Project Condign even references the Rendlesham Forest event specifically as an example of how UFOs' ionizing radiation can affect minds and bodies of exposed humans, he said. More here.\n\nIn her third report, Linda spoke with Sergeant 1st Class David Mark Koch who witnessed a huge triangle (view sketch) along with 25 U.S. Army Infantry south of Baghdad on June 13, 2006. The silent craft was the size of an aircraft carrier, and hung low in the sky, he said. This was the date that President George Bush made a surprise landing at Baghdad Airport, and in spite of the national security issues of a visiting President, no one in the Army unit wanted to report a UFO because they knew they would face both mockery and heavy interrogation, he shared. In the next segment, Koch described seeing a bizarre insectoid entity about 3 ft. tall when he was stationed at an army unit in Germany in 1999. Linda also talked to Capt. Robert Salas (Ret.) about his personal experience in 1967 at Malmstrom AFB when a large, reddish-orange glowing aerial disc was seen, just as the nuclear missiles were suddenly disabled, and how governments conspire to conceal this type of information. Further details.\n\nHauntings &amp; Clearings\nFirst hour guest, paranormal investigator and spiritual adviser Lori McDonald talked about various types of hauntings and ghosts, and how to go about clearing a haunted home. People don't have to be victims of paranormal activity-- they can reclaim their home with various techniques, such as by using specific house blessings, she said. McDonald also spoke about her research into the ominous Black-Eyed Children phenomenon, noting that these entities can cause intense terror for anyone who encounters them.\n\nNews segment guests: Howard Bloom, James Sanders, Peter Schiff","torrent":{"xt":"urn:btih:8935aaa8bf5458f7a1c7d603d6200ed60c258b98","amp;dn":"Coast+To+Coast+AM+10-30-2014+-+Ebola%2C+UFOs+%26amp%3B+Secrecy.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8935aaa8bf5458f7a1c7d603d6200ed60c258b98","infoHashBuffer":{"type":"Buffer","data":[137,53,170,168,191,84,88,247,161,199,214,3,214,32,14,214,12,37,139,152]},"announce":[],"urlList":[]}}