{"title":"Cyberia 2: Resurrection (Virgin Interactive Entertainment) (RUS","uid":11224266,"size":698033179,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:894eda72435ec9e20c18072f9298556bf0661cad&amp;dn=Cyberia+2%3A+Resurrection+%28Virgin+Interactive+Entertainment%29+%28RUS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1413419024,"description":"General Information:\n \nYear: 1995\nGenre: Arcade / Logic (Puzzle)\nDeveloper: Xatrix\nPublisher: Virgin Interactive Entertainment\nPublication Type: Repak\nLanguage: English\nSound language: Russian\nMedicine: Not required\n\n            System requirements:\nâ™¦ Operating System: - Windows XP/7/Vista/8\nâ™¦ Processor: - Pentium 4, 3.0 ghg\nâ™¦ Memory: - 128 MB\nâ™¦ Video: - 16 MB\nâ™¦ Sound system: - DX9\nâ™¦ Hard disk space: - 3 GB\n\nDescription\nThe protagonist of the game, Zack is the same impeccable reputatsiey.V 2027, cracking the protection of bank computer, Zack destroyed\ncontributions in excess of five hundred million, but was caught and convicted of\nit's for life.\n\nKGB general FWA Devlin (Devlin) Zach pulls out\nprison, with the condition that he will perform a secret mission. The purpose of the job\n- To penetrate the complex Cartel &quot;cyber&quot; (Cyberia) and find\nnew secret weapon.\n\nZach, passing through many trials to the gun. This\nartificially grown cybernetic organism - &quot;Project Future Perfect&quot;\nwith reason, like a human. Then Zach learns from the insidious\nDevlin, that the real purpose of the task - to destroy the project together with\nby Zach with bombs transplant surgeons in FWA\nour hero's brain.\n\nThe only chance of escape - to merge with the &quot;Project Future Perfect,&quot; which\nZach does. Joining together in one powerful body - Sayberion\n(Cyberion), Zack and &quot;Project Future Perfect&quot; take off from the surface of the Earth and\nDevlin revenge by destroying the main space station FWA.\nCast off an explosion Sayberion falls to Earth and is broken somewhere\nRockies. Thus ends the first part of the game.\n\nAfter this incident, the world began to emerge centers\nrevolt against the tyranny of the FWA, there are rebels of the underground (Rebel\nUnderground). They are, in spite of the shortage of men and weapons,\nresist the forces of FWA.\n\nZack picks up a rescue team, led by John\nCorbin (Dr. John Corbin).\n\nDr. John Corbin, more than fifty years of his life\ndevelop weapons of mass destruction, working only for personal\nbenefits. He was in the group of scientists involved in the development of the project\nFuture Perfect, but was dismissed from the cases because of his desire to use\nproject exclusively for military purposes. Now a new guide FWA\nit provides everything you need for development is super-weapon.\n\nScientists have picked up Zack, separated from his body and Sayberiona\nplaced in suspended animation for kriosklade FWA (FWA Cryonic Storage Facility).\nZack was placed in one of the capsules in stock and is shipped in a deep\nsleep at a temperature below minus one hundred and eighty degrees.\n\nAfter the merger with Zach cybernetic organism in its tissues\nkolosalnye mutations occurred. With a sample of tissue, Dr.\nCorbin managed by mutations wants to create a terrible new weapon\ndestructive power. Corbin has developed a weapon and began to multiply\nnano-infected cells contained in the tissues of Zack who\nare a powerful nano-weapons. But John Corbin did not realize that the blood of Zack\ncontains the(vaccine) for this weapon.\n\nRebels have to get Zack in secret laboratories of Dr.\nCorbin (Dr. Corbin's Secret Lab), to get thebefore\nWhat Corbin apply new weapons.\n\n            Extras. Information:\nFeatures\n- The continuation of the first part\n- Insanely addictive plot\n- Varied gameplay\n- Beautiful graphics\n\nFeatures repack\n- Do not cut / no recoded\n- The game is packed in DosBox\n- Russian voice ... which, unfortunately, very bad.\n- Author repack: KirillGames","torrent":{"xt":"urn:btih:894eda72435ec9e20c18072f9298556bf0661cad","amp;dn":"Cyberia+2%3A+Resurrection+%28Virgin+Interactive+Entertainment%29+%28RUS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894eda72435ec9e20c18072f9298556bf0661cad","infoHashBuffer":{"type":"Buffer","data":[137,78,218,114,67,94,201,226,12,24,7,47,146,152,85,107,240,102,28,173]},"announce":[],"urlList":[]}}