{"title":"Spider-Man 3 2007 DVDRIP by HaseoLove","uid":5645778,"size":1399327186,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:898b0e77fa6ac654b7f4df0ae584829fed6306d9&amp;dn=Spider-Man+3+2007+DVDRIP+by+HaseoLove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HaseoLove","files":1,"time":1277289829,"description":"The Official Spider-Man 3 movie ripped with AVI 2 DVD Converter\n\n--------------------\n\nAVI SPECS:\n\nLength: 2:19:08\n29 frames/second\nSize 1.30 GB\nFrame Size: 720x320 (Widescreen DVD)\n\n--------------------\n\nPlot Summary (from IMDB):\n\nAfter Mary Jane and Peter Parker have confessed their love for one another, we start things off with them happier than ever. Spider-Man is still doing what he does best - saving the world. Mary Jane is the star of a great Broadway show. However, through all the silver linings, Harry is still blaming Peter for killing his father. After multiple attempts at trying to reason with him and patch things up, Harry finally confronts Peter and they engage in a brutal battle leaving Harry with temporary amnesia. During this time Peter encounters a symbiote, which attaches itself to his Spidey suit. After awhile Peter can feel a difference in his behavior (more aggressive) but as well his powers are amplified. Struggling to save his relationship with Mary Jane he removes the suit using the bells of the church and the suit finally grabs hold of Eddie Brock. Eddie was currently praying Peter would be killed for all the embarrassment that Peter's caused him. Not a minute too soon, Peter gets back to normal, but seems to have lost Mary Jane - and what's worse is she is held captive by Venom and Sandman - who have seem to have join forces. After realizing this, Peter asks Harry for help, but is declined since Harry has gotten his memory back. As Peter goes to face both villains, Harry is told the truth about his father and decides to help Spider-Man. The final battle comes down to Harry and Spider-Man against Venom and Sandman. Who will win?\n\nThanks for downloading\n\nSEED PLEASE\n","torrent":{"xt":"urn:btih:898b0e77fa6ac654b7f4df0ae584829fed6306d9","amp;dn":"Spider-Man+3+2007+DVDRIP+by+HaseoLove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898b0e77fa6ac654b7f4df0ae584829fed6306d9","infoHashBuffer":{"type":"Buffer","data":[137,139,14,119,250,106,198,84,183,244,223,10,229,132,130,159,237,99,6,217]},"announce":[],"urlList":[]}}