{"title":"Soviet Union - A Short Introduction","uid":6698450,"size":1849580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89ce84926f00f0ce7fbcc69706963d5e9bbbd085&amp;dn=Soviet+Union+-+A+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1316869552,"description":"The Soviet Union at its height occupied one sixth of the world's land mass, encompassed fifteen republics, and stretched across eleven different time zones. More than twice the size of the United States, it was the great threat of the Cold War until it suddenly collapsed in 1991. Now, almost twenty years after the dissolution of this vast empire, what are we to make of its existence? Was it a heroic experiment, an unmitigated disaster, or a viable if flawed response to the modern world? Taking a fresh approach to the study of the Soviet Union, this Very Short Introduction blends political history with an investigation into Soviet society and culture from 1917 to 1991. Stephen Lovell examines aspects of patriotism, political violence, poverty, and ideology, and provides answers to some of the big questions about the Soviet experience. Throughout, the book takes a refreshing thematic approach to the history of the Soviet Union and it provides an up-to-date consideration of the Soviet Union's impact and what we have learnt since its end.\n\n144 pages\nPublisher: Oxford University Press, USA; 1 edition (September 1, 2009)\nLanguage: English \n\n\nEnjoy and Seed!!\n\n\n\n\nPS. did you hear..? someone broke into the Kremlin and stole next year's elections results... ","torrent":{"xt":"urn:btih:89ce84926f00f0ce7fbcc69706963d5e9bbbd085","amp;dn":"Soviet+Union+-+A+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ce84926f00f0ce7fbcc69706963d5e9bbbd085","infoHashBuffer":{"type":"Buffer","data":[137,206,132,146,111,0,240,206,127,188,198,151,6,150,61,94,155,187,208,133]},"announce":[],"urlList":[]}}