{"title":"FPS Creator (Complete)","uid":4071885,"size":781052431,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8b894be00058c6a5c77a5e0e98f40e8470456e3c&amp;dn=FPS+Creator+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TKCMullahOmar","files":1,"time":1205091740,"description":"Design your own first person shooter games\nNo coding required!\n\nCreate your game instantly with the intuitive 3D editor. Drag and drop walls, lights, doors, enemies, ammo, weapons and more - with pixel perfect precision, and watch as they intelligently link together. Then with one click of the mouse, play your game!\n\nBuild FPS games with ease\n\nWe\\&amp;#039;re quite rightly very proud of the game building environment we have created for you. Gone is the tedious task of hollowing out cubes just to make a room, or having to know a programming language inside out. Our fully graphical Windows based editor allows you to literally paint your maps with pixel perfect 3D precision and create great looking scenes like these in a matter of minutes:\n\nAnd when you\\&amp;#039;ve got things placed where you want them you can drop in weapons, enemies, objectives, trigger zones, customise the loading screens, create your own AI scripts, draw some waypoint paths, set-up some gorgeous lighting effects and then a single click of the mouse will turn it all into an EXE file you can pass to your friends.\n\nFPS Creator in action : Video\n\nIf the trial version download is too large then you can check out a video we made of the map building capabilities of FPS Creator back in October 2004. Things have changed a lot since then visually, but the core ease-of-use still applies. The video is 7 minutes in length, is a 15.7 MB download and is in Windows Media format (WMV). You can grab it here: http://files.thegamecreators.com/fpscreator/FPSCreator_Walkthru_Oct2004.zip.\nHundreds of 3D Objects\n\nTo get you started we\\&amp;#039;ve supplied two theme packs covering popular FPS genres: Sci-fi and World War 2. From high-tech labs and ammo holds to gritty caves and classic German manor houses - we\\&amp;#039;ve included all you need. Doors, corridors, gantries, ladders, lifts, room segments, ceilings, furniture, objects, ammo crates and more. Infact there are over 500 different 3D entities and over 300 building segments. If that isn\\&amp;#039;t enough you can easily customise the included files or import your own media, it\\&amp;#039;s all covered in the 89 page manual.\nNo programming?\n\nFPS Creator uses custom scripts for every element of the game. From the enemy AI behaviours, to the ways a key might open a door. We tried our best to ensure that nearly everything was controlled via a script rather than hard coded into the program.\n\n\nThis means for those that wish to get their hands dirty then can open up the script files into any text editor and re-code them. Although it\\&amp;#039;s perfectly possible to create a large and complex game without entering a single line of code, the option is there if you want that extra level of control. The scripting language is a simple state based system, no C++ required.\n\n &lt;a href=&quot;\nhttp://www.fpscreator.com/gfx/trial.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fpscreator.com/gfx/trial.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://soapbox.msn.com/video.aspx?showPlaylist=true&amp;playlist=videoByUuids:uuids:4190cd5c-abdb-4699-9177-675137fc271f&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://soapbox.msn.com/video.aspx?showPlaylist=true&amp;playlist=videoByUuids:uuids:4190cd5c-abdb-4699-9177-675137fc271f&lt;/a&gt;\n &lt;a href=&quot;\nhttp://soapbox.msn.com/video.aspx?showPlaylist=true&amp;playlist=videoByUuids:uuids:5489ae55-5484-4a8f-acb9-8c9228bb43d1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://soapbox.msn.com/video.aspx?showPlaylist=true&amp;playlist=videoByUuids:uuids:5489ae55-5484-4a8f-acb9-8c9228bb43d1&lt;/a&gt;\n\n(At The Time I Got This It Was All The Files) (Some Newer packs Might be Missing)","torrent":{"xt":"urn:btih:8b894be00058c6a5c77a5e0e98f40e8470456e3c","amp;dn":"FPS+Creator+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b894be00058c6a5c77a5e0e98f40e8470456e3c","infoHashBuffer":{"type":"Buffer","data":[139,137,75,224,0,88,198,165,199,122,94,14,152,244,14,132,112,69,110,60]},"announce":[],"urlList":[]}}