{"title":"The Hit 1984 DVDRip Sonata Premiere","uid":9781449,"size":729940197,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ba07b61f39c361e2b9a92d69bac3902d0ceda76&amp;dn=The+Hit+1984+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1395104487,"description":"In this offbeat crime film, Willie Parker (Terence Stamp) an English mobster turned informant, has been given a new identity and has been living in a small, isolated village in Spain for 10 years. Unfortunately for Parker, the men he has betrayed have ascertained his whereabouts and send Braddock (John Hurt), a professional hitman, and his apprentice Myron (Tim Roth) to bring Parker to Paris where his ex-associates await. After kidnapping Parker, nothing goes as planned. Now they are followed by a Spanish policeman (Fernando Rey) who seems to anticipate each of their moves, and they are burdened by Maggie (Laura del Sol), the mistress of a fellow mobster they were forced to kill. What should have been a routine hit becomes a psychological battle between all the participants as Parker, in a fight for time and for his life, plays one against the other. Set against the bleak Spanish landscape and featuring evocative and memorable theme music, the film builds to a surprising conclusion where the true nature of all the characters is revealed. Terence Stamp develops the character of Parker in a subtle but surprisingly comic performance and Laura del Sol shines as a woman who will do what is necessary to survive. Tim Roth, in his film debut, plays a brutal, but oddly endearing thug. But it is John Hurt, in a sensitive and nuanced performance, who brings a perceptive intelligence and depth to his role which adds a philosophical and psychological dimension to the film. Hurt plays his difficult role without a misstep and with a rare economy of action. Thoughtful and frequently amusing, The Hit, superbly written by Peter Prince, is both a compelling and suspenseful crime drama and also a deep and profound meditation on life, death and courage.","torrent":{"xt":"urn:btih:8ba07b61f39c361e2b9a92d69bac3902d0ceda76","amp;dn":"The+Hit+1984+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba07b61f39c361e2b9a92d69bac3902d0ceda76","infoHashBuffer":{"type":"Buffer","data":[139,160,123,97,243,156,54,30,43,154,146,214,155,172,57,2,208,206,218,118]},"announce":[],"urlList":[]}}