{"title":"Beyonce - Deja Vu","uid":5151440,"size":145571844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c5bffbe0a95412232d62f3a3321c65a1d3efac5&amp;dn=Beyonce+-+Deja+Vu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1257585780,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n&quot;DÃƒÂ©jÃƒÂ  Vu&quot; is a song by American R&amp;B singer-songwriter BeyoncÃƒÂ© Knowles, featuring rapper artist Jay-Z. It was produced by Rodney &quot;Darkchild&quot; Jerkins and Knowles for her second solo album, B'Day. The song combines contemporary R&amp;B and '70s funk and its varied instrumentation includes bass guitar, hi-hat, horns, and the Roland TR-808 drum machine. The song's title and lyrics refer to a woman being constantly reminded of a past lover.\n\nThe song was released as the album's lead single in July 2006. Although it was recognized as &quot;Best Song&quot; at the 2006 Music Of Black Origin (MOBO) Awards, &quot;DÃƒÂ©jÃƒÂ  Vu&quot; received mixed reviews from critics. The single entered the top ten on most charts, topping several of Billboard magazine's component charts and reaching number one in the United Kingdom. The single's music video displeased fans, thousands of whom petitioned for it to be re-shot, citing its sexual theme and Knowles' wardrobes, among other reasons.\n\nThe press deemed the themes between Knowles and Jay-Z' interactions are sexually suggestive. A petition by fans objected to &quot;unacceptable interactions&quot; between Knowles and Jay-Z in the music video.\n\nThe music video for &quot;DÃƒÂ©jÃƒÂ  Vu&quot; was filmed by British director Sophie Muller in New Orleans, Louisiana on June 21, 2006, with parts of the video shot at the Maple Leaf Bar in Carrollton, Louisiana. The footage features couture-inspired outfits, vigorous footwork and sexually-themed routines. &quot;DÃƒÂ©jÃƒÂ  Vu&quot; simultaneously premiered on July 12, 2006 on MTV's show Total Request Live (TRL), and Overdrive, MTV's broadband video channel. The music video reached the top spot on the TRL's countdown. It also topped the UK TV airplay chart in late July 2006. The music video was awarded Best Video at the 2006 MOBO Awards.\n\nReactions to the video were mixed. Sal Cinquemani of Slant Magazine commented it is &quot;more thematic and thought provoking than the videos for 'Baby Boy' and 'Naughty Girl'&quot;, Knowles' songs from her debut album, Dangerously in Love. Allhiphop.com's Eb Haynes described the video &quot;visually fresh&quot; and &quot;couture motivated&quot;. A group of more than 2,000 of Knowles' fans petitioned for a re-shoot of the video, complaining of &quot;a lack of theme, dizzying editing, over-the-top wardrobe choices&quot; and the sexual theme depicted in the video, considering some scenes &quot;'unacceptable interactions' [between Knowles and Jay-Z]&quot;. The petition characterized Knowles' dance moves as &quot;erratic, confusing and alarming at times&quot;. A news article published by Hindustan Times reported that a particular scene in the video is suggestive of oral sex. Natalie Y. Moore of In These Times magazine echoed the latter's commentary, writing that the video showcases Knowles &quot;strutting her sexuality&quot;, and that in Jay-Z's scenes it &quot;looks as if any minute now she'll give him fellatio&quot;.\n\nSome lyrics in this video are censored.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:8c5bffbe0a95412232d62f3a3321c65a1d3efac5","amp;dn":"Beyonce+-+Deja+Vu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c5bffbe0a95412232d62f3a3321c65a1d3efac5","infoHashBuffer":{"type":"Buffer","data":[140,91,255,190,10,149,65,34,50,214,47,58,51,33,198,90,29,62,250,197]},"announce":[],"urlList":[]}}