{"title":"Me llamo Earl Temporada 1 Castellano","uid":7040209,"size":4065466368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d5def425cc64a16c1f8c92977e9b1055cc53cec&amp;dn=Me+llamo+Earl+Temporada+1+Castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nenetro","files":19,"time":1329512164,"description":"Argumento:\nLa serie ofrece un irÃƒÂ³nico y atrevido punto de vista sobre la vida y sus convencionalismos.\nA pesar de la aparente falta de inteligencia del protagonista, Earl es tremendamente efectivo en su nuevo objetivo de vida: limpiar su karma. Es precisamente este objetivo, encontrar el karma, lo que impulsa a Earl a corregir todas las malas acciones que en algÃƒÂºn momento de su vida hizo a la que gente que tenÃƒÂ­a alrededor.\nLa vida de Earl (Jason Lee) siempre ha estado teÃƒÂ±ida por la desgracia. Su mujer le engaÃƒÂ±a, ninguno de sus hijos es suyo y vive con su hermano que es tan poco agraciado como ÃƒÂ©l. Los innumerables altibajos por los que atraviesa lo han llevado a elegir caminos equivocados, sin embargo, un golpe de suerte al encontrar un billete de loterÃƒÂ­a premiado produce cambios inquietantes.\nUno de estos cambios es cuando Earl ve de casualidad un programa nocturno de televisiÃƒÂ³n llamado &quot;Last Call with Carson Daly&quot;, donde el presentador asegura que su gran ÃƒÂ©xito es un resultado directo de hacer buenas acciones para ayudar a la gente. Este hecho es lo que impulsa a Earl a intentar conseguir una vida mejor.\nSu labor de enmienda comienza con la redacciÃƒÂ³n de una lista de todos los delitos que ha cometido, pero serÃƒÂ¡ difÃƒÂ­cil saber por dÃƒÂ³nde empezar. En esta ardua tarea de rectificaciÃƒÂ³n se encuentran junto a Earl un pequeÃƒÂ±o grupo de amigos: su hermano Randy (Ethan Suplee), la sexy Catalina (Nadine Velazquez) y Even Darnell (Eddie Steeples), el propietario del Crab Shack donde Earl bebe cerveza. Sin embargo, su ex mujer, Joy (Jamie Pressly), no moverÃƒÂ¡ un dedo para ayudarle a no ser que exista algo que obtener a cambio. \n\nDBV-RIP: 640x480\nDUAL: InglÃƒÂ©s / Castellano","torrent":{"xt":"urn:btih:8d5def425cc64a16c1f8c92977e9b1055cc53cec","amp;dn":"Me+llamo+Earl+Temporada+1+Castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d5def425cc64a16c1f8c92977e9b1055cc53cec","infoHashBuffer":{"type":"Buffer","data":[141,93,239,66,92,198,74,22,193,248,201,41,119,233,177,5,92,197,60,236]},"announce":[],"urlList":[]}}