{"title":"Handbook of Molecularly Imprinted Polymers","uid":14850765,"size":82480514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e02ff3d38455066f89c3da0f6aafcf3a28c402f&amp;dn=Handbook+of+Molecularly+Imprinted+Polymers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465436505,"description":"Handbook of Molecularly Imprinted Polymers - Carmen Alvarez-Lorenzo and Angel Concheiro (Smithers Rapra, 2013).pdf\r\n\r\nISBN 978-1-84735-959-9\r\n\r\nMolecular imprinting technology has become a relevant tool for the synthesis of polymeric materials with the unique feature of being able to recognise specific target molecules and to bind them preferably among many others. Such an outstanding property makes molecularly imprinted polymer(s) (MIP) well suited for a wide range of applications in fields as diverse as analytical techniques, bioremediation, catalysis or drug delivery. Information regarding MIP has exponentially increased in recent years, being collected in a large variety of scientific journals, monographs and proceedings. The aim of this Handbook is to provide an overview of the state of the art of MIP by organising the information in an educational and practical way, with useful guidelines for newcomers to the field regarding monomer selection, polymerisation conditions and MIP conditioning for each given purpose. This is accompanied by updated knowledge from papers published over the past few years that may be of interest for senior researchers in the field. An analysis of the historical evolution of MIP, and of their future perspectives and trends is also offered. The Handbook has been structured in eight chapters written by distinguished experts in the various areas of MIP application. Using a direct language, graduate students and novel researchers may find, within these chapters, friendly pathways to enter the world of molecular imprinting. Trained professionals can also take benefit from the critical review of recent advances on the implementation of alternative approaches to prepare and use MIP, in order to optimise their performance in already established fields, but also to open novel fields of application","torrent":{"xt":"urn:btih:8e02ff3d38455066f89c3da0f6aafcf3a28c402f","amp;dn":"Handbook+of+Molecularly+Imprinted+Polymers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e02ff3d38455066f89c3da0f6aafcf3a28c402f","infoHashBuffer":{"type":"Buffer","data":[142,2,255,61,56,69,80,102,248,156,61,160,246,170,252,243,162,140,64,47]},"announce":[],"urlList":[]}}