{"title":"James Alison - Faith Beyond Resentment (pdf)","uid":8949200,"size":2905722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e2369bc9993afa7d47750adebf43f8b58bd4b68&amp;dn=James+Alison+-+Faith+Beyond+Resentment+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1379845637,"description":"James Alison - Faith Beyond Resentment: Fragments Catholic and Gay (Crossroad, 2001). 239 pages.\n\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nA stunningly original re-imagining of the Catholic faith by one of the most lucid and exciting theologians writing in English today. Widely acclaimed for his work examining the fundamental themes in Catholic theology, in Faith Beyond Resentment James Alison offers an account of Christianity that is moving, liberating, and deeply personal, yet rooted in Catholic tradition.\n\nThis is not a book of gay theology but, much more daringly, of catholic theology from a gay perspective, addressing both those who are not gay and those who are not Catholic, 'people of whatever background negotiating the world of faith in the time of the collapsing closet.'\n\n'Like all James Alison's books, Faith Beyond Resentment is almost frighteningly profound. Alison, as he tells us a girardian must, reads texts. Not just any texts, but the texts of Scripture. Alison's readings train us to undertake the slow and painful work of living free of resentment. So taught we discover how debates about &quot;homosexuality&quot; can be repositioned from the stance of &quot;us&quot; versus &quot;them&quot; to &quot;us&quot; versus &quot;us&quot;. So positioned we may even learn to accept the salvation that is our in Christ.' -- Stanley Hauerwas","torrent":{"xt":"urn:btih:8e2369bc9993afa7d47750adebf43f8b58bd4b68","amp;dn":"James+Alison+-+Faith+Beyond+Resentment+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2369bc9993afa7d47750adebf43f8b58bd4b68","infoHashBuffer":{"type":"Buffer","data":[142,35,105,188,153,147,175,167,212,119,80,173,235,244,63,139,88,189,75,104]},"announce":[],"urlList":[]}}