{"title":"Private XXX, Vol. #18 - Wet Dreams (2004) - Tiffany Hopkins,Meli","uid":4611278,"size":734209273,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8e52170df6b9899efa51cc2765b0d2f63c54abdd&amp;dn=Private+XXX%2C+Vol.+%2318+-+Wet+Dreams+%282004%29+-+Tiffany+Hopkins%2CMeli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pure_screens","files":4,"time":1230646616,"description":"Private XXX, Vol. #18\n\n\n\n\n\nDVD-covers + 7 screens:\n &lt;a href=&quot;\nhttp://the.blogbugs.org/4507836/Private-XXX-18---7-screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://the.blogbugs.org/4507836/Private-XXX-18---7-screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nActresses\n\n    * Angelique Morreau [Facial]\n    * Claudia Rossi [Anal Facial DP]\n    * Gloria Gucci [Facial]\n    * Lea De Mae [Anal Facial DVDOnly]\n    * Liz Honey\n    * Lucy Lee [Anal Facial]\n    * Melissa Black [Anal Facial DP]\n    * Nicoletta Blue [Anal Facial Bald]\n    * Tiffany Hopkins [Anal Facial DP]\n    * Vera [Anal CumSwap]\n    * Vivien L. [Anal Facial]\n\nActors\n\n    * Andrea Moranty\n    * Denis Marti\n    * Frank Gun\n    * Horst Baron\n    * Ian Scott\n    * J. J.\n    * Jon Axe (as Jon)\n    * Ricky\n    * Toni Ribas\n    * William\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Angelique Morreau, Gloria Gucci, Horst Baron, J. J., Nicoletta Blue\n    * Scene 2. Liz Honey, Ricky, Vera\n    * Scene 3. Andrea Moranty, Claudia Rossi, Toni Ribas, Vivien L.\n    * Scene 4. Frank Gun, Jon Axe, Melissa Black\n    * Scene 5. Ian Scott, Tiffany Hopkins, William\n    * Scene 6. Andrea Moranty, Lucy Lee\n    * Scene 7. Denis Marti, Lea De Mae\n\n\n\nREVIEW:\n\n\nOne of the porn industries leaders in all sorts of heated sex scenes is undoubtedly Private, the foreign based company that has moved from print to motion pictures better than any other in many people's opinions. Their latest set of scenes in a non-compilation release is Private XXX 18: Wet Dreams, another in their revived series that takes a number of minor scenes and throws them together in order to give fans a nice sample of what the company has to offer. While not the best the company has to offer, there was some good footage here so check out the scene breakdowns if you're still interested:\n\n\n\nScene One: Orgy of Decadence: \nD-Andrea Di Angelo: 7/2004: Angelique, Gloria Gucci, and Nicoletta Blue, started off the fun in a sort of sex club where they enjoyed the attentions of one another as well as Horst Baron and JJ; a couple of reasonably talented meat puppets. The cast used toys and the gals wore fetish outfits (PVC) to enhance their looks as they sucked and fucked one another with abandon. My biggest issue with this widescreen presented bit of fluff was that the gals seemed far too ready to pose for the camera when they noticed it hovering on them. The slow motion effects got in my way of having fun too. Sexually though, there was oral, vaginal, lesbian, and anal, all with taste testing for those inclined to want to know the details with the ending a gooey, facial mess.\n\n\nScene Two: Taking Dicktation: \nD-Frank Thring: 7/2004: Liz Honey and Vera, each playing administrative assistants (secretaries) in fine form, gave their boss, Ricky, an incentive to come to work. He played with them and they cleaned his pipes in all sorts of ways by the desk and on the stairs of the small office. The gals gave good head and did some fine anal before the pop shot took care of the full framed scene. It wasn't a great bit of action but I like seeing these two gals in action so it was well worth my time.\n\n\nScene Three: Raw Sex: \nD-Xavi Dominguez: 5/2004: Claudia Rossi, Vivien, Andrea Moranti, and Toni Ribas were up next in a bit of an orgy scene that started off like an old fashioned black &amp; white release (before sound). It quickly reverted to a standardized porn scene from Private but the cast looked to be having fun throughout the scene. The oral was especially good and the vaginal pretty heated with some okay anal for those into it. The gals didn't pose as much here in this widescreen scene but the camera angles were not particularly complimentary to them either. DP's, ATM, PTM and all the trimmings were present in this scene that would've been better if more time were spent on it.\n\n\nScene Four: Babe in the Wood: \nD-Frank Thring: 7/2004: Melissa Black, a cute bleached blonde enjoying a bit of loving by studly Frank Gun in a public park, gave him some great oral as he relished the idea of getting caught. Jon and Ricky joined them after walking up on the couple in the wildness area they were in and she seemed to like the idea as much as Frank when they asked to join in. The sex included a DP but it was the oral on one guy while getting anally tapped by another that really worked best here. They finished up with a lot of splooge to her lovely face in this widescreen ratio scene.\n\n\nScene Five: Fresh Bodywork: \nD-Marc Lelong: 9/2004: Tiffany Hopkins, a hot brunette wearing little more than her jewelry and high heels, came to a garage operated by Ian Scott and William who used their pressure washer to clean her good. I can't describe just how good she looked as the water and suds hit her fine ass and she seemed lost in the moment when she blew them and took turns with them boning her precious holes. I didn't like the angle of the DP here and the double facial stuff could've been better but she had a good amount of energy to spare so the scene was well done (in full frame no less).\n\n\nScene Six: Runaway Bandits: \nD-Little Al: 8/2004: Lucy Lee, a very lean brunette, was handcuffed to Andrea Moranti as the two escaped a couple of mean looking men in the wilderness. She rewarded her partner's efforts by blowing him in an open field while he played with her slightly curvy ass after they freed themselves from their shackles. He then started boning her ass with deep thrusts that she met him with stroke for stroke. Yeah, it was full frame and it was kind of weak at times but when it was hitting on all cylinders, it was a lot of fun.\n\n\nBonus Scene: D-Little Al: 5/2003: Lea De Mae, the super hotty blonde with a near perfect body, and studly Denis Marti, had this scene in a large indoor swimming pool. I didn't like the artistic effects or the music track but she looked as fine as I've ever seen her and the action was very passionate. From the oral to the anal and facial, it was a winner!\n\n\nSummary: \nPrivate XXX 18: Wet Dreams was worth a rating of at least Rent It or maybe more if you like the cast. The scenes were a hodge podge of good, bad, and indifferent but I'd be lying if I said the overall quality on the technical aspects wasn't usually pretty good. For the most part, the scenes never quite lived up to their potential but you'll have some nice stroke material here if you give it a chance.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:8e52170df6b9899efa51cc2765b0d2f63c54abdd","amp;dn":"Private+XXX%2C+Vol.+%2318+-+Wet+Dreams+%282004%29+-+Tiffany+Hopkins%2CMeli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e52170df6b9899efa51cc2765b0d2f63c54abdd","infoHashBuffer":{"type":"Buffer","data":[142,82,23,13,246,185,137,158,250,81,204,39,101,176,210,246,60,84,171,221]},"announce":[],"urlList":[]}}