{"title":"Track, Match, Blend DVD","uid":10947791,"size":5930357960,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8e807cb0e9256ebfb7485cf0e5130b0f21bfe2a1&amp;dn=Track%2C+Match%2C+Blend+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eaglefl","files":-1,"time":1409608059,"description":"Quality:         720p\nTotal Length:    8 hours\nFiles:           24\n\nTrailer:        \nExample Chapter:\n\nVFX Basics: Camera-Tracking and Matchmoving in Blender\n\nOne of Blender's strengths is the tight integration of Modelling, Rendering and Compositing. Since Blender 2.61 this integration has become even tighter with the arrival of the new camera tracking module, the MovieClipEditor. Importing footage, tracking and solving the camera-motion, rendering and compositing can now all be done in one smooth workflow, all inside Blender.\n\n This DVD will help you to get started with this powerful new tool, which opens up a whole new area for visual effects work in Blender. We will cover everything from simple 2D-Tracking, image stabilization and setting up a classic 4-corner-pin-shot to advanced camera- and object-tracking, including face-deformation and marker-removal.\n\nYou will learn how to use the interface of Blender's matchmoving module, the MovieClipEditor, how to add and control markers and get smooth and stable tracks. A special focus will be given to the placement of markers for matchmoving, because not every track gives you the information you need to get a decent camera solution. There are several chapters that discuss different types of shots and how to attack them.\n\nOf course just having a finished track is not always that exciting, so the DVD takes care about explaining the compositing part as well. It covers renderlayers and renderpasses with Blender Internal as well as rendering and compositing with the new renderengine Cycles. Apart from integrating passes and layers we will also have a look at marker-removal techniques, keying and UV-projection-mapping to generate clean-plates.\n\nThis training requires a little bit of Blender knowledge, but there is a Blender Quickstart tutorial on it too, so that non-Blender-users who just want to take advantage of the tracking module can easily find their way through Blender's interface. Exporting the tracking data to other applications will be shown as well.\n\nThis DVD is using Blender 2.62. Project Mango will add a lot of functionality to the whole tracking and compositing pipeline, so there will most likely be a follow up to this training DVD focusing more on the new features and advanced matchmoving and compositing techniques.","torrent":{"xt":"urn:btih:8e807cb0e9256ebfb7485cf0e5130b0f21bfe2a1","amp;dn":"Track%2C+Match%2C+Blend+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e807cb0e9256ebfb7485cf0e5130b0f21bfe2a1","infoHashBuffer":{"type":"Buffer","data":[142,128,124,176,233,37,110,191,183,72,92,240,229,19,11,15,33,191,226,161]},"announce":[],"urlList":[]}}