{"title":"Barbieri_Maggie-Murder_101.epub","uid":9220299,"size":283026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e90f3e2163f67c801e97d85835f0fb6b5052d83&amp;dn=Barbieri_Maggie-Murder_101.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384923028,"description":"Safely away from the chaos of Manhattan, St. Thomas, a small college on the banks of the Hudson River in the Bronx, is supposed to be tranquil, bucolic, and serene. Unfortunately, English professor Alison Bergeron has found it to be anything but. Recently divorced from a fellow professor and even more recently without a car---it was stolen---she has been hoofing it to school. One Friday evening, two NYPD homicide detectives drop by her office. The good news is that they found her beat-up Volvo; the bad news is that the body of one of the students in her Shakespeare seminar was in the trunk.\n Not only are Alison's chances of getting the car back bleak, but suddenly she's the primary suspect on a list that includes, among others, the murdered student's drug-dealing boyfriend, Vince, and the girl's father's business rivals (he's head of an old Italian family . . .).\n Accused of a crime that she didn't commit, Alison enlists her best friend, Max's, emotional support and services as an amateur sleuth. Their fumbling efforts to clear Alison's name could land her in even hotter water with Detective Bobby Crawford, the handsome investigating officer (and former altar boy)---not to mention the nuns at St. Thomas. . . .\n Maggie Barbieri's charming professor and down-to-earth detective make an unlikely but lovable team in her delightful debut mystery.","torrent":{"xt":"urn:btih:8e90f3e2163f67c801e97d85835f0fb6b5052d83","amp;dn":"Barbieri_Maggie-Murder_101.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e90f3e2163f67c801e97d85835f0fb6b5052d83","infoHashBuffer":{"type":"Buffer","data":[142,144,243,226,22,63,103,200,1,233,125,133,131,95,15,182,181,5,45,131]},"announce":[],"urlList":[]}}