{"title":"CKY Boxset","uid":6440402,"size":3286646784,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e91b3d031907380bea110ffe696f739c44377d6&amp;dn=CKY+Boxset&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"v3ga","files":5,"time":1306961459,"description":"The CKY video series is a series of videos produced by Bam Margera and Brandon DiCamillo and other residents of West Chester, Pennsylvania. Four videos have been released to date, Landspeed presents: CKY (later called CKY), CKY2K, CKY 3, and CKY4: The Latest &amp; Greatest. There is also a CKY &quot;documentary&quot; DVD, which is a supplemental item in the hard-to-find CKY &quot;Box Set,&quot; as well as two &quot;CKY Trilogy&quot; sets, both of which are compilation DVDs featuring scenes from the previous CKY DVDs. The videos were named after Bam Margera's brother Jess Margera and his band CKY (with Deron Miller and Chad Ginsburg). &quot;CKY&quot; stands for &quot;Camp Kill Yourself\n\nThe videos feature Bam Margera, Brandon DiCamillo, their friends and Bam's relatives in various stunts and pranks, interspersed with skating footage of Bam and other pros.[2] A trademark of the skating footage was to show unsuccessful trick attempts immediately followed by the same skater pulling the trick off. CKY started when Bam and his friends were in the same Graphics Arts class at East High School in West Chester, Pennsylvania. Instead of attending class, they would go out in a field and film skits. Eventually, they had so much footage of themselves, they decided to compile it into a video.","torrent":{"xt":"urn:btih:8e91b3d031907380bea110ffe696f739c44377d6","amp;dn":"CKY+Boxset","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e91b3d031907380bea110ffe696f739c44377d6","infoHashBuffer":{"type":"Buffer","data":[142,145,179,208,49,144,115,128,190,161,16,255,230,150,247,57,196,67,119,214]},"announce":[],"urlList":[]}}