{"title":"Bad Religion - Discography (1982-2010) [24 bit FLAC] [vinyl]","uid":8050377,"size":12800251558,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ec09162c83fe484a2a59594cf8a4e4ed677450a&amp;dn=Bad+Religion+-+Discography+%281982-2010%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1358845666,"description":"  Bad Religion - Discography (1982-2010) [24 bit FLAC] [vinyl]\n\n  Genre: Pop/Rock\n  Style: Punk\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbs\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n  \n  Albums:\n\n  1982 - How Could Hell Be Any Worse\n  1983 - Into the Unknown\n  1988 - Suffer\n  1989 - No Control\n  1990 - Against the Grain\n  1992 - Generator\n  1993 - Recipe for Hate\n  1994 - Stranger Than Fiction\n  1996 - The Gray Race\n  1998 - No Substance \n  2000 - The New America\n  2002 - The Process of Belief\n  2004 - The Empire Strikes First \n  2007 - New Maps of Hell\n  2010 - The Dissent of Man\n\n  Out of all of the Southern Californian hardcore punk bands of the early '80s, Bad Religion stayed around the longest. For over a decade, they retained their underground credibility without turning out a series of indistinguishable records that all sound the same. Instead, the band refined their attack, adding inflections of psychedelia, heavy metal, and hard rock along the way, as well as a considerable dose of melody. Between their 1982 debut and their first major-label record, 1993's Recipe for Hate, Bad Religion stayed vital in the hardcore community by tightening their musical execution and keeping their lyrics complex and righteously angry.\n  \n  Bad Religion formed in the northern suburbs of Los Angeles in 1980, comprising guitarist Brett Gurewitz, vocalist Greg Graffin, bassist Jay Bentley, and drummer Jay Ziskrout. Gurewitz established his own record company, Epitaph, to release the band's records. Between their self-titled EP and their first full-length record, Pete Finestone replaced Ziskrout as the group's drummer. How Could Hell Be Any Worse?, their debut album, was released in 1983 and gained them some attention on the national U.S. hardcore scene. After its release, the group's lineup changed, as bassist Paul Dedona and drummer Davy Goldman joined the group.\n\n  In the meantime, the band's lineup was undergoing some more shakeups. Gurewitz had to take 1984 off to recover from various substance abuse problems, leaving Graffin as the band's only original member. In addition to Graffin, the 1984 incarnation of the band featured former Circle Jerks guitarist Greg Hetson, bassist Tim Gallegos, and returning drummer Pete Finestone. Bad Religion's next release, the harder, punkier Back to the Known EP restored faith among the group's devoted fans. After its release, the group went on hiatus for three years.\n\n  When Bad Religion returned in 1987, the band featured Gurewitz, Graffin, Ziskrout, Hetson, and Finestone. They released Suffer the following year, a record that re-established the group as prominent players in the U.S. underground punk/hardcore scene. They followed with No Control (1989) and Against the Grain (1990). By the time of their 1993 album, Recipe for Hate, alternative rock had become popular with the mainstream; in addition, the band's following was quite large. These two factors contributed to Bad Religion signing a major-label contract with Atlantic Records.\n\n\n","torrent":{"xt":"urn:btih:8ec09162c83fe484a2a59594cf8a4e4ed677450a","amp;dn":"Bad+Religion+-+Discography+%281982-2010%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ec09162c83fe484a2a59594cf8a4e4ed677450a","infoHashBuffer":{"type":"Buffer","data":[142,192,145,98,200,63,228,132,162,165,149,148,207,138,78,78,214,119,69,10]},"announce":[],"urlList":[]}}