{"title":"The Jimi Hendrix Experience - BBC Sessions","uid":7112400,"size":739053591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8edc63fae4a2e6fc4bb98ea35dfdddfb03ab326e&amp;dn=The+Jimi+Hendrix+Experience+-+BBC+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Frankzor5","files":37,"time":1332108283,"description":"BBC Sessions is an album of recordings by the rock group The Jimi Hendrix Experience, released on MCA Records on June 2, 1998. It contains all the surviving tracks from their various appearances on BBC radio programmes, such as Saturday Club and Top Gear, recorded in 1967. At a BBC radio 'session', a practice still alive in British radio today, a band is required to record material in a studio quickly, with limited overdubbing, largely limited to and relying upon their live sound. Many groups as part of this tradition choosing to record some songs that are not part of their main repertoire. The album also includes the only two surviving Hendrix UK TV soundtracks (both BBC) Late Night Line Up (&quot;Manic Depression&quot; only survives) and the 1969 Lulu Show (complete).\n\nBBC Sessions therefore offers its own unique example of the Experience sound, and a revealing glimpse of a song from their early repertoire Howlin' Wolf's &quot;Killing Floor&quot; and their only known studio recording of Bob Dylan's &quot;Can You Please Crawl Out Your Window?&quot;.\n\nApart from the &quot;live&quot; in studio versions of well-known Experience songs, there are several unique studio recordings of songs, i.e. &quot;Driving South&quot; (x3), &quot;Hoochie Coochie Man&quot;, &quot;Catfish Blues&quot;, &quot;Hound Dog&quot;, &quot;Hear My Train a Comin'&quot;(x2) and a couple of novelty tracks: the amusing parody of a BBC Radio 1 jingle &quot;Radio One&quot;, and a recording with a young Stevie Wonder on drums (a cover of Wonder's own &quot;I Was Made to Love Her&quot;). It also includes the sound track from the band's infamous appearance on Lulu's television show in 1969.\n\nThe Top of the Pops references were overdubbed by Brian Mathews onto Top Gear recordings for the BBC produced Swedish (English language) radio show of the same name. The original recordings minus Brian no longer exist.\n\nThis collection has been re-released as part of the Hendrix Family's project to remaster Jimi's discography.\n\n\n-------------------------------------------\n\n\nFlawlessly ripped from the original CDs, with the best possible quality. Everything tagged and in order.\n\nAny questions, comments, or suggestions can be posted here. I'll reply ASAP.","torrent":{"xt":"urn:btih:8edc63fae4a2e6fc4bb98ea35dfdddfb03ab326e","amp;dn":"The+Jimi+Hendrix+Experience+-+BBC+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8edc63fae4a2e6fc4bb98ea35dfdddfb03ab326e","infoHashBuffer":{"type":"Buffer","data":[142,220,99,250,228,162,230,252,75,185,142,163,93,253,221,251,3,171,50,110]},"announce":[],"urlList":[]}}