{"title":"George Lewis - 1996 - Walking With the King (1954-55) FLAC","uid":8969675,"size":389834662,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f7b1e64159681e15ade010fcbcbc87e7704cd25&amp;dn=George+Lewis+-+1996+-+Walking+With+the+King+%281954-55%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1380311621,"description":"George Lewis - 1996 - Walking With the King (1954-55)\n\nGeorge Lewis never tried to be a virtuoso soloist. He loved to play melodic ensembles where his distinctive clarinet was free to improvise as simply as he desired. When Lewis was inspired and in tune, he could hold his own with any of his contemporaries in New Orleans and he always sounded beautiful playing his &quot;Burgundy Street Blues.&quot; To everyone's surprise (including himself), he became one of the most popular figures of the New Orleans revival movement of the 1950s.\nIt took Lewis a long time to achieve fame. He taught himself clarinet when he was 18 and worked in the '20s with the Black Eagle Band, Buddy Petit, the Eureka Brass Band, Chris Kelly, Kid Ory, the Olympia Orchestra, and other New Orleans groups. He played with Bunk Johnson in Evan Thomas' group in the early '30s but had a day job throughout most of the decade. When Bunk was discovered in 1942, Lewis became part of his band, playing with him Johnson, however, was difficult to get along with and a homesick Lewis returned to New Orleans by 1946. He played locally with his own group (featuring trombonist Jim Robinson) and in 1950 was portrayed in an article for Look. That exposure led to him recording regularly, and by 1952, Lewis was in such great demand that he was soon working before crowds in California and touring Europe and Japan. In addition to Robinson, Lewis' band in its prime years often featured trumpeter Kid Howard, pianist Alton Purnell, banjoist Lawrence Marrero, bassist Alcide &quot;Slow Drag&quot; Pavageau, and drummer Joe Watkins. George Lewis, who recorded for many labels (a Mosaic box set of his Blue Note sessions is one of the best reissues), became a symbol of what was right and wrong about the New Orleans revival movement, overpraised by his fans and overcritized by his detractors. At his best he was well worth hearing. (AllMusic)\n\nTrack list:\n01 - Walking With The King\n02 - Ol' Man Mose\n03 - Gettysburg March\n04 - Mama Don't Allow It\n05 - Canal Street Blues\n06 - Just A Closer Walk With Thee\n07 - Bill Bailey\n08 - Over The Waves\n09 - Burgundy Street Blues\n10 - Mahogany Hall Stomp\n11 - Bucket's Got A Hole In It\n12 - High Society\n13 - See See Rider\n14 - Savoy Blues\n15 - Heebie Jeebies\n16 - I Can't Escape From You\n17 - When You Wore A Tulip\n18 - Ice Cream\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:8f7b1e64159681e15ade010fcbcbc87e7704cd25","amp;dn":"George+Lewis+-+1996+-+Walking+With+the+King+%281954-55%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f7b1e64159681e15ade010fcbcbc87e7704cd25","infoHashBuffer":{"type":"Buffer","data":[143,123,30,100,21,150,129,225,90,222,1,15,203,203,200,126,119,4,205,37]},"announce":[],"urlList":[]}}