{"title":"Superman - Secret Identity, 4 Parts, In KF8/mobi Panel View","uid":8654537,"size":141487641,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:90af249d0c289658b1d9ec62519b288d7bb3518f&amp;dn=Superman+-+Secret+Identity%2C+4+Parts%2C+In+KF8%2Fmobi+Panel+View&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moby6666","files":-1,"time":1373184152,"description":"All the comics contained in this torrent were taken from other torrents freely available to anyone who wished to download them. Most simply consisted of individual jpegs or png image files.  What I have attempted to do is convert these in to a comic book Kindle format with &quot;panel-view&quot; so they can be viewed on various Kindles, (Kindle Fire, Fire HD, Kindle Paperview, Kindle 3 and Kindle Keyboards with the most recent updates).\n\nSuperman: Secret Identity is a four-issue mini-series of 48 pages each in prestige format, written by Kurt Busiek and illustrated by Stuart Immonen. It was first published monthly, starting January 2004. The title was not released under the Elseworlds banner, but is regarded as a non-canonical story. The story describes the life of Clark Kent, a man in a world in which superheroes exist only as characters in comics, who suddenly gains the powers of Superman and embarks on a super-heroic career, but keeps his existence secret from the world at large.\n\nIssue #1\n\nThe Kents, a couple living in small town Kansas, name their child Clark, after the fictional Superman. He grows up resenting the joke, accepting the inevitable Superman-related gifts with a smile, and endures being the butt of many jokes. He retreats to his &quot;Fortress of Solitude&quot; in the fields, where he writes using an old typewriter. One night, he wakes to find himself floating in mid-air, and discovers that he now has the powers of Superman. He uses the powers at first to avoid his tormentors, then begins to secretly use them to rescue people in danger. The incidents of heroism prompt inquiries from journalists and government agents, putting him under pressure to better preserve his secret or to reveal his powers to the public.\n\nHe makes a deal with Wendy Case, the female reporter who first wrote about him, for her to handle his publicity to explore the nature of his powers together. But when he discovers her secretly video-recording him, he destroys the camera and resolves to go public with his powers on his own. Clark wears a Superboy costume to the town's Halloween carnival, where an explosion at the carnival puts people's lives in danger, and he rescues them. Reporters (including Wendy, who set up the explosion to reveal &quot;Superboy&quot;) come upon him as he is rescuing his longtime crush Cassie. Clark pretends that the rescue was not super-powered, becoming a local hero, earning the respect of his former tormentors, and the affection of Cassie.\n\nIssue #2\n\nYears later, Clark has moved to Manhattan, where he writes for The New Yorker and begins working on a book. He continues saving lives dressed as Superman (counting on reports of being saved by Superman to be ridiculed), as government agents continue to investigate his exploits. His coworkers set him up with a woman named Lois as a joke, but they hit it off and start a relationship.\n\nClark is lured into a trap and placed in a government facility, where they attempt to extract tissue samples. He escapes, evacuating the other test subjects, and destroying the building. He begins wearing glasses to make himself less easily recognized, and continues performing rescues, but is more cautious. Meanwhile, his writing career takes off. Clark reveals his secret to Lois, and no longer alone, is ready to face whatever lies ahead.\n\nIssue #3\n\nYears later, Clark continues his successful career while continuing his secret exploits, still evading the government. Concerned about the possible effects of his powers on his and Lois' unborn twins, he approaches the government to make a deal. After an abortive first contact with Agent Malloy, they come to terms: Clark will take non-political missions for the government; in return, the government will leave Clark and his family alone. He is called on a mission to rescue some hostages just as Lois goes into labor, which he grudgingly accepts as the way it will have to be. Returning to the hospital to see his wife and newborn daughters, he swears that he will keep them safe, no matter what it takes.\n\nIssue #4\n\nMany years later, Clark has become an accomplished writer, and Lois a famous designer. Their daughters Carol and Jane have come home for the holidays, bearing Superman-related gifts to tease their middle-aged father. Clark and Lois have noticed that his powers are fading, but he continues his government missions, becoming friendly with Malloy while still protecting his identity. He uncovers records of government research into creating super-powered people, and concludes that his powers are the result of a meteor shower exposing him to unknown agents, and his subconscious shaping his powers to match the Superman archetype.\n\nClark and Lois suspected their daughters might develop powers, but leave them to explore this possibility on their own. They eventually reveal themselves to their father, admitting that their powers manifested in their teens. When Agent Malloy retires, he reveals that he had uncovered Clark's identity long ago, but never reported it. With his daughters carrying on his superheroics, Clark retires as well.\n\nMany years later, Clark lives in a world that accepts the superhumans amongst them, resulting in advancements in every area of science. Jane has sons whom she has jokingly named Perry, Jimmy, and Clark. Clark publishes his book of research on his origins, though he keeps his family out of it. Retired and content, he still flies with his daughters, as well as Perry at times, who has since also discovered his powers.","torrent":{"xt":"urn:btih:90af249d0c289658b1d9ec62519b288d7bb3518f","amp;dn":"Superman+-+Secret+Identity%2C+4+Parts%2C+In+KF8%2Fmobi+Panel+View","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90af249d0c289658b1d9ec62519b288d7bb3518f","infoHashBuffer":{"type":"Buffer","data":[144,175,36,157,12,40,150,88,177,217,236,98,81,155,40,141,123,179,81,143]},"announce":[],"urlList":[]}}