{"title":"La Moitie Gauche Du Frigo  AKA The Left-Hand Side of the Fridge","uid":6024912,"size":731834418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92238ccae9e9752668cf0a42a7357f843078b181&amp;dn=La+Moitie+Gauche+Du+Frigo++AKA+The+Left-Hand+Side+of+the+Fridge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1291900079,"description":"Philippe Falardeau - La Moitie Gauche Du Frigo \nAKA The Left-Hand Side of the Fridge (2000) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0260193&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0260193&lt;/a&gt;\n\nLanguage\tFrench\nSubtitles\tEnglish\n &lt;a href=&quot;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/La-Moitie-gauche-du-frigo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/La-Moitie-gauche-du-frigo.jpg&lt;/a&gt;\n\nChristophe agrees to be filmed by his roommate StÃƒÂ©phane, while he is searching for a meaningful engineering job. Since he voluntarily resigned his job when he was to be moved to quality control, he does not get unemployment benefits, and goes to classes on how to contest the decision. Christophe sells his car, while StÃƒÂ©phane receives more funding for the film, and can hire a sound man. However, the crew following Christophe with a camera is a hinderance in his job-hunting. After spending the night with Christophe, his girlfriend Odile, an artist working as a supermarket cashier, takes over the camera and films the roommates as they get up. Finally Christophe finds a few days work dismantling machines for a company that is moving to Mexico, but his cameraman causes problems after interviewing the president of the company in the washroom.\n\nPhilippe Falardeau's The Left Side Of The Fridge was unwrapped here at the 2000 Toronto International Film Festival and became 'the' Canadian cause celebre.\n\nSet up as a mock documentary about unemployment, it proved to be a tasty treat that delighted audiences and seduced the jury handing out the $15,000 CITY-TV award for best first Canadian feature. Writer-director Falardeau then moved on to the prestigious Claude Jutra Award as the all-Canada rookie-of-the-year at the Genies.\n\nNow you can see what the fuss is about. Falardeau's sly film -- entitled La Moitie Gauche Du Frigo in Quebec -- opens for a week at the Bloor Cinema. Some scenes play in English but most are in French with decent English subtitles that get across much of the movie's satirical tone.\n\nFridge is a smart, left-leaning, socio-political tract about the moral bankruptcy of international corporations that maximize profits for shareholders by exploiting their workforce and then abandoning them. Massive unemployment results.\n\nThis agenda is well disguised. Fridge starts and ends in an off-hand personal way as we meet two Montreal roommates going through big life changes.\n\nOne, the movie's putative hero, is an unemployed mechanical engineer who is fussy about what might interest him.\n\nThe other, the movie's social conscience, is a theatre actor who is turning, somewhat clumsily, to filmmaking. He persuades the engineer to let him film him until he gets a job.\n\nLike the reality TV craze of today or the cinema verite style of the 1960s-70s, this documentary will become an event in itself, change the dynamic of our hero's job search, shift his priorities and alter the relationship of the two roommates.\n\nThat is especially true when the camera follows our hero into his love life -- he has a crush on a funky cashier at the local supermarket -- and even into bed. The camera consumes his life and starts to get annoying.\n\nMeanwhile, the filmmaker becomes pushy about his political motives. He interferes in the job interviews, interrogates bosses, radicalizes other workers and causes chaos.\n\nOn a more subtle level, Falardeau shows us a slice-of-life world in which most people are not doing the jobs they were trained to do. The Vietnamese-Canadian at the corner store was a vet back home. The cashier is an artist. And so on.\n\nAt the same time, things are played for sly laughs, not least because the roommates are an eccentric pair. Paul Ahmarani, as the engineer, and Stephane Demers, as the mock filmmaker, are odd-funny guys in a realistic way.\n\nThe rich humour draws us into the tale and makes it as believable as it is entertaining.\n &lt;a href=&quot;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00050-2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00050-2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00055-3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00055-3.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00056-2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i19.photobucket.com/albums/b200/ScreaminJayHawkins/screenies/vlcsnap-00056-2.png&lt;/a&gt;\n\n----------not my rip-------\n\nI removed packed bitstream and ran the &quot;improved&quot; English subs through Subtitle Workshop to further refine them.\n\n~~~~~~ La Moitie Gauche Du Frigo.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................731,750,400                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD 1.0.0              \nDuration (hh:mm:ss):............................1:27:20                \nFrame Count:....................................157038             \nFrame Width (pixels):...........................608                  \nFrame Height (pixels):..........................448                  \nAspect Ratio:...................................1.357                     \nFrames Per Second:..............................29.970          \nVideo Bitrate (kbps):...........................976                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.120&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................128                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2     \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                  &lt;a href=&quot;\nhttps://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.org/index.php&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot;\n      \n","torrent":{"xt":"urn:btih:92238ccae9e9752668cf0a42a7357f843078b181","amp;dn":"La+Moitie+Gauche+Du+Frigo++AKA+The+Left-Hand+Side+of+the+Fridge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92238ccae9e9752668cf0a42a7357f843078b181","infoHashBuffer":{"type":"Buffer","data":[146,35,140,202,233,233,117,38,104,207,10,66,167,53,127,132,48,120,177,129]},"announce":[],"urlList":[]}}