{"title":"[NDS] Need For Speed MegaRomPak-Europe","uid":4973776,"size":51582894,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:924d6fa6fd5f1fa1862c33d33a158cd354fa4d0b&amp;dn=%5BNDS%5D+Need+For+Speed+MegaRomPak-Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dsromking","files":-1,"time":1245893948,"description":"NFS Underground 2\n\nTaking place in a massive, free-roaming city featuring five distinct interconnected neighborhoods, NFS Underground 2 delivers an immersive game world where the streets are your menus. Encounter rival racers who will school you in the ways of the underground and tip you off to the hottest racing spots in town. Deep new performance tuning lets you fine-tune every aspect of your ride?s handling and performance, while hundreds of new visual customizations let you create your own personalized, totally unique car.\n\nNFS Most Wanted\n\nWake up to the smell of burnt asphalt as the thrill of illicit street racing permeates the air. From the makers of the hit Need for Speed Underground series, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer.\nCombining illicit street racing and tuner customization with the intensity of strategic police pursuit that surpasses any Hollywood-style chase scene, Need for Speed Most Wanted will be on every gamer's 'must-have' list this holiday season. Out-race rivals, evade cops and exploit hundreds of miles of open road as gamers make their way up the Blacklist.\nTo become the most wanted racer, players must build up their street cred and Rap Sheet with gripping, white knuckle, head-to-head races with the top drivers on the streets, as well as pull daring, evasive moves to out-run and out-fox the cops that patrol the open road. Players can manage their heat or utilize a number of strategic tactics to keep the cops off their tails as they leave their rivals behind to suck their exhaust fumes.\n\n\nNFS - Carbon, Own The City\n\n\n\n    * All-new Canyon Duel and Drift race modes\n    * Race for control of the city\n    * Customise your dream cars with the new Autosculpt tool\n    * Affiliate with the Tuner, American Muscle, or Exotic car classes\n    * Strategically choose your crew members\n\n\nPack 1 of 2","torrent":{"xt":"urn:btih:924d6fa6fd5f1fa1862c33d33a158cd354fa4d0b","amp;dn":"%5BNDS%5D+Need+For+Speed+MegaRomPak-Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924d6fa6fd5f1fa1862c33d33a158cd354fa4d0b","infoHashBuffer":{"type":"Buffer","data":[146,77,111,166,253,95,31,161,134,44,51,211,58,21,140,211,84,250,77,11]},"announce":[],"urlList":[]}}