{"title":"Goldrake Special Edition DVD02 [DVD9 ~ ITA JAP]","uid":5205963,"size":6410725376,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:92e0c445fce4b4f15df3238b1fbefa1cbfda899e&amp;dn=Goldrake+Special+Edition+DVD02+%5BDVD9+%7E+ITA+JAP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Colombo-bt","files":-1,"time":1260377947,"description":"*************************************************************\nGoldrake Special Edition DVD2 [DVD9 ITA JAP]  [dvd 2 of 12]\n*************************************************************\n\nTitolo originale: UFO Robot Grendizer\nTitolo: UFO Robot Goldrake\nGenere: Anime SCI-FI MECHA\nAutore: Go Nagai\nRegia: M. Akehi, T. Katsumata, M.Ochiai\nSceneggiatura: S. Uehara, K. Fujikawa, T.Andou\nCharacter Design: K. Komatsubara, S. Araki\nProduzione: Toei Animation\nDistribuzione Italiana: D/Visual\n\n\n\nFormato: DVD9 Full 100%\nRegione: 2, PAL\nVideo: MPEG2 - Colore - 4:3 - MULTIANGOLO\nAudio: Italiano (2.0) - Italiano (2.0) - Giapponese (2.0)\nLingua: Italiano - Giapponese\nSottotitoli: NO\nDurata:\t154'  \t\n\n\nIl protagonista della serie ÃƒÂ¨ il principe Duke Fleed, fuggito dopo una disperata resistenza a bordo di un avanzatissimo robot da battaglia, Goldrake (Grendizer) dalla sua stella natale Fleed in seguito all'attacco delle truppe del feroce Re Vega. Le Forze di Vega infatti sono solite assaltare i pianeti invadendoli ed annettendoli al loro impero. Giunto sulla Terra Duke Fleed viene trovato morente dal dottor Procton (Genzo Umon), direttore dell'Istituto di ricerche spaziali, il quale lo accoglie e lo nasconde sotto le mentite spoglie di Actarus (Daisuke Umon), facendolo passare per il proprio figlio di ritorno da un lungo viaggio. Anche Goldrake con il suo disco spaziale (Spacer) viene nascosto all'interno dell'Istituto, nei cui sotterranei viene costruito una sorta di enorme hangar.\n\nCirca otto anni dopo, continuando il loro progetto di invasione, anche le truppe di Vega giungono presso la Terra e, sotto la guida del comandante Hydargos (Blacky) e del feroce generale Gandal, ambiguo personaggio dotato di una metÃƒÂ   maschile e di una femminile, stabiliscono una base sulla Luna. Actarus si troverÃƒÂ   ad utilizzare nuovamente Goldrake per difendere il suo pianeta adottivo. Ad aiutarlo c'ÃƒÂ¨ il giovane Alcor (Koji Kabuto), il quale pilota un disco volante di sua progettazione e costruzione. I due oppongono una agguerrita resistenza, anche se a malapena riescono a rintuzzare i continui assalti degli invasori di Vega.\n\nSontuosa trasposizione su supporto digitale per quello che ÃƒÂ¨ probabilmente il robot piÃƒÂ¹ conosciuto in italia e nel mondo. Tutte le pellicole originali sono state ripulite e traposte su DVD per garantire la miglior qualitÃƒÂ   video possibile. La trascodifica in PAL ÃƒÂ¨ stata fatta, caso piÃƒÂ¹ unico che raro, direttamente dal produttore Toei Animation in Giappone, negli studi di Sony PCL, considerati tra i piÃƒÆ’Ã‚Â¹ avanzati del mondo nel trattamento dell' immagine.\n \nIl processo di pulizia video e stabilizzazione dell'immagine ÃƒÂ¨ stato eseguito attraverso Archangel, una delle piÃƒÂ¹ costose e avanzate macchine al mondo specializzate in questo tipo di operazione. Alla pulizia del rumore video e al centramento dell' immagine che Archangel svolge automaticamente in tempo reale si ÃƒÂ¨ aggiunto un certosino lavoro manuale di correzione dei colori e dei livelli video per dare maggiore brillantezza e bilanciamento ai colori e un migliore rapporto di luminositÃƒÂ  e contrasto.\n\nQuesta prima edizione ufficiale in DVD, oltre a godere di illustrazioni del grande Kazuhiro Ochi per il packaging, il libretto, la stampa in offset del disco e i menÃƒÂ¹, sarÃƒÂ   anche l'unica a godere di tre piste audio: una colonna in italiano con i nomi che tutti conosciamo (Goldrake, Actarus ecc.); una seconda colonna in italiano con i nomi originali giapponesi (Grendizer, Daisuke ecc.); e la colonna originale giapponese.  Le due colonne italiane sono state completamente ricreate con i doppiatori del tempo, in modo da correggere i numerosi errori, imperfezioni e incongruenze della vecchia edizione trasmessa nel 1978. Ne ÃƒÂ¨ nata una versione che, mentre sa entusiasmare i nostalgici della vecchia edizione televisiva, nel contempo si sottrae alle accuse di superficialitÃƒÂ  lessicale e incongruenza logica di cui quest'ultima ÃƒÂ¨ stata vittima. La presenza di un supervisore unico per il doppiaggio (Francesco Grippo) ha permesso di scoprire elementi mancanti nell'edizione del 1978. Per esempio, giÃƒÂ   nelle scene iniziali del primo episodio, si scopre che quello che Alcor / Koji chiamava &quot;mostro extraterrestre&quot; era in realtÃƒÂ   il potente Mazinger Z, il difensore della pace e della giustizia diventato l'eroe di una generazione; oppure che lo stesso Goldrake ÃƒÂ¨ in realtÃƒÂ   un robot costruito per ordine di Re Vega, fatto che spiega anche l'accanimento del perfido sovrano contro il robot. Sia la pista italiana con i nomi &quot;classici&quot; che quella con i nomi &quot;originali&quot; utilizzano gli stessi doppiatori.\n\nDa notare perÃƒÂ² come molti appassionati abbiano snobbato la gran mole di lavoro fatto per la mancanza del doppiaggio storico della serie che, pur contenendo errori e cattivi adattamenti alla trama originale, avrebbe reso quest'opera ambitissima anche dai piÃƒÂ¹ scrupolosi.\n\nAnche chi si sente un cultore di &quot;UFO Robot Goldrake&quot; si ritroverÃƒÂ  dunque con la sorpresa di tre nuove avventure che non ha mai visto finora; in ogni episodio saranno anche reinserite le parti e i dialoghi tagliati all'epoca.","torrent":{"xt":"urn:btih:92e0c445fce4b4f15df3238b1fbefa1cbfda899e","amp;dn":"Goldrake+Special+Edition+DVD02+%5BDVD9+%7E+ITA+JAP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e0c445fce4b4f15df3238b1fbefa1cbfda899e","infoHashBuffer":{"type":"Buffer","data":[146,224,196,69,252,228,180,241,93,243,35,139,31,190,250,28,191,218,137,158]},"announce":[],"urlList":[]}}