{"title":"Historical Dictionary of Witchcraft{BBS}","uid":6638290,"size":2516554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92f4f34f9825efefa65a28403fdc6b5912b6566a&amp;dn=Historical+Dictionary+of+Witchcraft%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314645817,"description":"A great deal has been written about the history of witchcraft, but much of what has been written is unreliable, exaggerated, or inaccurate. This problem is especially acute in regard to modern witchcraft, or Wicca, and its supposed connections to historical witchcraft in medieval and early modern Europe. This Dictionary provides a reliable reference source for both academics and general readers interested in the actual historical development of witchcraft in the western world.\n\nThe focus of the dictionary is on Western Europe during the late-medieval and early modern periods, when the specific idea of diabolical witchcraft developed and when the so-called &quot;great witch-hunts&quot; occurred. Entries are also provided that deal with magic and witchcraft in the earlier Christian period and classical antiquity, as well as with the lingering belief in witchcraft in the modern world, and with the development of the modern, neo-pagan religion of witchcraft, also known as Wicca. For comparative purposes, some entries have been provided that deal with aspects and systems of magic found in other parts of the world that seem to bear some relation to the idea of witchcraft as it developed in Christian Europe. The regions dealt with are mainly Africa, along with such New-World practices as Voodoo and Santeria. Entries in the dictionary cover important people in the history of witchcraft, from the medieval inquisitors and early modern magistrates who developed the stereotype of the historical witch to the modern individuals who have developed the religion of Wicca. Also included are legal terms and concepts important to the prosecution of the supposed crime of witchcraft, and religious and theological concepts pertaining to the demonic elements that came to be associated with witchcraft, as well as more popular beliefs and aspects of common folklore and mythology that became attached to the developing idea of witchcraft. Geographic entries are also included, discussing the scope of witch-hunting in various regions of\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 248 pages\n    * Publisher: Scarecrow Press (September 29, 2003)\n    * Language: English\n    * ISBN-10: 0810848600\n    * ISBN-13: 978-0810848603","torrent":{"xt":"urn:btih:92f4f34f9825efefa65a28403fdc6b5912b6566a","amp;dn":"Historical+Dictionary+of+Witchcraft%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92f4f34f9825efefa65a28403fdc6b5912b6566a","infoHashBuffer":{"type":"Buffer","data":[146,244,243,79,152,37,239,239,166,90,40,64,63,220,107,89,18,182,86,106]},"announce":[],"urlList":[]}}