{"title":"Confucius (2010) DVDr-sailo1","uid":5427410,"size":4570269696,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:933dbad4d6863f572c80bc2c4727800abb39f7f6&amp;dn=Confucius+%282010%29+DVDr-sailo1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sailo","files":-1,"time":1268304147,"description":" &lt;a href=&quot; http://www.imdb.com/title/tt1397498/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1397498/&lt;/a&gt;\n\nThe great stories of Confucius (551BC-479BC) are brought to life in the 2010 epic historical film made by 5th-generation director Hu Mei and her sparkling cast and crew. Hong Kong superstar Chow Yun Fat has played heroes, gangsters, and all sorts of cool characters throughout his career, but his latest turn as the influential Chinese thinker and wise teacher may just be the pinnacle on his illustrious resume. Chow's subdued but affecting portrayal of Confucius is a breakthrough for himself, and that owes in part to his chemistry with his exceptional co-stars, including Zhou Xun (The Banquet), Lu Yi (Seven Swords), Ren Quan (Assembly), and Qiao Zhenyu (The Book and the Sword). Kudos must also be bestowed on Oscar-winning cinematographer Peter Pau (Crouching Tiger, Hidden Dragon) for bringing Chow's Confucius to life on the big screen. Director Hu Mei is best known for her acclaimed historical TV drama series like Yong Zheng Dynasty and The Emperor in Han Dynasty. Here, she has chosen a special angle in tackling the compelling biography of the Great Sage. Set in the chaotic and decadent world of the warring states during the Spring and Autumn Period, the film focuses on the turbulent later years of Confucius's life, specifically from his appointment to political office at 51 to his death at 73, and all the dramatic stories in between.\n\nAudio Language...: MANDARIN\n Audio Format.....: DD 5.1\n Subtitles........: English, Chinese\n\nR6 retail","torrent":{"xt":"urn:btih:933dbad4d6863f572c80bc2c4727800abb39f7f6","amp;dn":"Confucius+%282010%29+DVDr-sailo1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"933dbad4d6863f572c80bc2c4727800abb39f7f6","infoHashBuffer":{"type":"Buffer","data":[147,61,186,212,214,134,63,87,44,128,188,44,71,39,128,10,187,57,247,246]},"announce":[],"urlList":[]}}