{"title":"HISTORY OF POP AND ROCK MUSIC - part 552","uid":9552590,"size":370414908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:935fd7a2dd299bfa6fad6d4c7ec16fb76a19d2f2&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+552&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1391295178,"description":"\n\n                   PART  552\n\n\n\n           THE KINGSTON TRIO    -  Tom Dooley  (1958)\n           THE BROTHERS FOUR  -  Five Hundred Miles  (1962)\n           THE BROTHERS FOUR  -  Four Strong Winds  (1963)\n\n\n\n\n               &quot;Tom Dooley&quot; is an old North Carolina folk song based on the 1866 murder of a woman named Laura Foster in Wilkes County, North Carolina. It is best known today because of a hit version recorded in 1958 by The Kingston Trio. This version was a multi-format hit, reaching #1 in Billboard, the Billboard R&amp;B listing, and appearing in the Cashbox country music top 20. It fits within the wider genre of Appalachian &quot;sweetheart murder ballads&quot;.\nThe song was selected as one of the American Songs of the Century by the Recording Industry Association of America (RIAA), the National Endowment for the Arts, and Scholastic Inc.\n                In 1866, Laura Foster was murdered. Impoverished Confederate veteran Tom Dula (Dooley), Foster's lover and probable fiance, was convicted of her murder and hanged May 1, 1868. Laura was stabbed to death with a large knife; the brutality of the attack partly accounted for the widespread publicity the murder and subsequent trial received.  Dula had a lover, prior to his leaving for the war, named Anne Melton, a cousin of Foster. Her comments led to the discovery of Foster's body, but Melton was acquitted in a separate trial based on Dula's word. Dula's enigmatic statement on the gallows that he had not harmed Foster but still deserved his punishment led to press speculation that Melton was the actual killer and that Dula simply covered for her. Melton, who had once expressed jealousy of Dula's purported plans to marry Foster, died insane a few years after the homicide. Thanks to the efforts of newspapers such as The New York Times, and to the fact that former North Carolina governor Zebulon Vance represented Dula pro bono, Dula's murder trial and hanging were given widespread national publicity. A local poet, Thomas C. Land, wrote a popular song about Dula's tragedy after the hanging.\n           Dula was tried in Statesville, because it was believed he could not get a fair trial in Wilkes County. He was given a new trial on appeal but he was again convicted, and hanged on May 1, 1868. His alleged accomplice, Jack Keaton, was set free. On the gallows, Dula reportedly stated, &quot;Gentlemen, do you see this hand? I didn't harm a hair on the girl's head.&quot;\n\n\n               &quot;500 Miles&quot; (or &quot;500 Miles Away from Home&quot; or &quot;Railroaders' Lament&quot;) is a folk song made popular in the United States and Europe during the 1960s folk revival. The simple repetitive lyrics offer a lament by a traveller who is far from home, out of money and too ashamed to return. The song is generally credited as being written by Hedy West and a 1961 copyright is held by Atzal Music, Inc. Some recordings have also credited Curly Williams, and/or John Phillips as co-writers. David Neale writes that &quot;500 Miles&quot; may be related to the older folk song, &quot;900 Miles,&quot; which may itself have origins in the southern American fiddle tunes &quot;Reuben's Train&quot; and &quot;Train 45&quot;.\n          &quot;500 Miles&quot; is West's &quot;most anthologized song.&quot; The song appears on the 1961 self-titled debut album by The Journeymen; this may have been its first release.  The song was heard on the February, 1962 Kingston Trio live album College Concert (a 1962 US #3). It was further popularized by Peter, Paul and Mary (it was the second track on their US #1, May 1962 debut album). It has also been recorded by the Brothers Four, Sonny &amp; Cher, Johnny Rivers, Alexander Rybak, The Hooters, Reba McEntire, Jackie DeShannon, The Seekers, Elvis Presley, The Highwaymen, The Seldom Scene, Nick Cave, Richard Anthony, Franco Battiato, Rosanne Cash, Bad Astronaut, Peter and Gordon, Eric Bibb, Hootenanny Singers, the innocence mission, Joan Baez, Takako Matsu, The Persuasions and many others. Recently, the song has been recorded by Justin Timberlake, Carey Mulligan and Stark Sands for the soundtrack of the film Inside Llewyn Davis. The soundtrack was released on November 11, 2013.\n\n            &quot;Four Strong Winds&quot; is an influential song written by Ian Tyson in the early 1960s and recorded by Canadian folk duo Ian and Sylvia. The song was a hit in Canada, making the top ten of the single charts there in October 1963. In the United States, the song did not have the same initial chart success. Ian and Sylvia's single version entered the Cashbox magazine &quot;Looking Ahead&quot; chart in September 1963. It was then recorded by The Brothers Four in a version that &quot;bubbled under&quot; the Billboard Hot 100 in October 1963. Subsequently, it was released by Ian and Sylvia on an album of the same name released in the U.S. in April 1964.  However, it was released in a country arrangement by Bobby Bare in 1964, and became a number three hit on the U.S. country singles chart in early 1965.\nThis folk classic has been recorded by many artists beyond those already named, including Hank Snow, The Seekers, Judy Collins, the Chad Mitchell Trio, Bob Dylan, Marianne Faithfull, The Searchers, John Denver, The Kingston Trio, Trini Lopez, Waylon Jennings, Chad and Jeremy, The Wolfe Tones, The Tragically Hip, Joan Baez, Vanity Fare, Glenn Yarborough, Tony Rice, Johnny Cash, The Carter Family, Sarah McLachlan, and Schooner Fare.","torrent":{"xt":"urn:btih:935fd7a2dd299bfa6fad6d4c7ec16fb76a19d2f2","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+552","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935fd7a2dd299bfa6fad6d4c7ec16fb76a19d2f2","infoHashBuffer":{"type":"Buffer","data":[147,95,215,162,221,41,155,250,111,173,109,76,126,193,111,183,106,25,210,242]},"announce":[],"urlList":[]}}