{"title":"Hellfire","uid":8754378,"size":1270683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93c729a1707102a261c9342a22ac6c63af5579f8&amp;dn=Hellfire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JinRohEX","files":-1,"time":1375114461,"description":"Hellfire\nby Ed Macy\n\nDESCRIPTION:\nThe true story of one man's determination to master the world's deadliest helicopter and of a split-second decision that changed the face of modern warfare. Ed Macy bent every rule in the book to get to where he wanted to be: on Ops in the stinking heat of the Afghan summer, with the world's greatest weapons system at his fingertips. It's 2006 and he is part of an elite group of pilots assigned to the controversial Apache AH Mk1 gunship programme. So far, though, the monstrously expensive Apache has done little to disprove its detractors. For the first month 'in action' Ed sees little more from his cockpit than the back end of a Chinook. But everything changes in the skies over Now Zad. Under fire and out of options, Ed has one chance to save his own skin and those of the men on the ground. Though the Apache bristles with awesome weaponry, its fearsome Hellfire missile has never been fired in combat. Then, in the blistering heat of the firefight, the trigger is pulled. It's a split-second decision that forever changes the course of the Afghan war, as overnight the gunship is transformed from being an expensive liability to the British Army's greatest asset. From that moment on, Ed and his squadron mates will face the steepest learning curve of their lives - fighting an endless series of high-octane missions against a cunning and constantly evolving enemy. Ed himself will have to risk everything to fly, fight and survive in the most hostile place on earth.\n\nGoodReads title link: &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/6856897-hellfire&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/6856897-hellfire&lt;/a&gt;","torrent":{"xt":"urn:btih:93c729a1707102a261c9342a22ac6c63af5579f8","amp;dn":"Hellfire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93c729a1707102a261c9342a22ac6c63af5579f8","infoHashBuffer":{"type":"Buffer","data":[147,199,41,161,112,113,2,162,97,201,52,42,34,172,108,99,175,85,121,248]},"announce":[],"urlList":[]}}