{"title":"unholy- studio discography/doom metal","uid":9233362,"size":2226489730,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:94225e7b93c2592b1249e66210099148400f6756&amp;dn=unholy-+studio+discography%2Fdoom+metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1385081391,"description":"4om wiki:\nUnholy is a Finnish avant-garde doom metal[1] band. Formed in 1988, they were one of the first doom metal groups in their home country.\n\nUnholy originally started as a black metal/doom metal hybrid under the name Holy Hell. After recording its first demo, &quot;Kill Jesus&quot;, they changed their name to Unholy. The band achieved underground popularity with its next demo and the 1991 EP Trip to Depressive Autumn, and signed with Lethal Records, an Austrian record label that released the band's first album, From the Shadows, in 1993. Unholy then signed with Avantgarde Music for the next album, The Second Ring of Power, but disbanded soon after its release in 1994. However, they re-formed only two years later.[2]\n\nUnholy released their last two albums, Rapture and Gracefallen, also through Avantgarde Music. The band announced they were splitting up on March 25, 2002.[3]\n\nIn 2008 Unholy started co-operation with Ahdistuksen Aihio label to release all demos as vinyl, which were released in spring 2011 with complete history booklet of the band. After Peaceville Records bought Unholy album release rights from Avantgarde Music they started to negotiate for re-issuing all full length albums. Reissuing project produced some changes to cover arts but also for album songs list. Gracefallen got one bonus track &quot;Gone&quot; which was released originally during Gracefallen recording sessions, but was left out from original release. Rapture included two live bonus tracks from year 1999. The Second Ring of Power not only got completely new cover artwork but it also included 45 minutes long bonus DVD from gig 1994.\n\nIn the beginning of year 2012 Unholy also started to do preparations and rehearsals for combined comeback and farewell project with so called original line-up. Project would last only for summer 2012. After that band would split up again. Band played four open air festival live shows in summer 2012, as the spirit of &quot;good old times for good old fans&quot;; 2 in Finland, 1 in Germany and 1 in Romania. In autumn band announced in official website that &quot;hats are off&quot;, meaning band retired as planned\n\n\nAlbums:\nFrom the Shadows (1993)\nFrom the Shadows (1993)remastered 1999\nThe Second Ring of Power (1994)\nRapture (1998)\nGracefallen (1999)\n\n","torrent":{"xt":"urn:btih:94225e7b93c2592b1249e66210099148400f6756","amp;dn":"unholy-+studio+discography%2Fdoom+metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94225e7b93c2592b1249e66210099148400f6756","infoHashBuffer":{"type":"Buffer","data":[148,34,94,123,147,194,89,43,18,73,230,98,16,9,145,72,64,15,103,86]},"announce":[],"urlList":[]}}