{"title":"Bhagavad Gita in Sanskrit","uid":4345035,"size":223734173,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:95e5792443f076aecd613aace4936bfee3db5887&amp;dn=Bhagavad+Gita+in+Sanskrit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shankjunk","files":25,"time":1218823573,"description":"The Bhagavad Gita (&quot;Song of God&quot;) is a Sanskrit text from the chapter Bhishma Parva of the Mahabharata epic, comprising 700 verses.Krishna, as the speaker of the Bhagavad Gita, is referred to within as Bhagavan (the divine one). The verses themselves, using the range and style of Sanskrit meter (chhandas) with similes and metaphors, are written in a poetic form that is traditionally chanted; hence the title, which translates to &quot;the Song of the Divine One&quot;. The Bhagavad Gita is revered as sacred by Hindu traditions, and especially so by Vaishnavas (followers of Vishnu-Krishna). It is commonly referred to as The Gita, and is called sometimes the &quot;Bible of Krishnaism&quot;. The content of the text is a conversation between Krishna and Arjuna taking place on the battlefield of Kurukshetra just prior to the start of the Kurukshetra war. Responding to Arjuna&amp;#039;s confusion and moral dilemma, Krishna explains to Arjuna his duties as a warrior and Prince and elaborates on different Yogic and Vedantic philosophies, with examples and analogies. This has led to the Gita often being described as a concise guide to Hindu philosophy and also as a practical, self-contained guide to life. During the discourse, Krishna reveals his identity as the Supreme Being Himself (Svayam bhagavan), blessing Arjuna with an awe-inspiring glimpse of His divine universal form. The Bhagavad Gita is also called Gitopanishad as well as Yogopanishad, implying its status as an Upanishad, or a Vedantic scripture. Since the Gita is drawn from the Mahabharata, it is included in Smriti texts. However, being one of Upanishads, it has a status of shruti, or revealed knowledge.\nChanted by Sri Brahmananda Swami of the Chinmaya Mission.\n\nRefs: 1. Winternitz, Maurice (1972). History of Indian Literature. New Delhi: Oriental Books Reprint Corporation. Second revised reprint edition. Two volumes. First published 1927 by the University of Calcutta.\n2.Zaehner, R. C. (1969). The Bhagavad Gita. Oxford University Press. ISBN 0-19-501666-1.","torrent":{"xt":"urn:btih:95e5792443f076aecd613aace4936bfee3db5887","amp;dn":"Bhagavad+Gita+in+Sanskrit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95e5792443f076aecd613aace4936bfee3db5887","infoHashBuffer":{"type":"Buffer","data":[149,229,121,36,67,240,118,174,205,97,58,172,228,147,107,254,227,219,88,135]},"announce":[],"urlList":[]}}