{"title":"Final Fantasy and Philosophy: The Ultimate Walkthrough","uid":7623375,"size":1320513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96824561d95905552d8348ba1ca8db1cee606f8a&amp;dn=Final+Fantasy+and+Philosophy%3A+The+Ultimate+Walkthrough&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":1,"time":1347380640,"description":"Final Fantasy and Philosophy: The Ultimate Walkthrough (The Blackwell Philosophy and Pop Culture Series)\n\nby Jason P. Blahuta, Michel S. Beaulieu, William Irwin\n \nPages:240\n\nDescription:\n\n An unauthorized look behind one of the greatest video game franchises of all time, Final Fantasy\nThe Final Fantasy universe is packed with compelling characters and incredible storylines. In this book, you'll take a fascinating look at the deeper issues that Final Fantasy forces players to think about while trying to battle their way to the next level, such as: Does Cloud really exist (or should we really care)? Is Kefka really insane? Are Moogles part of a socialist conspiracy? Does the end of the game justify the means?\n\nAs Mages, Moogles, fiends, and Kefka are mashed together with the likes of Machiavelli, Marx, Foucault, and Kafka, you'll delve into crucial topics such as madness, nihilism, environmental ethics, Shintoism, the purpose of life, and much more.\n\nExamines the philosophical issues behind one of the world's oldest and most popular video-game series\nOffers new perspectives on Final Fantasy characters and themes\nGives you a psychological advantage--or at least a philosophical one--against your Final Fantasy enemies\nAllows you to apply the wisdom of centuries of philosophy to any game in the series, including Final Fantasy XIII\n\nGuaranteed to add a new dimension to your understanding of the Final Fantasy universe, this book is the ultimate companion to the ultimate video-game series. ","torrent":{"xt":"urn:btih:96824561d95905552d8348ba1ca8db1cee606f8a","amp;dn":"Final+Fantasy+and+Philosophy%3A+The+Ultimate+Walkthrough","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96824561d95905552d8348ba1ca8db1cee606f8a","infoHashBuffer":{"type":"Buffer","data":[150,130,69,97,217,89,5,85,45,131,72,186,28,168,219,28,238,96,111,138]},"announce":[],"urlList":[]}}