{"title":"Kingdom Hearts - Volume 1-4 [Jpg - Ita] TNT Village","uid":12815305,"size":172782076,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:97f3ca277109d8b01eec1fda4f8606309c292b28&amp;dn=Kingdom+Hearts+-+Volume+1-4+%5BJpg+-+Ita%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":547,"time":1448229424,"description":"Kingdom Hearts - Volume 1-4 [Jpg - Ita] TNT Village\r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=93765\r\n\r\nKingdom Hearts (in Giapponese: kingudamu haatsu) è un Action/RPG uscito nell'autunno 2002 noto per essere il risultato della collaborazione tra il creatore e produttore di giochi Square-Enix (allora SquareSoft) e la Disney. Kingdom Hearts comincia in un'isola tropicale da sogno, casa dei personaggi principali: Sora, Riku e Kairi. Una notte, una violenta tempesta allerta i protagonisti obbligati a combattere malvagie creature chiamate Heartless. I tre amici vengono separati e a Sora viene donata una bizzarra ma potente arma a forma di chiave fungente da spada: il Keyblade. Assieme a diversi personaggi Disney, come Paperino e Pippo, e al potere del Keyblade, cerca di sconfiggere gli Heartless e trovare i propri amici.\r\n\r\nIn Kingdom Hearts, una personalità malvagia (Ansem) ha usato gli Heartless per distruggere i confini tra i vari mondi.\r\nAlla guida di Sora e dei famosi personaggi Disney Paperino e Pippo, il giocatore deve viaggiare per ognuno di essi sfruttando il potere del Keyblade che permette di chiudere l'entrata per i cuori dei mondi prima che gli Heartless possano distruggerli. Dall'altro lato, chi si cela dietro questi malvagi piani sta cercando il metodo di aprire la porta che conduce all'Oscurità totale. L'amico di Sora, Riku, per ritrovare Kairi compagna dei due sull'isola del destino si lascia influenzare dal male che gli rivela che nel suo amico Sora è racchiuso il cuore rubato di Kairi. Sora inconsapevole di tutto continua a cercare gli amici e arrivato alla fortezza oscura scopre la verità e si sacrifica per salvare l'amica. Ma grazie all'affetto di Kairi Sora, diventato un Heartless, viene salvato e ritorna alla sua forma originaria.\r\n\r\n.: Locandina :.\r\n\r\n[img]http://archives.purupururin.fr/wp-content/uploads/2009/01/234_2.jpg[/img]","torrent":{"xt":"urn:btih:97f3ca277109d8b01eec1fda4f8606309c292b28","amp;dn":"Kingdom+Hearts+-+Volume+1-4+%5BJpg+-+Ita%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97f3ca277109d8b01eec1fda4f8606309c292b28","infoHashBuffer":{"type":"Buffer","data":[151,243,202,39,113,9,216,176,30,236,31,218,79,134,6,48,156,41,43,40]},"announce":[],"urlList":[]}}