{"title":"Katarzyna Bonda - cykl Hubert Meyer 1-3 [PDF] [Polish]","uid":13635785,"size":8144242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98c6c3a605ff22d07c3e6df09464932d5990af66&amp;dn=Katarzyna+Bonda+-+cykl+Hubert+Meyer+1-3+%5BPDF%5D+%5BPolish%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":4,"time":1456069044,"description":"Katarzyna Bonda - cykl Hubert Meyer - części: 1-3\r\njęzyk: PL / format: PDF / jakość: dobra i średnia\r\n\r\nWstawka zawiera trzy tomy kryminalnego cyklu &quot;Hubert Meyer - psycholog śledczy&quot; autorstwa polskiej pisarki, Katarzyny Bondy.\r\n\r\nHubert Meyer -01- Sprawa Niny Frank\r\nAkcja powieści rozgrywa się w dwóch światach: jeden to sielska miejscowość przygraniczna - Mielnik nad Bugiem - gdzie do tej pory nie działo się nic oprócz lokalnych skandali, a życie płynęło leniwie. Drugi to &quot;high life&quot; stolicy, w którym żyje najpopularniejsza aktorka polskich seriali - Nina Frank. Prawdę o niej poznajemy z dziennika internetowego, który zaczyna prowadzić w pewnym momencie swego, pełnego skandali, życia...\r\nDowiadujemy się o jej dwuznacznej drodze do kariery, licznych kochankach, nałogach, różnego kalibru świństwach i grzeszkach. Jednocześnie w swoim życiu odgrywa role szczęśliwej i dobrej - jak grana przez nią postać zakonnicy Joanny, która przyniosła jej pieniądze i sławę. Kochają ją miliony telewidzów i wierzą w wykreowany wizerunek. Te dwa światy przeplatają się przez całą książkę, by spotkać się w kulminacyjnym punkcie akcji, gdy dochodzi do wyjaśnienia zagadki śmierci Niny Frank...\r\nKiedy aktorka zostaje znaleziona w swoim dworku nad Bugiem martwa, do Mielnika nad Bugiem przyjeżdża Hubert Meyer - profiler policyjny i zaczyna po kolei odkrywać tajemnice gwiazdy. Poznając sekrety Frank i próbując stworzyć profil jej mordercy, Hubert Meyer analizuje także swoje życie - atakują go wspomnienia i przy okazji badania zbrodni, dociera do - skrywanych przed sobą - własnych tajemnic...\r\n\r\nHubert Meyer -02- Tylko Martwi Nie Kłamią\r\nProfiler policyjny musi rozwikłać zagadkę śmierci śmieciowego barona, którego ciało znaleziono w jednej z katowickich kamienic. Wszystkie poszlaki wskazują na biznesowe porachunki, ale Hubert Meyer czuje, że sprawa może mieć związek z morderstwem sprzed 17 lat...\r\n\r\nHubert Meyer -03- Florystka\r\nHubert Meyer popełnił błąd w profilu i porzucił pracę w policji. Stary przyjaciel prosi go o pomoc w przesłuchaniu młodej kobiety, w związku z zaginięciem jej 9-letniej córki. Policjanci próbują łączyć tę sprawę z bestialskim zabójstwem 11-letniego Amadeusza, którego matka jest szanowaną w mieście florystką. Okazuje się, że była ona ostatnią osobą, która widziała Zosię żywą.?..\r\nFlorystka początkowo pomaga w poszukiwaniach, ale gdy ciało dziecka odnajduje się na tym samym cmentarzu, gdzie pochowano Amadeusza, staje się główną podejrzaną","torrent":{"xt":"urn:btih:98c6c3a605ff22d07c3e6df09464932d5990af66","amp;dn":"Katarzyna+Bonda+-+cykl+Hubert+Meyer+1-3+%5BPDF%5D+%5BPolish%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c6c3a605ff22d07c3e6df09464932d5990af66","infoHashBuffer":{"type":"Buffer","data":[152,198,195,166,5,255,34,208,124,62,109,240,148,100,147,45,89,144,175,102]},"announce":[],"urlList":[]}}