{"title":"[2001] Shakira - Laundry Service [CDRip - flac]","uid":5340105,"size":354285153,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:99f4db5232688385ae5c073f3772684986a8d291&amp;dn=%5B2001%5D+Shakira+-+Laundry+Service+%5BCDRip+-+flac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ddawg","files":-1,"time":1265449626,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51CYN0D6W7L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51CYN0D6W7L._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Laundry Service\nArtist: Shakira \nAudio CD (November 13, 2001) \nOriginal Release Date: November 13, 2001 \nNumber of Discs: 1 \nGenre: Latin\nFormat: flac\n\n\nTrack Listing:\n\n01. Objection (Tango)\n02. Underneath Your Clothes\n03. Whenever, Wherever\n04. Rules\n05. The One\n06. Ready For The Good Times\n07. Fool\n08. Te Dejo Madrid\n09. Poem To A Horse\n10. Que Me Quedes Tu\n11. Eyes Like Yours (Ojos AsÃƒÂ­)\n12. Suerte (Whenever, Wherever)\n13. Te Aviso, Te Anuncio (Tango) \n\n\n\nAllmusic Review: \nThe Latin pop and rock en espaÃƒÂ±ol fields are full of talented artists who would probably be huge in the English-language market if they didn't sing in Spanish exclusively. Some non-Spanish-speaking listeners don't mind listening to lyrics they don't understand -- the beat and the melody are enough for them -- but many others insist on understanding every word that is coming out of an artist's mouth. Thus, Latin stars usually don't cross over to English-speaking audiences until they start singing in English, which is what Shakira does on 2001's Laundry Service. &quot;Whenever, Wherever,&quot; this album's infectious lead single, is to Shakira what &quot;Livin' la Vida Loca&quot; was to Ricky Martin: the major hit that brought her to English-speaking audiences in a big way. For Shakira, singing and writing in mostly English was no doubt a challenge -- Spanish, after all, is the Colombian star's primary language. But it's a challenge that she handles impressively well. Shakira, it turns out, sings quite convincingly in English -- and her creativity is at a high level on melodic, hooky pop/rock like &quot;Rules&quot; and &quot;Ready for the Good Times.&quot; Like Shakira's Spanish-language albums, this self-produced CD is enjoyably eclectic; she successfully combines pop/rock with everything from tango on &quot;Objection&quot; and Andean music on &quot;Whenever, Wherever&quot; to Middle Eastern music on &quot;Eyes Like Yours&quot; (which contains lyrics by Gloria Estefan and is an English translation of Shakira's late-'90s smash, &quot;Ojos AsÃƒÂ­&quot;). While nine of Laundry Service's 13 tracks are in English, four are in Spanish (including Spanish translations of &quot;Whenever, Wherever&quot; and &quot;Objection&quot;). And by including these four tracks, Shakira seems to be assuring her Spanish-speaking fans that she hasn't abandoned them. DÃƒÂ³nde EstÃƒÂ¡n los Ladrones? remains Shakira's most essential album, but Laundry Service is an excellent English-language debut for the South American vocalist. \n\n \nAmazon Review:\nColombian superstar Shakira's first English-language disc, Laundry Service, carries the pointed credit &quot;Entire Album Produced by Shakira.&quot; That might be a signal to U.S. fans who helped two of her previous discs go platinum under the media radar -- a sign that this planned breakthrough has more to offer than the input of a score of image makers and outside writers. And it does; even the occasional clunky lyric comes directly from her overflowing heart. Laundry Service's meld of danceable pop and rockier ideas and textures follows the similar path of the singer-songwriter's previous work. Indeed, for all its high-end production values, the record is ultimately one of the least glossy crossover vehicles imaginable. Despite an occasional lean toward Celine Dion territory (&quot;Underneath Your Clothes&quot;), it has a freshness that's sure to win over new listeners even after the first single, the sly &quot;Whenever, Wherever,&quot; has reached the saturation point. While still not fully formed as an artist, she's getting close to something of her own -- something that may flower after she dumps the vocal Alanis-isms. For now, it's still a pleasure to watch her grow.","torrent":{"xt":"urn:btih:99f4db5232688385ae5c073f3772684986a8d291","amp;dn":"%5B2001%5D+Shakira+-+Laundry+Service+%5BCDRip+-+flac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f4db5232688385ae5c073f3772684986a8d291","infoHashBuffer":{"type":"Buffer","data":[153,244,219,82,50,104,131,133,174,92,7,63,55,114,104,73,134,168,210,145]},"announce":[],"urlList":[]}}