{"title":"Vogue India - May 2016 (gnv64)","uid":14532043,"size":100407772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a747c7ea52007049a83b46f721c65b15557227b&amp;dn=Vogue+India+-+May+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1462454591,"description":"Vogue India - May 2016\r\nEnglish | 260 pages | True PDF | 95.7 mb\r\n\r\nBefore it's in fashion, it's in Vogue. Everything you need to know about fashion, trends, beauty, people and lifestyle, VOGUE India is your ultimate style guide. In these pages you’ll find the hottest, newest and latest from the world of fashion and beyond, both in India and from across the world, making it the must-have accessory for the modern, fashionable Indian woman.\r\n\r\n156 THE REAL DEAL\r\nAnushka Sharma is the queen of transformation. With a spectrum of new movies in the can this year, including one in which she plays a wrestler, she is ready to show her true grit, says Megha Mahindru. Photographed by Errikos Andreou. Styled by Anaita Shro\u001f Adajania\r\n188 MOODY BLUES\r\nStormy indigo. Delicate periwinkle. Regal sapphire. Refreshing turquoise. There’s no other colour in the\r\nspectrum that spans so many moods. For the heady days of summer, blue is the coolest colour. Photographed by Luis Monteiro. Styled by Anaita Shro\u001f Adajania\r\n166 STOP \u001b STARE\r\nFor many seasons now, the focus at fashion week has been on the ‘show outside the show’, with the streetstyle phenomenon setting o\u001f a social media frenzy like no other. What editors, models, It girls (and\r\nreal girls!) wear creates instant buzz, and though it may all seem e\u001f ortless, there’s a method to the madness. Mix and clash highstreet hits with luxe separates, and watch those fl ashbulbs pop. Photographed by Kiki Xue. Styled by Fabio Immediato\r\n184 A SELFIE WITH STEVE\r\nIt is a rare gift to retain the receptiveness of a curious traveller after 40 years of knowing. Is this what lies behind Magnum photographer Steve McCurry’s popular appeal and could his traveller’s eye help us\r\nsee ourselves better, asks Anindita Ghose. Photographed by Adil Hasan\r\n174 LEADERS OF THE PACK\r\nIt’s the season of the bold, brilliant and built-to-move super satchel. Gigi Hadid and Lily Aldridge take the brightest of the bunch on an energetic romp for spring. Photographed by Patrick Demarchelier. Styled by Tabitha Simmons.\r\n \nhttps://s32.postimg.org/m5635nwhh/Vogue_India_May_2016.jpg","torrent":{"xt":"urn:btih:9a747c7ea52007049a83b46f721c65b15557227b","amp;dn":"Vogue+India+-+May+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a747c7ea52007049a83b46f721c65b15557227b","infoHashBuffer":{"type":"Buffer","data":[154,116,124,126,165,32,7,4,154,131,180,111,114,28,101,177,85,87,34,123]},"announce":[],"urlList":[]}}