{"title":"50 Foot Wave - (Kristin Hersh) (mp3, flac)","uid":4430283,"size":225361678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b300d105740e1f4dedeb087253f06f941ea0b9d&amp;dn=50+Foot+Wave+-+%28Kristin+Hersh%29+%28mp3%2C+flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pas.sie.f.","files":34,"time":1223248617,"description":"*Please seed at least 2.0, that ain't that much 8) \n*More important, how are the people still downloading doing, how many seeders are\n left. Sometimes when yr done downloading ur already almost at or over yr\n seedlimit. Just change the limit and help out seeding a bit :) \n*U dont need to leave yr computer on the whole time. As long u make sure u pass it\n on ;)\n &lt;a href=&quot;\nhttp://www.4ad.com/50footwave&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.4ad.com/50footwave&lt;/a&gt;\nhttp://www.4ad.com/kristinhersh\nhttp://www.4ad.com/throwingmuses &lt;a href=&quot;\nhttp://www.discogs.com/artist/Kristin+Hersh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/artist/Kristin+Hersh&lt;/a&gt;\n\n\n50FOOTWAVE | 'FREE MUSIC' | Press Release\n\n50FOOTWAVE is proud to announce &quot;Free Music!&quot; -- a 5 song Ep of new studio recordings to be given away via the band's website www.50footwave.com/freemusic or  www.throwingmusic.com/freemusic as well as several partner sites including Archive.org and the sometimes controversial BitTorrent tracker DimeADozen.org\n\nThe band will be offering FLAC (Free Lossless Audio Codec) files as well as hi-resolution mp3 files. The band is also encouraging fans to seed BitTorrents and set up CD burning trees to ensure that people without time or technology may also receive the free music.\n\nThe tracks will include Creative Commons &quot;Some Rights Reserved&quot; licenses (for more info on Creative Commons, see http://www.creativecommons.org )\n\nThe band states its goal as simply to circumvent the 'money cycle' and get high quality (free) recordings into the hands of a maximum number of people for evaluation at their leisure.\n\nThe band's manager, Billy O'Connell, says, &quot;The capacity for reaching new ears with unknown music has become so diminished that we felt we had to try a new approach.  It has become prohibitively expensive to reach people via traditional marketing means (radio, press, retail promotion) - lately, CD distribution costs and even touring costs have gone through the roof.\n\n&quot;This project is simply attempting to tap the power of the network -- we're asking individuals for their enthusiasm rather than their money. It's an experiment we're eager to see play out.&quot;\n\nThe band's founder, Kristin Hersh, explains, &quot;Money has so polluted the music world that my overwhelming urge right now is to divorce money from recorded music. Over the last 2 years we've been relying on standard 'industry' channels to help us educate listeners about 50 Foot Wave and we've met resistance every step of the way -- caused by little other than money -- and to an extent I've never seen before.\n\n&quot;So we're sending free recordings off into the world to do their work. If people enjoy these songs and are excited by them, we ask that they share them with others. The music business is about fame and huge profits -- egos and greed -- music itself, is not.&quot;\n\n\n\nIf u like her and her music, please visit these sites: &lt;a href=&quot;\nhttp://www.throwingmusic.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.throwingmusic.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.kristinhersh.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kristinhersh.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://kristinhersh.cashmusic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kristinhersh.cashmusic.org/&lt;/a&gt;\n\nThrowingMusic Online Store http://72.47.219.54/store/\n\nother: &lt;a href=&quot;\nhttp://cashmusic.org/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cashmusic.org/about/&lt;/a&gt; &lt;a href=&quot;\nhttp://creativecommons.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://creativecommons.org&lt;/a&gt; &lt;a href=&quot;\nhttp://www.throwingmusic.com/freemusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.throwingmusic.com/freemusic/&lt;/a&gt;\n\n[quote]Sent by remulac1 2 hours ago\nkristin hersh cash music\nThanks so much for your post. I followed the links, downloaded and contributed. This is the way it should be. /remulac[/quote]\n\n2004 50 Foot Wave (mp3, 192)\n2005 Golden Ocean (mp3, vbr)\n2005 Free Music EP (flac) &lt;a href=&quot;\nhttp://www.throwingmusic.com/freemusic/FreeMusicText/FreeMusicFacts.txt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.throwingmusic.com/freemusic/FreeMusicText/FreeMusicFacts.txt&lt;/a&gt;\n\n\n\nThoughts On Sustainability\n by Kristin Hersh\n\nI often feel there is an inverse relationship between quality of output and material success in the music business. This is distressing, but not out of line with what I've come to expect. Throwing Muses would wander the halls of Warner Brothers back in the day, muttering, &quot;You don't have to suck in order to work here, but it helps.&quot;\n\nNow, however, the financial climate and current upheaval in the music business mean that musicians like me are genuinely poor investments for the traditional powers that be. We do not engage in lowest common denominator trendiness, and so don't warrant the expenses of marketing dollars and company overhead.\n\nOkay, I get that; this is a business. However, I believe that when you sell toothpaste, you should be selling a goo that helps prevent cavities and when you sell music, you should be selling sound that enriches the listener's inner life. There is today a twisted kind of natural selection in the entertainment industry -- a sort of &quot;survival of the blandest&quot; -- the result, I imagine, of mind-fucking marketing techniques, bandwagon appeal, hype. To me this stuff is ugly, not beautiful.\n\nGiven this, I can only assume that record labels are not for me. I've said it before -- I will always play music -- but in the past, it was a record company's job to make sure you heard that music. They sold their product; they had funded it, it was theirs to sell. How to sell music without them? I liken our situation to that of the family farmer's -- how can we keep from going under without going corporate?\n\nThis is what I think: we specialize -- we offer an organic product. It is lumpy and expensive and made with love and it can save you. It's the right thing to do. It isn't shiny or poisonous, which can be disconcerting to people who've been raised on shiny poison, but it's natural, it's high-end and we want you to eat it.\n\nTo that end, I think I need to engage in a grassroots kind of capitalism, choosing principles over profits, values over image, ideals over marketing. I have to create a permeable membrane between artist and listener -- I'm a craftsperson, after all. The church of the rock star that the music industry televangelists hawk has always been anathema to me anyway. This is about songs and sounds, nothing else.\n\nMusic is a tenuous profession in good times, hard times mean some of us disappear. I'm not looking for pity, but collaboration. Coming to you is the best way I can think of to continue being a musician.\n\nThe model is not new, it's akin to public radio's listener supported programming and Community Supported Agriculture's subscriptions to underwrite crops. In other words, music grows on trees, but money doesn't and I'm unwilling to suck in order to work here. Therein lies the value proposition. This little business will be interactive and intelligent; you will not be lied to, no shiny poison, no middle man.\n\nThe idea of relying on listeners, treating music as a cooperative, is humbling, yet interesting to me. This is a bit of a manifesto, I'm sorry, and now I'll shut up, but I wonder if we might be able to do this together","torrent":{"xt":"urn:btih:9b300d105740e1f4dedeb087253f06f941ea0b9d","amp;dn":"50+Foot+Wave+-+%28Kristin+Hersh%29+%28mp3%2C+flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b300d105740e1f4dedeb087253f06f941ea0b9d","infoHashBuffer":{"type":"Buffer","data":[155,48,13,16,87,64,225,244,222,222,176,135,37,63,6,249,65,234,11,157]},"announce":[],"urlList":[]}}