{"title":"A Guide to Kernel Exploitation: Attacking the Core","uid":8424402,"size":6537257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b3be96599de1be3eafb7a8a5d96f3abdca03464&amp;dn=A+Guide+to+Kernel+Exploitation%3A+Attacking+the+Core&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1367299014,"description":"Book Description\nPublication Date: September 15, 2010 | ISBN-10: 1597494860 | ISBN-13: 978-1597494861 | Edition: 1\nThe number of security countermeasures against user-land exploitation is on the rise. Because of this, kernel exploitation is becoming much more popular among exploit writers and attackers. Playing with the heart of the operating system can be a dangerous game: This book covers the theoretical techniques and approaches needed to develop reliable and effective kernel-level exploits and applies them to different operating systems (Linux, Solaris, Mac OS X, and Windows). Kernel exploits require both art and science to achieve. Every OS has its quirks and so every exploit must be molded to fully exploit its target. This book discusses the most popular OS families-UNIX derivatives, Mac OS X, and Windows-and how to gain complete control over them. Concepts and tactics are presented categorically so that even when a specifically detailed exploit has been patched, the foundational information that you have read will help you to write a newer, better attack or a more concrete design and defensive structure.\n\nCovers a range of operating system families - UNIX derivatives, Mac OS X, Windows\nDetails common scenarios such as generic memory corruption (stack overflow, heap overflow, etc.) issues, logical bugs and race conditions\nDelivers the reader from user-land exploitation to the world of kernel-land (OS) exploits/attacks, with a particular focus on the steps that lead to the creation of successful techniques, in order to give to the reader something more than just a set of tricks\n ","torrent":{"xt":"urn:btih:9b3be96599de1be3eafb7a8a5d96f3abdca03464","amp;dn":"A+Guide+to+Kernel+Exploitation%3A+Attacking+the+Core","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b3be96599de1be3eafb7a8a5d96f3abdca03464","infoHashBuffer":{"type":"Buffer","data":[155,59,233,101,153,222,27,227,234,251,122,138,93,150,243,171,220,160,52,100]},"announce":[],"urlList":[]}}