{"title":"BBC the Chronicles of Narnia 1988 S01E04 WS_NEW.avi","uid":5997008,"size":284922488,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9bd2055e59c5fba740722261a649302f704ac49a&amp;dn=BBC+the+Chronicles+of+Narnia+1988+S01E04+WS_NEW.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wulf659","files":1,"time":1291058324,"description":"The Chronicles of Narnia is a series of seven fantasy novels for children written by C. S. Lewis. It is considered a classic of children's literature and is the author's best-known work, having sold over 100 million copies in 47 languages. Written by Lewis between 1949 and 1954, illustrated by Pauline Baynes and published in London between October 1950 and March 1956, The Chronicles of Narnia has been adapted several times, complete or in part, for radio, television, stage, and cinema. In addition to numerous traditional Christian  themes, the series borrows characters and ideas from Greek and Roman mythology, as well as from traditionaland Irish fairy tales.\n\nThe Chronicles of Narnia presents the adventures of children who play central roles in the unfolding history of the fictional realm of Narnia, a place where animals talk, magic is common, and good battles evil. Each of the books (with the exception of The Horse and His Boy) features as its protagonists children from our world who are magically transported to Narnia, where they are called upon by the lion Aslan to help Narnia.","torrent":{"xt":"urn:btih:9bd2055e59c5fba740722261a649302f704ac49a","amp;dn":"BBC+the+Chronicles+of+Narnia+1988+S01E04+WS_NEW.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd2055e59c5fba740722261a649302f704ac49a","infoHashBuffer":{"type":"Buffer","data":[155,210,5,94,89,197,251,167,64,114,34,97,166,73,48,47,112,74,196,154]},"announce":[],"urlList":[]}}