{"title":"G. B. Shaw - Intelligent Woman's Guide to Socialism ... (PDF)","uid":11784394,"size":12414446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cdda653c38af259e06ee9558a379ba672d4e10d&amp;dn=G.+B.+Shaw+-+Intelligent+Woman%27s+Guide+to+Socialism+...+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":1,"time":1427692895,"description":"George Bernard Shaw - THE INTELLIGENT WOMAN'S GUIDE TO SOCIALISM AND CAPITALISM (Brentano's, 1928).\n\n\nDescription:\n\nA work of non-fiction by Irish playwright George Bernard Shaw. The book employs socialist and Marxist thought. It was written in 1928, and later re-released as the first Pelican Book in 1937. The dust jacket artwork for the English and American first editions was by British artist and sculptor Eric Kennington.\n\nShaw examines various socialist ideas, including the issue of private property under socialism, population control, the difficulty creating of non-market-based means to ascribe value to human activities, and the problem of wealth distribution. He explores Marxist concepts such as surplus value along with the ideas of non-Marxist socialist thinkers such as Henry George.\n\nIn 2014 this book appeared on a Top 10 Feminist Books list in The Guardian, and there's a fine article on the book, also in The Guardian, by Polly Toynbee.\n\n\nNB: This is the first American edition. The later Penguin edition added two chapters -- one on &quot;Sovietism&quot; and one on &quot;Fascism&quot; and was retitled to reflect the changes.\n\n----\n\nThis PDF file is reprocessed from an older scan","torrent":{"xt":"urn:btih:9cdda653c38af259e06ee9558a379ba672d4e10d","amp;dn":"G.+B.+Shaw+-+Intelligent+Woman%27s+Guide+to+Socialism+...+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cdda653c38af259e06ee9558a379ba672d4e10d","infoHashBuffer":{"type":"Buffer","data":[156,221,166,83,195,138,242,89,224,110,233,85,138,55,155,166,114,212,225,13]},"announce":[],"urlList":[]}}