{"title":"A Grand Army of Black Men: Letters from African-American Soldier","uid":8840398,"size":7295216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d0871f975278402cd23c0e561e15f00975810b8&amp;dn=A+Grand+Army+of+Black+Men%3A+Letters+from+African-American+Soldier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1377227636,"description":"A Grand Army of Black Men: Letters from African-American Soldiers in the Union Army 1861-1865 (Cambridge Studies in American Literature and Culture) \n\n\n\nPublication Date: November 27, 1992 | ISBN-10: 0521439981 \n| ISBN-13: 978-0521439985 | filetype: pdf\n\n\n\nThe Civil War stands vivid in the collective memory of the American public. There has always been a profound interest in the subject, and specifically of Blacks' participation in and reactions to the war and the war's outcome. Almost 200,000 African-American soldiers fought for the Union in the Civil War. Although most were illiterate ex-slaves, several thousand were well educated, free black men from the northern states. The 129 letters in this collection were written by black soldiers in the Union army during the Civil War to black and abolitionist newspapers. They provide a unique expression of the black voice that was meant for a public forum. The letters tell of the men's experiences, their fears, and their hopes. They describe in detail their army days--the excitement of combat and the drudgery of digging trenches. Some letters give vivid descriptions of battle; others protest racism; still others call eloquently for civil rights. Many describe their conviction that they are fighting not only to free the slaves but to earn equal rights as citizens. These letters give an extraordinary picture of the war and also reveal the bright expectations, hopes, and ultimately the demands that black soldiers had for the future--for themselves and for their race. As first-person documents of the Civil War, the letters are strong statements of the American dream of justice and equality, and of the human spirit.\n\n\nReview\n\n&quot;...a significant addition to the small but growing body of literature speaking directly to the African Americans' Civil War.&quot; Richard M. Reid, Georgia Historical Quarterly\n\n&quot;This volume is a substantial and important addition to the growing literature of African-American involvement in the Civil War.&quot; Richard Blackett, Journal of American History\nBook Description\nWritten by African-American soldiers in the Civil War to black and abolitionist newspapers, this collection of 129 letters represents a strong statement for the American dream of justice and equality as well as a unique expression of black voices within the public forum. \n\n\n\nSeries: Cambridge Studies in American Literature and Culture (Book 63)\nPaperback: 328 pages\nPublisher: Cambridge University Press (November 27, 1992)\nLanguage: English\nISBN-10: 0521439981\nISBN-13: 978-0521439985\n\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Grand-Army-Black-Men-African-American/dp/0521439981/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Grand-Army-Black-Men-African-American/dp/0521439981/&lt;/a&gt;\n\n\n\n\n\n\nTags: US, united states, america, united states of america, military, army, pentagon, dod, 10, 10th cavalry, fort, leavenworth, kansas, black, negro, negro cavalry, 9th, 10th, 24th, 25th, black, cavalry, buffalo, buffalo soldiers, union, black union, civil war, 1866, officer, Charles Young, Charles, Young, west point, oppression, racism, segregation, battle military, history, political, science, horse, horses, equine, west, Wild West, Phillipines, Mexico, black, cowboy, Hispaniola, Liberia, Sequoia, National, Park, Brian, Shellum,Booker, Washington, black servicemen, black soldier, soldier, duty, active, active duty, cadet, west point cadet, regiment, colonel, full, bird, Spingarn, Medal, NAACP, General, Colin, T.,Powell, Wilberforce University, South African AME , ANC, umkhonto we sizwe, Nelson Mandela, Young, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety,war, peace, diplomacy, command, military, race, relations, racism, black proffesional,racism, thought, logic, sociology, psychology, ethics, african, african american studies, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, \n","torrent":{"xt":"urn:btih:9d0871f975278402cd23c0e561e15f00975810b8","amp;dn":"A+Grand+Army+of+Black+Men%3A+Letters+from+African-American+Soldier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0871f975278402cd23c0e561e15f00975810b8","infoHashBuffer":{"type":"Buffer","data":[157,8,113,249,117,39,132,2,205,35,192,229,97,225,95,0,151,88,16,184]},"announce":[],"urlList":[]}}