{"title":"Sicko (2007) DVD-R","uid":4525010,"size":4676780188,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9df939887dda86b1843fa410c167065425696fe1&amp;dn=Sicko+%282007%29+DVD-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vdsred","files":1,"time":1227319190,"description":"Full Rip from DVD\n\nDVD\nAudio Languages:\n-English 2.0\n-Portuguese (BR) 2.0\n\nSubtitles:\n-English\n-Portuguese (BR)\n\nA documentary comparing the highly profitable American health care industry to other nations, and HMO horror stories.\nWriter/producer Michael Moore interviews Americans who have been denied treatment by our health care insurance companies -- companies who sacrifice essential health services in order to maximize profits. The consequences for the individual subscribers range from bankruptcy to the unnecessary deaths of loved ones.\n\nMoore then looks at universal free health care systems in Canada, France, Britain, and Cuba, debunking all the fears (lower quality of care, poorer compensation for doctors, big-government bureaucracy) that have been used to dissuade Americans from establishing such a system here. The roots of those health care systems are explored, and our failure to establish free health here care is traced to a) President Richard Nixon&amp;#039;s deceptive support of the then-emerging HMOs pursuing huge profits and b) subsequent pressures for Congress to sacrifice sound health care in favor of corporate profit.\n\nA group of Americans who became ill from volunteering at 911 Ground Zero, but were refused health coverage for their illnesses, are ferried by Moore to Cuba, where they receive the top-rate, free care one would hope they&amp;#039;d get here at home.\n\nIn his interviews, historical reportage, and typical sarcastic wit, Moore soundly condemns American health insurance companies and pharmaceutical companies, as well as the politicians who have been paid millions to do their bidding. He makes the case that there is something wrong with Americans that we cannot learn from the successes of other countries in providing better quality-of-health than we enjoy in the USA.","torrent":{"xt":"urn:btih:9df939887dda86b1843fa410c167065425696fe1","amp;dn":"Sicko+%282007%29+DVD-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df939887dda86b1843fa410c167065425696fe1","infoHashBuffer":{"type":"Buffer","data":[157,249,57,136,125,218,134,177,132,63,164,16,193,103,6,84,37,105,111,225]},"announce":[],"urlList":[]}}