{"title":"[DJVU] [2004] Hegel's Preface to the Phenomenology of Spirit","uid":6452173,"size":5180205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e2f1627f1e2c4f5d01f20de56f3a88ba57f8253&amp;dn=%5BDJVU%5D+%5B2004%5D+Hegel%5C%27s+Preface+to+the+Phenomenology+of+Spirit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307467137,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\n&quot;Yovel's translation is impressively accurate, uses the plainest English possible, and cleverly breaks up Hegel's long sentences into shorter, more readable ones without distorting the original meaning. But the real contribution to the literature is Yovel's commentary and introduction. He brings impressive exegetical skill and erudition to bear in a way that consistently throws great light on Hegel's text.&quot; - Michael N. Forster, University of Chicago\n\nThis is a new translation, with running commentary, of what is perhaps the most important short piece of Hegel's writing. The Preface to Hegel's first major work, the Phenomenology of Spirit, lays the groundwork for all his other writing by explaining what is most innovative about Hegel's philosophy.\n\nThis new translation combines readability with maximum precision, breaking Hegel's long sentences and simplifying their often complex structure. At the same time, it is more faithful to the original than any previous translation.\n\nThe heart of the book is the detailed commentary, supported by an introductory essay. Together they offer a lucid and elegant explanation of the text and elucidate difficult issues in Hegel, making his claims and intentions intelligible to the beginner while offering interesting and original insights to the scholar and advanced student. The commentary often goes beyond the particular phrase in the text to provide systematic context and explain related topics in Hegel and his predecessors (including Kant, Spinoza, and Aristotle, as well as Fichte, Schelling, HÃƒÂ¶lderlin, and others).\n\nYovel refrains from playing down (as many interpreters do today) those aspects of Hegel's thought that are less acceptable in our time, and abstains from mixing his own philosophical preferences with his reading of Hegel's text. His approach is faithful to the historical Hegel while reconstructing Hegel's ideas within their own context.","torrent":{"xt":"urn:btih:9e2f1627f1e2c4f5d01f20de56f3a88ba57f8253","amp;dn":"%5BDJVU%5D+%5B2004%5D+Hegel%5C%27s+Preface+to+the+Phenomenology+of+Spirit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2f1627f1e2c4f5d01f20de56f3a88ba57f8253","infoHashBuffer":{"type":"Buffer","data":[158,47,22,39,241,226,196,245,208,31,32,222,86,243,168,139,165,127,130,83]},"announce":[],"urlList":[]}}