{"title":"Virtua Tennis Challenge ipad.ipod.iphone","uid":7322314,"size":300202512,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:9ecdc47c447a077e7f83cdb135b462f9c61fce2e&amp;dn=Virtua+Tennis+Challenge+ipad.ipod.iphone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cad40","files":1,"time":1338656036,"description":"Description\nSEGA challenges you to take your best shot on the all new Virtua Tennis Challenge!\n\nVirtua Tennis, the World's leading tennis game franchise, is available for the first time on smartphones with the new Virtua Tennis Challenge. Slice, lob and hit your best top spin as you take on the world's best and compete against 50 players in 18 stadiums around the globe. Build concentration by making plays that match your player's style; unleashing a super shot that will make your opponent sweat. Enjoy hours of game play through different modes, shots and courts. \n\nFeatures: \n\nSWING THE GAME YOUR WAY \nUnleash top spins, slice shots, lobs and drop shots through different touch gestures. Choose from 3 additional control schemes - Virtual Pad, Arcade and Game Pad \n\nFEEL THE HEAT \nAdjust your shot in different stadiums and environments as you compete on clay, grass, hard or indoor courts\n\nDOUBLE UP THE FUN \nCompete in Singles or Doubles challenges \n\nMULTIPLE MODES \nSPT World Tour: Pick a customizable character to compete through full seasons of competition around the globe. Earn money by progressing through matches to buy your way into new tournaments. Each real world day offers new challenges. \n\nExhibition Match: Dive into the game and select from any unlocked courts and characters in single or doubles mode. \nMultiplayer: Challenge your friends online over Wifi or face to face over Bluetooth connectivity \n\nQuick Match Mode: Itching for a one minute dose of Virtua Tennis? Play fast singles challenges to increase your ranking \n\nTraining Mode: Learn from the pros in this practice mode by running through drills","torrent":{"xt":"urn:btih:9ecdc47c447a077e7f83cdb135b462f9c61fce2e","amp;dn":"Virtua+Tennis+Challenge+ipad.ipod.iphone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ecdc47c447a077e7f83cdb135b462f9c61fce2e","infoHashBuffer":{"type":"Buffer","data":[158,205,196,124,68,122,7,126,127,131,205,177,53,180,98,249,198,31,206,46]},"announce":[],"urlList":[]}}