{"title":"WW2 Battles DVD 13 Engeland NL Subs","uid":9079242,"size":2161967104,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9f853aa931c941014c0b0cd0ccc9989fd3e458ed&amp;dn=WW2+Battles+DVD+13+Engeland+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mpkeuter","files":1,"time":1382315001,"description":"The Battle of Britain (German: Luftschlacht um England, literally &quot;Air battle for England&quot;) is the name given to the Second World War air campaign waged by the German Air Force (Luftwaffe) against the United Kingdom during the summer and autumn of 1940. The name is derived from a famous speech delivered by Prime Minister Winston Churchill in the House of Commons: &quot;...the Battle of France is over. I expect that the Battle of Britain is about to begin.&quot;[14]\n\nThe Battle of Britain was the first major campaign to be fought entirely by air forces,[15] and was also the largest and most sustained aerial bombing campaign to that date. The objective of the campaign was to gain air superiority over the Royal Air Force (RAF), especially Fighter Command. From July 1940, coastal shipping convoys and shipping centres, such as Portsmouth, were the main targets; one month later the Luftwaffe shifted its attacks to RAF airfields and infrastructure. As the battle progressed the Luftwaffe also targeted aircraft factories and ground infrastructure. Eventually the Luftwaffe resorted to attacking areas of political significance and using terror bombing strategy.[nb 10]\n\nThe failure of Germany to achieve its objectives of destroying Britain's air defences, or forcing Britain to negotiate an armistice or an outright surrender, is considered its first major defeat and a crucial turning point in the Second World War.[17] By preventing Germany from gaining air superiority, the battle ended the threat that Hitler would launch Operation Sea Lion, a proposed amphibious and airborne invasion of Britain.\n\nAudio - English\nSubs - NL","torrent":{"xt":"urn:btih:9f853aa931c941014c0b0cd0ccc9989fd3e458ed","amp;dn":"WW2+Battles+DVD+13+Engeland+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f853aa931c941014c0b0cd0ccc9989fd3e458ed","infoHashBuffer":{"type":"Buffer","data":[159,133,58,169,49,201,65,1,76,11,12,208,204,201,152,159,211,228,88,237]},"announce":[],"urlList":[]}}