{"title":"Coast to Coast AM January 07 2013","uid":7997651,"size":57566567,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a12e254ad67f675f3d03bb8b803a161907213b39&amp;dn=Coast+to+Coast+AM+January+07+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357662281,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-07-13\nHost: \tGeorge Knapp\nGuests: \tBill Sardi, Robert Mazur\n\nIn the first half, George Knapp welcomed Robert Mazur, who as an undercover federal agent infiltrated the shadowy world of international money laundering, and drug cartels. We're not very successful at stopping money laundering at its highest level, he noted, citing statistics from the Dept. of Justice asset forfeitures-- about $1 billion in assets are seized in a year, but illegal drug organizations are generating about $400 billion in revenue. It has also come to light that terrorist organizations such as Hezbollah have aligned themselves with drug cartels &quot;to not only provide free passage for drugs and money, but also to be involved in the profits of it,&quot; he reported.\n\nThe banks are the critical factor in the &quot;equation of corruption&quot; behind the cartels-- &quot;without their help the mountains of cash that are created from the sale of drugs would not be turned into the legitimate appearing businesses...without the help of these banks the strength of these drug organizations would be dwarfed,&quot; he said. HSBC bank was at one time involved in the &quot;bulk bank note business,&quot; buying and selling $300-400 billion in currency in various parts of the world known for the drug trade, he detailed, adding that shipments of cash were at times large enough to fill a 40 ft. freight container. Eventually, HSBC admitted mistakes, and was fined and given deferred prosecution. Banks such as Wachovia, Bank of Atlantic, American Express, Union Bank, Lloyds Bank, Credit Suisse, and Barclays were all fined for improprieties related to money handling, yet not one banker ever went to jail, he lamented.\n\n-------------------------------------\n\nIn the latter half, consumer advocate and natural health expert, Bill Sardi, suggested natural remedies for various ailments, which he believes the medical and pharmaceutical establishment are trying to keep hidden. In response to his previous C2C show appearance, he prepared a special follow-up report on various remedies he'd discussed including a natural extract from the Asian raisin tree (marketed as BluCetin) that is said to reduce alcohol cravings, lower blood alcohol levels, and reduce hangover symptoms. Eye specialist Dr. Stuart Richer joined the conversation for a segment to discuss how nutritional supplements are being successfully used to curb macular degeneration and vision problems.\n\nSardi spoke about how people don't get enough natural Vitamin D, especially in the winter, and the importance of supplementing with it. For people going into surgery or the hospital, we could dramatically cut mortality and infection rates if they would take Vitamin D, as it overcomes antibiotic resistant bacteria, he contended. He also recommended resveratrol for a host of issues, and pumpkin seed oil for prostrate problems. &quot;Let's get ahead and have patient-driven medicine instead of doctor-driven medicine or Big Pharma-driven medicine,&quot; he declared.\nWebsite(s):\n\n    naturalhealthlibrarian.com\n    the-infiltrator.com\n\nBook(s):\n\n    Cancer-Proof Humans\n    The New Truth About Vitamins and Minerals\n    How to Live 100 Years Without Growing Old\n    The Infiltrator\n\n","torrent":{"xt":"urn:btih:a12e254ad67f675f3d03bb8b803a161907213b39","amp;dn":"Coast+to+Coast+AM+January+07+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a12e254ad67f675f3d03bb8b803a161907213b39","infoHashBuffer":{"type":"Buffer","data":[161,46,37,74,214,127,103,95,61,3,187,139,128,58,22,25,7,33,59,57]},"announce":[],"urlList":[]}}