{"title":"Fleeing Hitler: France 1940 - Hanna Diamond","uid":8598738,"size":3312001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a16b95f4cd49ed930c62fdb7b5aeca9e85c895f8&amp;dn=Fleeing+Hitler%3A+France+1940+-+Hanna+Diamond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ALG3RiON","files":1,"time":1371828430,"description":"[img]http://ecx.images-amazon.com/images/I/51uzvoshTtL.jpg[/img]\n\nAs Hitler's victorious armies approached Paris, panic gripped the city and the roads heading south filled with millions of French citizens, fleeing for their lives, with scant supplies and often no destination in mind. All hoped, as famed author Simone de Beauvoir wrote in her diary, &quot;not to be taken like a rat in Occupied Paris.&quot; In Fleeing Hitler, historian Hanna Diamond paints a gripping picture of the harrowing escape from Paris, highlighting the hardships people suffered in their desperate flight, and underscoring the impact this exodus had on life under Vichy rule. Using eyewitness accounts, memoirs, and diaries, Diamond shows how this ordeal became for civilians and soldiers alike the defining experience of the war. She tells how, in the Paris region alone, close to four million people left their homes and fled south, swelling the numbers of refugees until is was impossible to direct the flow of humanity. The result was total chaos with an enormous price to pay in terms of human misery and suffering. Many lost their lives as this vast caravan of predominantly women, children, and the elderly faced truly harsh conditions, and even starvation. Then, after the German offer of peace, as the traumatized population returned home, preoccupied by the desire for safety and bewildered by the unexpected turn of events, they put their faith in Marshall Pé´¡in who was able to establish his collaborative Vichy regime largely unopposed, while the Germans consolidated their occupation. The first time this important story has been told in English, Fleeing Hitler captures in moving detail the devastating flight and early days of occupation after the fall of France. ","torrent":{"xt":"urn:btih:a16b95f4cd49ed930c62fdb7b5aeca9e85c895f8","amp;dn":"Fleeing+Hitler%3A+France+1940+-+Hanna+Diamond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a16b95f4cd49ed930c62fdb7b5aeca9e85c895f8","infoHashBuffer":{"type":"Buffer","data":[161,107,149,244,205,73,237,147,12,98,253,183,181,174,202,158,133,200,149,248]},"announce":[],"urlList":[]}}