{"title":"Super.WinPE.Plus.2004.v6 - Windows Recovery Boot CD","uid":3709137,"size":731205632,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a183ace429253f8e2c16ec59c4f5f8770afb3ec5&amp;dn=Super.WinPE.Plus.2004.v6+-+Windows+Recovery+Boot+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Wierdy1024","files":1,"time":1181349494,"description":"This very good recovery CD has slowly disappeared off the net, and so far nothing better than it has come around.  Although there are now vista boot CD&amp;#039;s, they are still fairly limited  (no start menu/windows explorer/internet explorer), and require a lot of ram.\n\nThis CD is great for fixing any computer where windows won&amp;#039;t start, or if it&amp;#039;s full of virusses, or if you want to back up data onto a usb stick from a faulty pc, or even for just browsing the NET anonymously (no cookies etc.)\n\nThe way it works is you burn it to a CD, and then turn the computer on with the CD in the drive.  When you get a menu, select option 5 (the best one), and after a few mins you&amp;#039;ll get a fresh windows XP desktop, preloaded with useful applications.  If you like, you can connect to a network to copy files to or from another pc or browse the internet.  The CD is easy to use for beginners wanting to recover data to a USB stick, but also for more advanced users needing to modify registry entries in a broken system, edit partitions, remove virusses, fix disk corruption, replace or remove drivers etc.\n\nIt includes hundreds of useful apps, like AV scanners, FTP clients, Remote desktop/vnc/telnet/ssh etc. Partition managers, isobuster, winrar, various web browsers, some network diagnostic tools, the real windows explorer shell (as well as other custom explorer-like shells like nu2menu for running on a low memory system) and a load more.\n\nThe disk has built in drivers for pretty much anything, although you can load more drivers during startup by pressing F6 immediatly after the menu and loading them from a floppy - like for example SATA or RAID drivers.  USB flash drives etc. work straight away.\n\nIt also has &quot;floppy emulation&quot; on the cd so you can boot into NTFSDos, and a host of other dos tools.\n\nThis has powerquest partition magic (windows and dos versions), ERDC, and a ramdisk for storing files.\n\n\nBasicly in a nutshell, this disk has enough tools on to recover data and fix any windows system provided you&amp;#039;re reasonably competant with computers.  No more need to swap hard disks around to recover data on borked systems!","torrent":{"xt":"urn:btih:a183ace429253f8e2c16ec59c4f5f8770afb3ec5","amp;dn":"Super.WinPE.Plus.2004.v6+-+Windows+Recovery+Boot+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a183ace429253f8e2c16ec59c4f5f8770afb3ec5","infoHashBuffer":{"type":"Buffer","data":[161,131,172,228,41,37,63,142,44,22,236,89,196,245,248,119,10,251,62,197]},"announce":[],"urlList":[]}}