{"title":"Evidence vs.Proof - Paul Taylor","uid":11772874,"size":1498343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1e52ba9183801ecfb9291a774692adadad4c3c9&amp;dn=Evidence+vs.Proof+-+Paul+Taylor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427145631,"description":"Having trouble distinguishing between evidence and faith? Have you been caught off guard while witnessing when atheists use these terms? Read Paul Taylor?s Evidence vs. Proof eBook which clearly differentiates the truths of each, and how to best use them to defend your faith in our Creator?GOD!\n\nAt the successful Proof of God Conference in October 2012, Paul Taylor delivered a message on the biblical use of evidences in presuppositional apologetics. In this Creation Today Commentary, Paul has committed these thoughts to an eBook.\n\n\nAbout the author:\nPaul Taylor was born quite young in 1961 in Ashton-under-Lyne, which was then in Lancashire, England, though under county reorganization in the 1970s, it became part of Tameside, Greater Manchester. He grew up, eventually, but before he did, he was educated at Chetham?s School of Music, Manchester?originally hoping to become a concert pianist.\nIn 1979, he went up to Nottingham University to read Chemistry. he stayed on, after graduating, and also got his Post Graduate Certificate in Education and then became a schoolteacher.\nDuring his first teaching post?1983-1986 at Droylsden High School?he joined forces with four other teachers and they wrote a successful school musical called Secrets.\nHe became a Christian in 1977, and was baptized in 1982. He haa regularly preached and written on a variety of subjects, especially music in worship and creationism. He's the author of several books","torrent":{"xt":"urn:btih:a1e52ba9183801ecfb9291a774692adadad4c3c9","amp;dn":"Evidence+vs.Proof+-+Paul+Taylor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e52ba9183801ecfb9291a774692adadad4c3c9","infoHashBuffer":{"type":"Buffer","data":[161,229,43,169,24,56,1,236,251,146,145,167,116,105,42,218,218,212,195,201]},"announce":[],"urlList":[]}}