{"title":"Censored 2013: The Top Censored Stories  of 2011-2012","uid":8303562,"size":3625807,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a22d779c177b4ca538970fef5b1d57a5fcb23260&amp;dn=Censored+2013%3A+The+Top+Censored+Stories++of+2011-2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364319233,"description":"\nMickey Huff, Khalil Bendib, Project Censored, &quot;Censored 2013: The Top Censored Stories and Media Analysis of 2011-2012&quot;\nISBN: 1609804228 | 2012 | EPUB\n\nEvery year since 1976, Project Censored, our nation's oldest news-monitoring group--a university-wide project at Sonoma State University founded by Carl Jensen, directed for many years by Peter Phillips, and now under the leadership of Mickey Huff--has produced a Top-25 list of underreported news stories and a book, Censored, dedicated to the stories that ought to be top features on the nightly news, but that are missing because of media bias and self-censorship.\n\nSeven Stories Press has been publishing this yearbook since 1994, featuring the top stories listed democratically in order of importance according to students, faculty, and a national panel of judges. Each of the top stories is presented at length, alongside updates from the investigative reporters who broke the stories.\n\nBeyond the Top-25 stories, additional chapters delve further into timely media topics: The Censored News and Media Analysis section provides annual updates on Junk Food News and News Abuse, Censored Deja Vu, signs of hope in the alternative and news media, and the state of media bias and alternative coverage around the world. In the Truth Emergency section, scholars and journalists take a critical look at the US/NATO military-industrial-media empire. And in the Project Censored International section, the meaning of media democracy worldwide is explored in close association with Project Censored affiliates in universities and at media organizations all over the world.","torrent":{"xt":"urn:btih:a22d779c177b4ca538970fef5b1d57a5fcb23260","amp;dn":"Censored+2013%3A+The+Top+Censored+Stories++of+2011-2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22d779c177b4ca538970fef5b1d57a5fcb23260","infoHashBuffer":{"type":"Buffer","data":[162,45,119,156,23,123,76,165,56,151,15,239,91,29,87,165,252,178,50,96]},"announce":[],"urlList":[]}}