{"title":"Comment le peuple Palestinien fut invente (G. Milliere)","uid":6843597,"size":15893464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a28a0ec53b930931d186d670ed5c36e6ef92fb98&amp;dn=Comment+le+peuple+Palestinien+fut+invente+%28G.+Milliere%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"yamilak45","files":-1,"time":1322243017,"description":"Le petit livre que Guy Milliere et David Horowitz vient de faire paraÃƒÂ®tre est indispensable et salubre. Il est bref, et c est ce qui fait sa force.\n\nUne preface d une dizaine de pages pose des notions essentielles et des questions indispensables : pourquoi a-t-on laisse se falsifier a ce point l histoire d IsraÃƒÂ«l, du mouvement &quot; palestinien &quot; et du Proche-Orient ? comment la propagande a-t-elle pu l emporter sur les faits ? Milliere propose une reponse : depuis quarante ans, Israeliens et amis d IsraÃƒÂ«l se sont battus sur le terrain de l adversaire, de facon defensive, en se contentant de refuter les mensonges un a un, de maniere souvent dispersee. Il est urgent, ajoute-t-il, de quitter ce terrain dangereux et de passer a l offensive en remettant la verite a sa place. Et celle-ci est simple a enoncer : &quot; les Juifs faisant renaÃƒÂ®tre IsraÃƒÂ«l n ont pris les terres d aucun peuple et d aucune population &quot;. Puis : &quot; nul n a parle de &quot; peuple palestinien &quot; avant que la notion soit inventee, dans la deuxieme moitie des annees 1960, et la population arabe &quot; palestinienne &quot; a ete tres largement constituee d immigrants arabes venus des pays voisins et attires par le dynamisme cree par les immigrants juifs &quot;.\n\nLa preface vient introduire un texte d un grand ecrivain juif Americain, David Horowitz. Ce texte a un titre qui pose le principe d une demonstration : &quot; Pourquoi IsraÃƒÂ«l est la victime au Proche-Orient, et les Arabes des agresseurs indefendables &quot;. La lecture achevee, la demonstration est claire, precise, magistrale.\n\nVient ensuite un texte de Guy Milliere exposant la situation aujourd hui, et les raisons pour lesquelles l ensemble de l engrenage mis en place depuis le milieu des annees 1960 et &quot; l invention du peuple palestinien &quot; est une imposture dangereuse qui nuit a IsraÃƒÂ«l, mais qui nuit aussi aux populations arabes de Judee-Samarie et de Gaza qui se sont trouvees transformees ainsi en arme de destruction massive d IsraÃƒÂ«l.\n\nGuy Milliere et David Horowitz proposent des moyens de liberer IsraÃƒÂ«l, qui n a aucune responsabilite dans cette situation, sinon d avoir, parfois, cede a des illusions, et des moyens de liberer aussi les populations arabes concernees qui sont pour l heure sous le joug d une dictature a deux tÃƒÂªtes, Hamas et Autorite Palestinienne, et meritent mieux que d ÃƒÂªtre une arme de destruction massive.\n\nC est la un livre a mettre d urgence entre toutes les mains, et dont il faut garder des passages en memoire pour repondre a tous les &quot; antisionistes &quot;. Plus ce livre sera diffuse, plus l action proposee par Guy Milliere pourra prendre forme. Il faut passer a l offensive. Ce livre est un moyen extraordinaire d aller en cette direction. Il faut remettre la verite a sa place : ce livre remet pleinement la verite a sa place.","torrent":{"xt":"urn:btih:a28a0ec53b930931d186d670ed5c36e6ef92fb98","amp;dn":"Comment+le+peuple+Palestinien+fut+invente+%28G.+Milliere%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a28a0ec53b930931d186d670ed5c36e6ef92fb98","infoHashBuffer":{"type":"Buffer","data":[162,138,14,197,59,147,9,49,209,134,214,112,237,92,54,230,239,146,251,152]},"announce":[],"urlList":[]}}