{"title":"Superman - World Without Superman Story-Arc","uid":5448906,"size":343695014,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a306e4a8f2cb9b0b7093173b3229443425e1c492&amp;dn=Superman+-+World+Without+Superman+Story-Arc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":-1,"time":1269111543,"description":"Following the events of the &quot;Superman: New Krypton&quot; story-arc, Alura In-Ze creates an artificial planet called New Krypton in an attempt to get away from Earth following the death of Zor-El, and releases General Zod and his subordinates from the Phantom Zone. In response, Earth's governments outlaw all Kryptonians except for Superman. In an effort to prevent any further Human/Kryptonian confrontations, Superman relocates to New Krypton to help his people rebuild their society. While assuming this duty, the protection of Metropolis and Earth is left in the hands of other heroes such as Supergirl, Guardian, Mon-El, Flamebird  and Nightwing. Unknown to Superman and his allies, General Sam Lane, Superman's presumed dead father-in-law, heads a secret government project designed to destroy the &quot;threat&quot; of the Kryptonians, even if it means provoking a conflict. At his disposal are some of Superman's oldest enemies, including arch foes Lex Luthor  and Brainiac.\n\nWritten by Greg Rucka and James Robinson, with art by Sidney Teles and Renato Guedes.\n\nPlease note that &quot;Superman: World of New Krypton&quot; has not been included as it can be read as a stand-alone mini-series. I will upload &quot;Superman: World of New Krypton&quot; very soon.\n\nTracked by http://comicpirates.info\n","torrent":{"xt":"urn:btih:a306e4a8f2cb9b0b7093173b3229443425e1c492","amp;dn":"Superman+-+World+Without+Superman+Story-Arc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a306e4a8f2cb9b0b7093173b3229443425e1c492","infoHashBuffer":{"type":"Buffer","data":[163,6,228,168,242,203,155,11,112,147,23,59,50,41,68,52,37,225,196,146]},"announce":[],"urlList":[]}}