{"title":"Shake Hands with the Devil (James Cagney) [1959] .avi","uid":4736715,"size":634421724,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a313f60ee143eb4e6428d85f064b19d7b9ae91be&amp;dn=Shake+Hands+with+the+Devil+%28James+Cagney%29+%5B1959%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1235363240,"description":"\tJames Cagney\t... \tSean Lenihan\n\tDon Murray\t... \tKerry O'Shea\n\tDana Wynter\t... \tJennifer Curtis\n\tGlynis Johns\t... \tKitty Brady\n\tMichael Redgrave\t... \tThe General\n\tSybil Thorndike\t... \tLady Fitzhugh\n\nIn 1921 Dublin, the IRA battles the &quot;Black &amp; Tans,&quot; special British forces given to harsh measures. Irish-American medical student Kerry O'Shea hopes to stay aloof, but saving a wounded friend gets him outlawed, and inexorably drawn into the rebel organization...under his former professor Sean Lenihan, who has &quot;shaken hands with the devil&quot; and begun to think of fighting as an end in itself. Complications arise when Kerry falls for a beautiful English hostage, and the British offer a peace treaty that is not enough to satisfy Lenihan. \n\nThis is without question a superbly well-made film on &quot;The Troubles&quot;, back at a time when the IRA was in full bloom. As has been noted here, everything works well - the excellent cinematography (with beautiful vistas of the Irish countryside), a superb cast, great direction, and a richly textured script. All the characters are well drawn and fleshed out. Cagney's work here as the fanatic physician/seditionist is among his best screen portrayals. One suspects at first that the film is going to be an outright paean to the IRA, but as the film progresses, the murderous and fanatic side of their work is made clear, and we are left with a complex and ambiguous picture. I cannot recommend this film highly enough; it is simply not to be missed. ","torrent":{"xt":"urn:btih:a313f60ee143eb4e6428d85f064b19d7b9ae91be","amp;dn":"Shake+Hands+with+the+Devil+%28James+Cagney%29+%5B1959%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a313f60ee143eb4e6428d85f064b19d7b9ae91be","infoHashBuffer":{"type":"Buffer","data":[163,19,246,14,225,67,235,78,100,40,216,95,6,75,25,215,185,174,145,190]},"announce":[],"urlList":[]}}