{"title":"Garmin - U.S. Recreational Lakes with Fishing Hot Spots - No unl","uid":3513546,"size":1172858880,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a4937fb2f1cdd82fb91d503ef982bf2a84675d0b&amp;dn=Garmin+-+U.S.+Recreational+Lakes+with+Fishing+Hot+Spots+-+No+unl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SunyJim","files":3,"time":1155880567,"description":"ALL 3 ISO&amp;#039;s WEST, CENTRAL, EAST, just burn to cd with your burning program\nAS Always with the Garmin stuff I upload there is no unlock required.\nUnfortunatly despite what the Garmin website shows, it does not have coverage of Ontario Canada lakes, 3 lakes is not what I would call coverage.\n\n__________________________________________________________________________________\n\n &lt;a href=&quot;\nhttp://www.garmin.com/cartography/mapSource/reclakes.jsp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.garmin.com/cartography/mapSource/reclakes.jsp&lt;/a&gt;\n\nU.S. Recreational Lakes with Fishing Hot Spots is ideal for fishing, recreational boating or camping. Featuring maps of thousands of the country?s best fishing and boating destinations, it is divided into three easy-to-use geographic regions:\n\tEast\n\tCentral\n\tWest\n\nAnglers and pleasure boaters alike will appreciate the detail, selection, and easy-to-use format of these lake maps ? all at a very competitive price\n\nGarmin has simplified the way anglers purchase and use these maps. Map detail and data may be viewed on a personal computer and then downloaded to select Garmin GPS products or purchased on pre-programmed data cards. All lakes in each region are unlocked ?making it easy to use. The CD-ROM version includes all U.S. Recreational Lakes and Fishing Hot Spots maps for each region, while the data card version offers regional Fishing Hot Spots maps only.\n\nIn addition to Fishing Hot Spots lake detail, U.S. Recreational Lakes with Fishing Hot Spots v5 CD-ROM features thousands of recreational lakes, some with more information than others. In particular, Central and Eastern regions contain extra detail, including depth contours, for many lakes throughout nine states.\n\nSee the product compatibility table (above right) for a list of products that Garmin recommends with this software.\n\nU.S. Recreational Lakes features:\n\n    * Detailed shoreline for most lakes\n    * Detailed lake maps may include depth contours, boat ramps, fuel mile markers, hazards, marinas, campgrounds\n    * Interstates, highways and county roads\n    * Contains general roads and lake data\n    * Over a thousand lakes in the Central and Eastern regions contain additional lake detail, including depth contours\n    * Trip and waypoint management function lets you transfer waypoints, routes and tracks between your Garmin GPS and your PC\n\nFishing Hot Spots features*:\n\n    * Lake profiles including size, depth and source\n    * Standing timber\n    * Creek channels\n    * Boating lanes\n    * Bottom consistency (including weed growth)\n    * Submerged roadbeds, fence rows and other structure\n    * Rock piles\n    * Access roads\n    * Hazards\n    * Suggested fishing areas and seasonal catching strategies\n    * Lure selection tips\n\n*Not all features listed above are available for all Fishing Hot Spots lakes","torrent":{"xt":"urn:btih:a4937fb2f1cdd82fb91d503ef982bf2a84675d0b","amp;dn":"Garmin+-+U.S.+Recreational+Lakes+with+Fishing+Hot+Spots+-+No+unl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4937fb2f1cdd82fb91d503ef982bf2a84675d0b","infoHashBuffer":{"type":"Buffer","data":[164,147,127,178,241,205,216,47,185,29,80,62,249,130,191,42,132,103,93,11]},"announce":[],"urlList":[]}}