{"title":"Randomized Algorithms - Motwani and Raghavan","uid":4845776,"size":5518098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a523caa284f2b74d9b90d377860e662e02500bc4&amp;dn=Randomized+Algorithms+-+Motwani+and+Raghavan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"baboreily","files":-1,"time":1239675288,"description":"DjVu File Format\n================\n\nThe file is in DjVu format and can be viewed on Linux, Mac OS X and Windows using any of the tools found on this page:\n &lt;a href=&quot;\nhttp://djvu.org/resources/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://djvu.org/resources/&lt;/a&gt;\n\nFrom Amazon\n===========\n\n# Hardcover: 492 pages\n# Publisher: Cambridge University Press; 1 edition (Aug 25 1995)\n# Language: English\n# ISBN-10: 0521474655\n# ISBN-13: 978-0521474658\n\nProduct Description\nReview\n'The techniques described by Rajeev Motwani and Prabhaker Raghavan are wide-ranging and powerful, so this book is an important one. As far as I have been able to find out this is the only book on the entire subject ... this excellent volume does us proud!' American Scientist 'This book can serve as an excellent basis for a graduate course. It is highly recommended for students and researchers who wish to deepen their knowledge of the subject. Finally, I believe that the book, with its vast coverage, will be an invaluable source for active researchers in the field.' Y. Aumann, Computing Reviews\n\nReview\n&quot;The techniques described by Rajeev Motwani and Prabhaker Raghavan are wide-ranging and powerful, so this book is an important one...We are particularly lucky, therefore, that this excellent volume does us so proud!...clearly written and well thought out, with an interesting collection of exercises and applications, and shows the comprehensive breadth and valuable insights of a mature text...I would recommend the book both to newcomers to the field and to more seasoned practitioners...It is a pleasure to read.&quot; John H. Halton, American Scientist\n\n&quot;...the first comprehensive account of the current state of this burgeoning subject...Every aspect of this book...shows evidence of ample thoughtfulness...an essential acquisition...&quot; D.V. Feldman, Choice\n\n&quot;Randomization has come to be recognized as a fundamental tool for the construction of simple and efficient algorithms. Motwani and Raghavan provide an excellent overview of randomized techniques in algorithm construction, demonstrating their impact on virtually every domain in which computation is done. This book will surely exert a powerful influence on the way algorithm design is practiced and taught.&quot; Richard M. Karp\n\n&quot;This is an authoritative work by researchers active in the field. The book is welcome as a reference work, as a source book for algorithmic ideas, and as a graduate-level course text....In the latter role, the book is greatly enhanced by the provision of numerous exercises scattered throughout the text (to test and deepen the reader's understanding), together with extensive selections of harder problems at the end of each chapter. The continued attention of seasoned researchers is assured by the inclusion of a number of open research problems. This is very much an active research area, and if newcomers are attracted into it through reading this book, then it will have served an additional useful purpose.&quot; Mark R. Jerrum, Mathematical Reviews\n\n&quot;The book can serve as an excellent basis for a graduate course. It is also highly recommended for students and researchers who wish to deepen their knowledge of the subject.&quot; Y. Aumann, Computing Reviews\n\n&quot;...carefully written, with exact definitions and complete proofs.... I believe that the book, with its vast coverage, will be an invaluable source for active researchers in the field.&quot; Y. Aumann, Theory of Computation\n","torrent":{"xt":"urn:btih:a523caa284f2b74d9b90d377860e662e02500bc4","amp;dn":"Randomized+Algorithms+-+Motwani+and+Raghavan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a523caa284f2b74d9b90d377860e662e02500bc4","infoHashBuffer":{"type":"Buffer","data":[165,35,202,162,132,242,183,77,155,144,211,119,134,14,102,46,2,80,11,196]},"announce":[],"urlList":[]}}