{"title":"MESSIAH PROPHET DISCOGRAPHY","uid":9665227,"size":208737303,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a5d48dadba4a54776709d486c76371d6d7eb3382&amp;dn=MESSIAH+PROPHET+DISCOGRAPHY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"godrulz","files":30,"time":1393367752,"description":"The Messiah Prophet Band was the creation of bassist Dean Pellman. The foundation of the band was forming in the late seventies by Dean who was using Jesus music as a vehicle for his ministry around central Pennsylvania. Dean and a friend of his, Gil Tabor started the Messiah Prophet Band as an acoustic duo, performing songs by seventies Christian rock artists such as Randy Stonehill, Keith Green and Phil Keaggy at a Christian camp in the Pocanos. Dean was also ministering to kids in the local juvenile detention centers. Through those ministries Messiah Prophet Band was formed into a full band around 1983. The bands initial line up was singer Charlie Clark, guitarists Andy Strauss and Rob Clark, drummer Dave Daubert and Pellman handling the bass duties. The band rehearsed and played shows in and around the Lebanon, PA area. By 1984 the band secured a record deal with Morada Records. Morada was a tiny label based in Nashville that signed mainly gospel artists. Other artists on the Morada label included Rob Cassels and Austintown Ohio folk rockers Omega Sonship Band. Another band that signed to the label in 1984 was one of Christian rocks heaviest band up to that point, Saint. In the spring of 1984 Messiah Prophet Band began recording their debut album at Wintergreen Studios. Wintergreen was a small 16 track studio located in nearby Hershey. The studio was owned and operated by Cedric Winters, a high school friend of Pellmans. Cedric engineered the sessions while then band manager Jim Zimmerman produced. After some weeks of recording and mixing the band emerged with their debut effort, 'Rock The Flock'. The bulk of the songs being written by both Strauss and Pellman. The albums cover artwork was created by another friend of Pellman, Jack Althouse. The cover is a take off on guitarist Andy Strauss and his trademark 79 Dean Z.\n\nAfter the release the band plays shows around the region. Around this time guitarist Rob Clark exits the band and is replaced by Brian Nicarry. In 1986 in eastern Pennsylvania's Allentown a new label was starting up. Pure Metal Records was a subsidiary to the parent Refuge Music Group. Some of the Refuge roster at the time\nincluded former Paul McCartney and Wings drummer Joe English, Canadian hard rockers Daniel Band and Sweden's Jerusalem. Pure Metal was going to be an exclusive label, signing only Christian hard rock and metal artists to its rooster. Also signed early on, Bride, Swedish metal project Leviticus and former Morada label mates Saint. During the spring of 1986 Messiah Prophet Band enters central Pa.'s Susquehanna Studios to begin writing and recording their sophomore effort. The band enlists Bill Grabowski to produce. Grabowski's past work most notably with New Jersey pop metal band Bon Jovi. During the sessions Daubert and Pellman exit the band due to family obligations and are replaced with drummer David &quot;Thunder&quot; Armstrong and bassist Joe Shirk. The band also shortens its name to Messiah Prophet. In the summer of 1986 'Master Of The Metal' is released with the bulk of the songs being written by Strauss. Once again the band enlisted Jack Althouse to create the albums cover design. The band hit the road prior to the albums release taking the 'Master Of The Metal' tour throughout the Midwest and west coast. One particular stop was the Cornerstone Festival in Chicago Illinois. The band shared the bill with other pioneering metal bands Saint and Philadelphia.\n\nIn early 1987 the band took a short break from the road to begin writing for their third album, slated to be called 'Metal Messiah'. The band hit the road again playing more shows in the Midwest and east coast. New tunes like &quot;Run Away&quot; show up in the set list as well as Daniel Band's &quot;Sixteen&quot;' and Rez Band's &quot;Military Man&quot;. By the fall of 1987 Strauss and Nicarry had left the band, taking the new material with them. They were replaced by Frank Caloiaro and Mark Zimmerman who help the band finish out the 'Master Of The Metal' tour. Also in late 87 the song &quot;Master Of The Metal&quot; is included on K-Tel Records compilation 'Righteous Metal' alongside tracks by Stryken, Barren Cross, Bloodgood as well as others. At this time the band calls it a day.\n\nIn early 1988 Charlie Clark and Ray Fletcher form a new line up of Messiah Prophet. Tennessee native drummer CT Cash, from New York bassist Scott Gunther and guitarist Mike Balleitt, and from Duluth Minnesota lead guitarist Todd Bergren. Holed up in a barn in Northumberland Pa. the new line up start writing material for a new Messiah Prophet release to be titled 'Living On The Edge'. The band was also rehearsing for an up coming string of shows opening for Barren Cross on their 'Atomic Arena' tour. The band played a few local warm up gigs and then hit the road playing colleges in Ohio, PA, Massachusetts and West Virginia. Also in 1988 the song &quot;Heavy Metal Thunder&quot; was included on the Pure Metal compilation 'Heavy Righteous Metal'. By mid-'88 Refuge was in financial trouble and couldn't get the band into the studio for its next release. Refuge started negotiations with StarSong for a buy out of the Pure Metal label. During this time Charlie Clark entered into Susquehanna Studios with unknown musicians and recorded the song &quot;Blinded&quot;, which ended up on StarSongs compilation 'Ultimate Metal'. Because of family obligations Ray and Charlie ended Messiah Prophet. Guitarist Bergren and bassist Gunther head to Duluth and start the band Reign Of Kings, opening shows for various CCM artists. The band released a custom cassette titled 'EPAT OMED' (demo tape backwards). In 1992 Heavens Metal editor Doug Van Pelt chose to put the song &quot;Heavy Metal Thunder&quot; on his box set salute to Christian metals pioneers, called 'The Heavens Metal Collection'.\n\nIn 1995 a new Messiah Prophet lineup was formed around one time touring guitarist Frank Caloiaro. They released their 3rd full-length album, entitled 'Colors' in 1996. Unfortunately this was a very different sounding effort, and a total departure from the metal sound from the previous albums. The fans didn't like it. Once again the band folded. this time for good. In 2002 German metal label Shark Records included the songs &quot;Hit and Run&quot; and &quot;Master Of The Metal&quot; on their 'Rusty Diamonds' compilation, along with tracks by power metal band Powerlord and Maxx Warrior, an early incarnation of the pop metal band Firehouse. In 2002 the compilation fortified label Madacy Music Group included the song &quot;Heavy Metal Thunder&quot; on their 'Christian Loud' compilation.\n\nAll of the members of Messiah Prophet through the years have gone on to other things. The only two that are still working in the music field are guitarists Andy Strauss and \nTodd Bergren. Andy scores music for independent films most recently a horror film called The Creek. Todd Bergren is a guitar instructor in the twin cities area owning and operating a handful of studios called the Riff Factory.","torrent":{"xt":"urn:btih:a5d48dadba4a54776709d486c76371d6d7eb3382","amp;dn":"MESSIAH+PROPHET+DISCOGRAPHY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5d48dadba4a54776709d486c76371d6d7eb3382","infoHashBuffer":{"type":"Buffer","data":[165,212,141,173,186,74,84,119,103,9,212,134,199,99,113,214,215,235,51,130]},"announce":[],"urlList":[]}}