{"title":"BBC Horizon - Did Cooking Make Us Human XviD AC3.avi","uid":5406413,"size":734056448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a66a9eb488675bf146d8903af0182792f0a52e8a&amp;dn=BBC+Horizon+-+Did+Cooking+Make+Us+Human+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos2001","files":1,"time":1267613461,"description":"Did the discovery of cooking make us human?\n\nCooking is something we all take for granted but a new theory suggests that if we had not learned to cook food, not only would we still look like chimps but, like them, we would also be compelled to spend most of the day chewing.\n\nWithout cooking, an average person would have to eat around five kilos of raw food to get enough calories to survive. \n\nThe daily mountain of fruit and vegetables would mean a six-hour chewing marathon. \n\nIt is already accepted that the introduction of meat into our ancestors' diet caused their brains to grow and their intelligence to increase. \n\nMeat - a more concentrated form of energy - not only meant bigger brains for our ancestors, but also an end to the need to devote nearly all their time to foraging to maintain energy levels. \n\nAs a consequence, more time was available for social structure to develop. \n\n'Accident'\n\nHarvard Professor Richard Wrangham believes there is more to it than simply discovering meat. \n\n\n \nAustralopithecus was ape-like but walked upright like humans \nHe thinks that it is not so much a change in the ingredients of our diet, but the way in which we prepare them that has caused the radical evolution of our species. \n\n&quot;I think cooking is arguably the biggest increase in the quality of the diet in the whole of the history of life,&quot; he says. \n\n&quot;Our ancestors most probably dropped food in fire accidently. They would have found it was delicious and that set us off on a whole new direction.&quot; \n\nTo understand how and when our bodies changed, we need to take a closer look at what our ancestors ate by studying the fossil records. \n\nOur earliest ancestor was the ape-like Australopithecus. \n\nAustralopithecus had a large belly containing a big large-intestine, essential to digest the robust plant matter, and had large, flat teeth which it used for grinding and crushing tough vegetation. \n\nNone the less, it was Australopithecus that moved out of the trees and onto the African savannah, and started to eat the animals that grazed there. \n\nAnd it was this change of habitat, lifestyle and diet that also prompted major changes in anatomy. \n\nBigger brain\n\nThe eating of meat ties in with an evolutionary shift 2.3 million years ago resulting in a more human-looking ancestor with sharper teeth and a 30% bigger brain, called Homo habilis. \n\n\n \nThe brain consumes 20% of a person's energy while sitting  \nThe most momentous shift however, happened 1.8 million years ago when Homo erectus - our first &quot;truly human&quot; ancestor arrived on the scene. \n\nHomo erectus had an even bigger brain, smaller jaws and teeth. \n\nErectus also had a similar body shape to us. Shorter arms and longer legs appeared, and gone was the large vegetable-processing gut, meaning that Erectus could not only walk upright, but could also run. \n\nHe was cleverer and faster, and - according to Professor Wrangham - he had learned how to cook. \n\n&quot;Cooking made our guts smaller,&quot; he says. &quot;Once we cooked our food, we didn't need big guts. \n\n&quot;They're costly in terms of energy. Individuals that were born with small guts were able to save energy, have more babies and survive better.&quot; \n\nProfessor Peter Wheeler from Liverpool John Moores University and his colleague, Leslie Aiello, think it was this change in our digestive system that specifically allowed our brains to get larger. \n\nEnergy transfer\n\nCooking food breaks down its cells, meaning that our stomachs need to do less work to liberate the nutrients our bodies need. \n\nThis, says Wheeler, &quot;freed up energy which could then be used to power a larger brain. The increase in brain-size mirrors the reduction in the size of the gut.&quot; \n\nSignificantly Wheeler and Aiello found that the reduction in the size of our digestive system was exactly the same amount that our brains grew by - 20%. \n\nProfessor Stephen Secor at the University of Alabama found that not only does cooked food release more energy, but the body uses less energy in digesting it. \n\nHe uses pythons as a model for digestion as they stay still for up to six days while digesting a meal. This makes them the perfect model as the only energy they expend is on digestion. \n\nHis research shows that pythons use 24% less energy digesting cooked meat, compared with raw. \n\nSo being human might all be down to energy. \n\nCooking is essentially a form of pre-digestion, which has transferred energy use from our guts to our brains. \n\nAccording to Professors Wheeler and Wrangham and their colleagues, it is no coincidence that humans - the cleverest species on earth - are also the only species that cooks. \n\n\nAirdate/time:Tue 2 Mar 201021:00\nDuration:    57:40\nA/R (WxH): 1:1.78 (720x400)\nACodec:       AC3\nVCodec:       XviD","torrent":{"xt":"urn:btih:a66a9eb488675bf146d8903af0182792f0a52e8a","amp;dn":"BBC+Horizon+-+Did+Cooking+Make+Us+Human+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66a9eb488675bf146d8903af0182792f0a52e8a","infoHashBuffer":{"type":"Buffer","data":[166,106,158,180,136,103,91,241,70,216,144,58,240,24,39,146,240,165,46,138]},"announce":[],"urlList":[]}}