{"title":"Digital Signal Processing in Power System Protection and Control","uid":6687946,"size":3607840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6cf6a9035e94e4361d0213e5ec798f090237aba&amp;dn=Digital+Signal+Processing+in+Power+System+Protection+and+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316477130,"description":"Digital Signal Processing in Power System Protection and Control bridges the gap between the theory of protection and control and the practical applications of protection equipment. Understanding how protection functions is crucial not only for equipment developers and manufacturers, but also for their users who need to install, set and operate the protection devices in an appropriate manner. After introductory chapters related to protection technology and functions, Digital Signal Processing in Power System Protection and Control presents the digital algorithms for signal filtering, followed by measurement algorithms of the most commonly-used protection criteria values and decision-making methods in protective relays. A large part of the book is devoted to the basic theory and applications of artificial intelligence techniques for protection and control. Fuzzy logic based schemes, artificial neural networks, expert systems and genetic algorithms with their advantages and drawbacks are discussed. AI techniques are compared and it is also shown how they can be combined to eliminate the disadvantages and magnify the useful features of particular techniques. The information provided in Digital Signal Processing in Power System Protection and Control can be useful for protection engineers working in utilities at various levels of the electricity network, as well as for students of electrical engineering, especially electrical power engineering. It may also be helpful for other readers who want to get acquainted with and to apply the filtering, measuring and decision-making algorithms for purposes other than protection and control, everywhere fast and on-line signal analysis is needed for proper functioning of the apparatus.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 331 pages\n    * Publisher: Springer; 1st Edition. edition (August 9, 2011)\n    * Language: English\n    * ISBN-10: 0857298011\n    * ISBN-13: 978-0857298010","torrent":{"xt":"urn:btih:a6cf6a9035e94e4361d0213e5ec798f090237aba","amp;dn":"Digital+Signal+Processing+in+Power+System+Protection+and+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6cf6a9035e94e4361d0213e5ec798f090237aba","infoHashBuffer":{"type":"Buffer","data":[166,207,106,144,53,233,78,67,97,208,33,62,94,199,152,240,144,35,122,186]},"announce":[],"urlList":[]}}