{"title":"paint.net_4.0","uid":10311120,"size":6122375,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6d0c3b0eaf831d8bb6cbf0285c27222b23bb5bf&amp;dn=paint.net_4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amkay024","files":2,"time":1402183916,"description":"Paint.NET is an image and photo manipulation application.\nEvery feature and user interface element was designed to be immediately intuitive and quickly learnable without assistance. In order to handle multiple images easily, Paint.NET uses a tabbed document interface. The tabs display a live thumbnail of the image instead of a text description. This makes navigation very simple and fast.\nUsually only found on expensive or complicated professional software, layers form the basis for a rich image composition experience. You may think of them as a stack of transparency slides that, when viewed together at the same time, form one image.\n\nMany special effects are included for enhancing and perfecting your images. Everything from blurring, sharpening, red-eye removal, distortion, noise, and embossing are included. Also included is our unique 3D Rotate/Zoom effect that makes it very easy to add perspective and tilting.\n\nAdjustments are also included which help you tweak an image's brightness, contrast, hue, saturation, curves, and levels. You can also convert an image to black and white, or sepia-toned.","torrent":{"xt":"urn:btih:a6d0c3b0eaf831d8bb6cbf0285c27222b23bb5bf","amp;dn":"paint.net_4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d0c3b0eaf831d8bb6cbf0285c27222b23bb5bf","infoHashBuffer":{"type":"Buffer","data":[166,208,195,176,234,248,49,216,187,108,191,2,133,194,114,34,178,59,181,191]},"announce":[],"urlList":[]}}