{"title":"Huntsman.The.Orphanage.Update.v1.03-RELOADED","uid":9409483,"size":556269956,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a7d312bb98bd67e046145796f2341e56d31bcea0&amp;dn=Huntsman.The.Orphanage.Update.v1.03-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mr.Stifmeister","files":6,"time":1388247220,"description":"\nnERv\n\nHuntsman: The Orphanage Update v1.03 (c) ShadowShifters\n\n12/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n- :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nCheck the included .txt file for a list of what's new. You do not need any\nprevious updates for this release\n\nMORE STORY THAN GORY A HYBRID OF ALTERNATIVE HORROR AND CREEPYPASTA...\nWelcome to the Halloween Edition\nTake a deep breath, dim the lights, put on your headphones...\n\nNon-linear first-person gameplay lets you explore Grimhaven Orphanage and\ndiscover the characters who once lived there  voiced by Dan Bull, Chuck\nHuber and Raychul Moore, plus a multitude of other great voices from around\nthe world - some of which we discovered through our global YouTube\nauditions\n\nWe call this 'alt horror' because it has no graphic violence, blood or\nguns. As the player, you have no defense... however, you must show empathy\nand courage to save the twelve missing orphans. This is a game for people\nwho like to explore, listen, think and solve - and play cat and mouse in a\ndark and scary maze. Listen to the nineteen personal creepypasta-style\nstories to piece together the mysterious events of that fateful night in\n1898, when twelve orphans simply... disappeared Now with shorter\n(30-60 sec) in-game stories to enhance the tension and new plot twists when\nyou least expect them And don't panic story lovers The full stories are\nstill there  on the menu page and somewhere within the game... if you know\nwhere to look\n\nFind the twelve orphan's mementos and place them on the correct headstones\nto set the lost souls free. Did we mention the headstones are in a hedge\nmaze? Custom-created by a 'Ripley's Believe-It-Or-Not' Maze Master? No\nproblem But first you'll have to find the key... Are you up to the\nchallenge? Did we mention the Huntsman... in the maze... stalking you? Did\nwe mention he may also be lurking in Grimhaven Orphanage?\n\nSo  how fast can you turn and run? Well you won't know 'till you check it\nout So go do it Have fun Scare yourself as much as you want (maybe you\nshould keep the hallway light on...)\n\n1. Unrar\n2. Install the update.\n3. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:a7d312bb98bd67e046145796f2341e56d31bcea0","amp;dn":"Huntsman.The.Orphanage.Update.v1.03-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d312bb98bd67e046145796f2341e56d31bcea0","infoHashBuffer":{"type":"Buffer","data":[167,211,18,187,152,189,103,224,70,20,87,150,242,52,30,86,211,27,206,160]},"announce":[],"urlList":[]}}