{"title":"[Permaculture] Bill Mollison - Global Gardener Series 1-4","uid":3884496,"size":1257795584,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a920f5a09ce5e9bd435272f398eac3a6bb4186b2&amp;dn=%5BPermaculture%5D+Bill+Mollison+-+Global+Gardener+Series+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diinero","files":4,"time":1194821128,"description":"Bill Mollison - Global Gardener Series 1-4\n\nPermaculture helps people turn wastelands into food forests.\n\n112 minutes\n\nBILL MOLLISON is a practical visionary. For nearly two decades he has traveled the globe spreading the word about permaculture, the method of sustainable agriculture that he devised. Permaculture weaves together microclimate, annual and perennial plants, animals, soils, water management and human needs into intricately connected productive communities. Mollison has proved that even in the most difficult conditions permaculture empowers people to turn wastelands into food forests.\n\nGLOBAL GARDENER is a series of four half-hour programs on one tape. Each episode looks at examples in different bioregions:\n\nIN THE TROPICS - Mollison introduces the basic principles, and shows results in Australia, India, and Zimbabwe.\n\nARID LANDS - Reversing desertification in Arizona, Botswana and Australia.\n\nCOOL CLIMATES - Europe, Tasmania, and the San Juan Islands in Washington State.\n\nURBAN - New York City and Harare, Zimbabwe.\n\nReviews:\n&quot;(Permaculture) involves caring for the whole system of earth and spaces, devising model systems with much design drawn from nature, with the end result being a system that&amp;#039;s ecologically sound and economically profitable...Mollison provides practical and motivating information for just about anyone interested in gardening, sustainable lifestyles, and similar topics...Recommended.&quot; Rachel Lohafer, Instructional Technology Center Media Library, Iowa State University, MC Journal\n\n&quot;A lively and informative two hour video that will be greatly appreciated by\ngardeners, farmers, horticulturists, and agriculturists.&quot; Midwest Book Review\n\n&quot;This uplifting production of positive change shows people, in developed and third world countries, in the bush and in the city, turning waste lands into sustainable food production systems....this video teaches not how to do it, but how to think about doing it. This film is probably the next best thing to taking a class with Mollison himself.&quot; Earthworks Magazine","torrent":{"xt":"urn:btih:a920f5a09ce5e9bd435272f398eac3a6bb4186b2","amp;dn":"%5BPermaculture%5D+Bill+Mollison+-+Global+Gardener+Series+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a920f5a09ce5e9bd435272f398eac3a6bb4186b2","infoHashBuffer":{"type":"Buffer","data":[169,32,245,160,156,229,233,189,67,82,114,243,152,234,195,166,187,65,134,178]},"announce":[],"urlList":[]}}