{"title":"Dan Brown - The Lost Symbol (Unabridged)","uid":6627283,"size":1037550879,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a99bdba62f8b8b6772b4ef508f62aab90b2239d1&amp;dn=Dan+Brown+-+The+Lost+Symbol+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bjoern65","files":4,"time":1314196077,"description":"Dan Brown - The Lost Symbol (Unabriged)\n\n\nBit Rate : 128kbps   \nChannels : 2(stereo)   \nAudio Sample Rate 44 kHz\n\n\n\nLet's start with the question every Dan Brown fan wants answered: Is The Lost Symbol as good as The Da Vinci Code? Simply put, yes. Brown has mastered the art of blending nail-biting suspense with random arcana (from pop science to religion), and The Lost Symbol is an enthralling mix. And what a dazzling accomplishment that is, considering that rabid fans and skeptics alike are scrutinizing every word. \n\nThe Lost Symbol begins with an ancient ritual, a shadowy enclave, and of course, a secret. Readers know they are in Dan Brown territory when, by the end of the first chapter, a secret within a secret is revealed. To tell too much would ruin the fun of reading this delicious thriller, so you will find no spoilers here. Suffice it to say that as with many series featuring a recurring character, there is a bit of a formula at work (one that fans will love). Again, brilliant Harvard professor Robert Langdon finds himself in a predicament that requires his vast knowledge of symbology and superior problem-solving skills to save the day. The setting, unlike other Robert Langdon novels, is stateside, and in Brown's hands Washington D.C. is as fascinating as Paris or Vatican City (note to the D.C. tourism board: get your &quot;Lost Symbol&quot; tour in order). And, as with other Dan Brown books, the pace is relentless, the revelations many, and there is an endless parade of intriguing factoids that will make you feel like you are spending the afternoon with Robert Langdon and the guys from Mythbusters. \n\nNothing is as it seems in a Robert Langdon novel, and The Lost Symbol itself is no exception - a page-turner to be sure, but Brown also challenges his fans to open their minds to new information. Skeptical? Imagine how many other thrillers would spawn millions of Google searches for noetic science, superstring theory, and Apotheosis of Washington. The Lost Symbol is brain candy of the best sort - just make sure to set aside time to enjoy your meal.\n\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:a99bdba62f8b8b6772b4ef508f62aab90b2239d1","amp;dn":"Dan+Brown+-+The+Lost+Symbol+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99bdba62f8b8b6772b4ef508f62aab90b2239d1","infoHashBuffer":{"type":"Buffer","data":[169,155,219,166,47,139,139,103,114,180,239,80,143,98,170,185,11,34,57,209]},"announce":[],"urlList":[]}}