{"title":"Grand Archives - The Grand Archives [2008][EAC,log,cue. FLAC]","uid":8209100,"size":266764636,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aa7293b568b68c1344885d04934fb810e1d93041&amp;dn=Grand+Archives+-+The+Grand+Archives+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":18,"time":1362191974,"description":"Artist: Grand Archives\nRelease: The Grand Archives\nDiscogs: 1777937\nReleased: 2008-02-19\nLabel: Sub Pop\nCatalog#: SPCD 754\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Folk Rock, Indie Rock\n\nTracklisting:\n\n01. Torn Blue Foam Couch\n02. Miniature Birds\n03. Swan Matches\n04. Index Moon\n05. George Kaminski\n06. A Setting Sun\n07. Breezy No Breezy\n08. Sleepdriving\n09. Louis Riel\n10. The Crime Window\n11. Orange Juice\n\nI'll give this to Sub Pop: They certainly know what's in their wheelhouse. The mitosis of the Band of Horses stem cell resulted in the more streamlined and sedate Cease to Begin and Mat Brooke's Grand Archives...a band that sounds like they'd end up on the label any damn way. Or, how about this: The band that pulls off what the Elected were supposed to, a mixture of hayseed indie, bashful singer-songwriter comedowns, and sunny, orchestral pop.\nGrand Archives won't have the same impact of either Horses record, since it's more about hooks than heft and certainly less scrutable in topicality. But after hearing &quot;Torn Blue Foam Couch&quot; spiral endlessly upward, the &quot;Bungalow Bill&quot;-quoting harmonica/whistle riff of &quot;Miniature Birds&quot;, or the playful jig in the chorus of &quot;A Setting Sun,&quot; you begin to suspect the root of Cease to Begin's occasional dourness. Brooke did manage to salvage a sense for the anthemic, although it isn't quite as barnstorming-- &quot;Swan Matches&quot; and &quot;Index Moon&quot; come girded by strong, but slow-evolving melodies that reveal themselves as stop-motion lighter wavers.\nBrooke's c.v. might be the main draw for rubberneckers here, but Grand Archives are far from a plug'n'play set-up; Brooke's slight voice, more airy than airborne gets plenty of help in from his backing band (which includes Carissa's Wierd's Jenn Ghetto and Ghost Stories), all of whom contribute strong vocals. &quot;Sleepdriving&quot;, the album standout, is a monument of gauze, slowly evolving harmonies lingering before the coda breaks into a triumphant string uplift straight from Sigur Ros. While it's tempting to lump them into the ever-increasing pile of 70s California daytrippers, there's actually more forensic evidence of Summerteeth in the perfectly laconic horns on &quot;Miniature Birds&quot; and mandolins of brief closer &quot;Orange Juice&quot;.\nThe melodica instrumental &quot;Breezy No Breezy&quot; is a bit of trifle, but &quot;The Crime Window&quot; is the only real clunker on Grand Archives-- and it's a doozy. Relentlessly loud with power chords, bleating horns, and an unbecoming/unconvincing shoutiness, &quot;Crime Window&quot; shows the band trying to traverse the entirety of Montreal in four minutes, and by comparison, Neon Bible is a case study of subtlety. At the very least, the recording sessions for &quot;Crime Window&quot; must've been a blast, a feeling you get from just about everything else here. The insularity of Cease to Begin certainly has its merits, and it's pointless to argue about who comes out on top here, but the way Grand Archives come forth with arms outsretched results in a debut that likely exceeds most expectations.","torrent":{"xt":"urn:btih:aa7293b568b68c1344885d04934fb810e1d93041","amp;dn":"Grand+Archives+-+The+Grand+Archives+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa7293b568b68c1344885d04934fb810e1d93041","infoHashBuffer":{"type":"Buffer","data":[170,114,147,181,104,182,140,19,68,136,93,4,147,79,184,16,225,217,48,65]},"announce":[],"urlList":[]}}