{"title":"Essentials of Energy Technology - Sources, Transport, Storage, a","uid":14882771,"size":9668443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa9137cd7dd6fa9c14d69a72a35a17dd8d069335&amp;dn=Essentials+of+Energy+Technology+-+Sources%2C+Transport%2C+Storage%2C+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465711158,"description":"Essentials of Energy Technology - Sources, Transport, Storage, and Conservation - J. Fricke, W. L. Borst (Wiley-VCH, 2013).pdf\r\n\r\nISBN 978-3-527-33416-2\r\n\r\nAn in-depth understanding of energy technology, sources, conversion, storage, transport and conservation is crucial for developing a sustainable and economically viable energy infrastructure. This need, for example, is addressed in university courses with a special focus on the energy mix of renewable and depletable energy resources.\r\n\r\nEnergy makes our lives comfortable, and the existence of amenities such as heaters, cars, warm water, household appliances and electrical light is characteristic for a developed economy. Supplying the industrial or individual energy consumer with energy 24 hours a day is a non-trivial challenge, especially in times where the energy is coming from very diverse resources such as oil, gas, nuclear fuels, wind, sun, or waves.\r\n\r\nThis book gives physics, chemistry, engineering, and materials science students insights in the basics of energy and energy technology. It was developed along a successful course for advanced bachelor or graduate students and is written in a didactic style. The problems and solutions at the end of each chapter are ideal for exams and make self-study easy. Topics covered include energy from fossil and nuclear fuels, renewable sources, energy transport, storage, and conservation","torrent":{"xt":"urn:btih:aa9137cd7dd6fa9c14d69a72a35a17dd8d069335","amp;dn":"Essentials+of+Energy+Technology+-+Sources%2C+Transport%2C+Storage%2C+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9137cd7dd6fa9c14d69a72a35a17dd8d069335","infoHashBuffer":{"type":"Buffer","data":[170,145,55,205,125,214,250,156,20,214,154,114,163,90,23,221,141,6,147,53]},"announce":[],"urlList":[]}}