{"title":"The Greatest Generation (Earl Jones)","uid":6509516,"size":46393788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ac9fc9fa3aba64f872107f1c07f822085b1668d1&amp;dn=The+Greatest+Generation+%28Earl+Jones%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Borzoi","files":1,"time":1309563761,"description":"\nEarl Jones was an actual &quot;rocket scientist&quot; who had worked as part of the &quot;Minuteman Missile Program&quot;.  After his retirement, he became a very passionate student of history, but.., not of the &quot;politically correct&quot; versions we've all been taught by the &quot;controlled media&quot; !\n\nEarl Jones (now deceased) was from Deming, New Mexico and wrote a monthly publication called &quot;The Intelligence Newsletter&quot; which was part of his ministry by the name of &quot;The Christian Crusade for Truth&quot;.\n\nThis is a 2-part lecture that was given at one of pastor Peter J Peters church-retreat gatherings.  It's a GREAT historical analysis of &quot;Our People&quot; (including our &quot;warts&quot; and all) from the days of Babylon, to the signing of the &quot;Magna-Carte&quot;, and then to the present.., with a special emphasis on the history leading up to.., AND after World War II.\n\nEven for those of you, who consider yourself to be a &quot;truth junkie&quot; of revisionist history.., will learn MUCH from this presentation !!!\n\nThis audio file is 96 minutes in length (lecture 1 &amp; 2 combined) and has a quality of a 9 (recorded in 64bps).\n\nAt only 45 Mb.., it's more than worth your time to download and listen to.., especially if you've enjoyed any of my other &quot;Borzoi&quot; uploads...\n\nAs always.., please share here.., there.., or however you can.., in order to possibly help those who are asleep.., but who just may.., wish to be  AWAKENED  !!!\n\n&quot;He Who Wins the War.., ALSO Writes the History&quot;\n\nAND...\n\n&quot;The Truth shall make you Free.., but at first.., it'll make you Damn Mad&quot; !!!\n\n","torrent":{"xt":"urn:btih:ac9fc9fa3aba64f872107f1c07f822085b1668d1","amp;dn":"The+Greatest+Generation+%28Earl+Jones%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac9fc9fa3aba64f872107f1c07f822085b1668d1","infoHashBuffer":{"type":"Buffer","data":[172,159,201,250,58,186,100,248,114,16,127,28,7,248,34,8,91,22,104,209]},"announce":[],"urlList":[]}}