{"title":"Tales from Kalila wa Dimna_ Munther A. Younes","uid":7405522,"size":118228659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acbc1e31eee8a819c703925a2248507611fd82ca&amp;dn=Tales+from+Kalila+wa+Dimna_+Munther+A.+Younes+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1341190056,"description":"book pdf + 3 cdroom audio\n\nThe Arabic literary classic Kalila wa Dimna is an eighth-century translation of a collection of fables about people and animals that has long been enjoyed by children and adults alike.  In this book, Munther A. Younes uses forty-six of these stories to create a lively and appealing reader for intermediate students of Arabic.  Younes retells the stories in simplified language, with both form and content systematically adjusted and controlled by limiting the vocabulary, simplifying the syntax, and eliminating digressions from the main story line.\n\n \n\nThe book is divided into three major sections.  The first section contains thirty stories, each of which is accompanied by two sets of comprehension questions.  Words in this section that are not included in a basic thousand-word list printed at the end of the book are glossed immediately following the story in which they occur.  In the second section, the remaining stories are presented without glossaries or questions and are intended as leisurely reading for the student and as material for proficiency testing by the teacher.  The third section is a complete alphabetical Arabic-English glossary of the one thousand most frequently used Arabic words.\n\n \n\n","torrent":{"xt":"urn:btih:acbc1e31eee8a819c703925a2248507611fd82ca","amp;dn":"Tales+from+Kalila+wa+Dimna_+Munther+A.+Younes+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acbc1e31eee8a819c703925a2248507611fd82ca","infoHashBuffer":{"type":"Buffer","data":[172,188,30,49,238,232,168,25,199,3,146,90,34,72,80,118,17,253,130,202]},"announce":[],"urlList":[]}}