{"title":"Tantric Sexuality - 1999 - Deep Sexy Chill Out (no password requ","uid":3988684,"size":117030073,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aebdae6d27bd50ab66301546297059ad1541d437&amp;dn=Tantric+Sexuality+-+1999+-+Deep+Sexy+Chill+Out+%28no+password+requ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sal2k8","files":1,"time":1200938186,"description":"Tantric Sexuality - deep sexy chill out (lounge)\n\nTantric Sexuality (Mind, Body, Soul Series)\n\nProduct Details\nAudio CD (October 17, 2000)\nOriginal Release Date: December 21, 1999\nNumber of Discs: 1\nLabel: New World Music\nASIN: B000035X36\nartist..........Llewellyn and Leora Lightwoman\nalbum........Tantric Sexuality\nstyle..........Ambient,chill-out\nbittrate.......320k\ntracklist......no\n\nOutstanding for tantra or meditation, July 8, 2005 By \tDr. Bill &quot;Professor, spiritualist, mammal&quot; (Charlottesville, VA USA) - See all my reviews\n\nThe unique aspect of this album is the underlying steady beat... a single rhythm extending from beginning to end, and at a perfect pace for breathing meditation or tantric lovemaking. In fact, this album is so well crafted for those purposes that it&amp;#039;s hard to imagine using anything else. I&amp;#039;ve not found its equal (though Al Gromer Khan&amp;#039;s &quot;Tantra Drums&quot; is in the right ballpark). If anyone can recommend a CD with a similar, slow, steady, visceral beat and well suited to meditative or tantric practice I would love to hear it. Until then, BUY THIS CD!\n\n\nWant to connect on a higher level in Tantric sex? Get this!, April 1, 2005 By \tLinwe &quot;Linwe&quot; (MO) - See all my reviews\n\nMy boyfriend and I are exploring Tantric. I listened to the tracks and was immediately hooked. Never had we experienced anything both sexual and spiritual at the same time. We managed to connect on a level neither of us have ever experienced before and has made us closer to each other. The music is fabulous meditation as well. Brings you down gently, effectively and makes meditation very rewarding and easy. I highly recommend this one. It has now become my favorite.\n\nMuch more than Tantric, July 27, 2007 By \tI like good music (yeah, yeah), that sweet so... (new york, ny United States) - See all my reviews\n\nI originally procured this CD as part an initial exporation of the Tantric method with my partner. However, one need not be seeking sexual fulfimment to appreciate the deeply sensual aspect of this recording. The backbeat, repeated drumming and breathing woven into the melody can accompany one on a solo excursion into a deep meditative state. It also can easily result in self arousal. However, as an accompliment to sexual activity, it is so much more than background music. The sound becomes an active participant. \nThis is not New Age wallpaper music, but a transcendental experience.\n\n\n\n\nThe Most Sensual CD for Massage, September 18, 2003 \nBy A Customer\nThis CD is incredible if you need sensual and erotic background music for a bodywork session. I do bodywork only on other professional bodyworkers...and music is frequently part of our discussion....to a person, every other professional I have worked on has asked where to buy a copy of this CD after out session. That said, I have listened to this CD hundreds, maybe even more than a thousand times...and i never tire of it. I have yet to find anything that equals it for tantric / erotic overtones.....if anyone has any suggestions, though...I would like to know of them...\n\nBy way of comparison...my other current favorite CD for body work with a less sensual ambience is &quot;The Hours Soundtrack&quot; by Phillip Glass. Wonderful pace, rhythm and instrumentation....this CD will lend an emotional feel to any session...so use it carefully if you are doing deep tissue work on some people...\n\nFor Ya Lova, May 25, 2001 By \ttantricdc (Tantricity, LA.) - See all my reviews\n\nOh my, if you think Barry White gets em&amp;#039; in the mood, try this disc. Me and my Lova listen to it on a little boombox while we&amp;#039;re grinding under the tree. I believe it to be one of the most intimate experiences you can share with another human being. Buy this cd right now, and when it comes reach out and touch someone. Oh yeah, my Lova says to say hi.\n\nPurr..fect!, December 6, 2000 By \tRachel (Florida) - See all my reviews\n\nI first heard this CD at a &amp;#039;Lessons in Intimacy&amp;#039; workshop with Diana and Richard Daffner. The pace and rhythm are perfect for evoking a feeling of sacred sexuality and for practicing the Daffners&amp;#039; movement program, Tantra Tai Chi. (Check out their website and video too.) The notes that come with the CD are extensive and well-written. Lots of good information. A real change from (too) hard rock or (too) soft new age. A perfect gift for a lover!\n\n\nLove Music!!!, October 1, 2003 \nBy A Customer\nIf you are looking for romantic music with an excellant exotic rhythm. Music that does not demand attention, but is gentle, unobtrusive, and sensual then this is the very BEST!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease seed after downloading...... \n\n","torrent":{"xt":"urn:btih:aebdae6d27bd50ab66301546297059ad1541d437","amp;dn":"Tantric+Sexuality+-+1999+-+Deep+Sexy+Chill+Out+%28no+password+requ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebdae6d27bd50ab66301546297059ad1541d437","infoHashBuffer":{"type":"Buffer","data":[174,189,174,109,39,189,80,171,102,48,21,70,41,112,89,173,21,65,212,55]},"announce":[],"urlList":[]}}