{"title":"Changeling 2008 [Eng Subs Embedded] DvDrip-soagg","uid":4702154,"size":734355456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aed0d08babc0907c407771b98bcbd9a865952830&amp;dn=Changeling+2008+%5BEng+Subs+Embedded%5D+DvDrip-soagg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soagg","files":1,"time":1233752736,"description":"Changeling 2008 DvDrip with English Subtitles Embedded\n\nResolution: 720 x 416\nRuntime: 2:21:31\nSize: 700 MB\n\nThe English Subtitles are for the whole movie.\n\nOutline:\nInspired by actual events that occurred in 1920s-era Los Angeles, Clint Eastwood's &quot;Changeling&quot; tells the story of a woman driven to confront a corrupted LAPD after her abducted son is retrieved and she begins to suspect that the boy returned to her is not the same boy she gave birth to. The year was 1928, and the setting a working-class suburb of Los Angeles. As Christine (Angelina Jolie) said goodbye to her son, Walter, and departed for work, she never anticipated that this was the day her life would be forever changed. Upon returning home, Christine was distressed to discover that Walter was nowhere to be found. Over the course of the following months, the desperate mother would launch a search that would ultimately prove fruitless. Yet just when it seemed that all hope was lost, a nine-year-old boy claiming to be Christine's son seemed to appear out of thin air. Overcome with emotions and uncertain how to face the authorities or the press, Christine invites the child to stay in her home despite knowing without a doubt that he is not her son. As much as Christine would like to accept the fact that her son has been returned to her, she cannot accept the injustice being pushed upon her and continues to challenge the Prohibition-era Los Angeles police force at every turn. As a result, Christine is slandered by the powers that be, and painted as an unfit mother. In this town, a woman who challenges the system is putting her life on the line, and as the situation grows desperate, the only person willing to aid her in her search is benevolent local activist Reverend Briegleb (John Malkovich).\n\nPlease seed and do write some comments on the quality!!\n\nEnjoy!!!","torrent":{"xt":"urn:btih:aed0d08babc0907c407771b98bcbd9a865952830","amp;dn":"Changeling+2008+%5BEng+Subs+Embedded%5D+DvDrip-soagg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aed0d08babc0907c407771b98bcbd9a865952830","infoHashBuffer":{"type":"Buffer","data":[174,208,208,139,171,192,144,124,64,119,113,185,139,203,217,168,101,149,40,48]},"announce":[],"urlList":[]}}