{"title":"Games Of Thrones Season 3","uid":9344207,"size":4414853223,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af21eb33c21b763d1425f540e3e07c7b9d7a01d8&amp;dn=Games+Of+Thrones+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rukin2","files":-1,"time":1386997880,"description":"Welcome To my torrent!! Enjoy!!\n\nGames Of Thrones S03E01-Valar Dohaeris\nJon is brought before Mance Rayder, the King Beyond the Wall, while the Night's Watch survivors retreat south. In King's Landing, Tyrion asks for his reward. Littlefinger offers Sansa a way out.\n\n\nAired March 31St, 2013\n\nGames Of Thrones S03E02-Dark Wings Dark Words\nBran and company meet Jojen and Meera Reed. Arya, Gendry, and Hot Pie meet the Brotherhood. Jamie travels through the wilderness with Brienne. Sansa confesses her true feelings about Joffery to Margaery.\n\nAired April 7th, 2013\n\nGames Of Thrones S03E03_Walk of Punishment\nRobb and Catelyn arrive at Riverrun for Lord Hoster Tully's funeral. Tywin names Tyrion the new Master of Coin. Arya says goodbye to Hot Pie. The Night's Watch returns to Craster's. Brianne and Jamie are taken prisoner.\n\nAired April 14th, 2013\n\n\nGames Of Thrones S03E04-And Now His Watch Is Ended\nJamie mopes over his lost hand. Cersei is growing uncomfortable with the Tyrells. The Night's Watch is growing impatient with Caster. Daenerys buys the Unsullied.\n\nAired April 21st, 2013\n\nGames Of Thrones S03E05-Kissed by Fire\nRobb's army is falling apart. Jamie reveals a story, to Brienne, that he has never told anyone. Jon breaks his vows. The Hound is granted his freedom. The Lannisters hatch a new plan.\n\nAired April 28th, 2013\n\nGames Of Thrones S03E06-The Climb\nJon and the wildlings scale The Wall. The Brotherhood sells Gendry to Melisandre. Robb does what he can to win back the Freys. Tyrion tells Sansa about their engagement.\n\nAired May 5th, 2013\n\nGames Of Thrones S03E07-The Bear nd the Maiden Fair\nJon and the wildlings travel south of The Wall. Talisa tells Robb that she's pregnant. Arya runs away from the Brotherhood. Daenerys arrives at Yunkai. Jamie leaves Brienne behind at Harrenhal.\nAired May 12th, 2013\n\nGames Of Thrones S03E08-Second Sons\nDaenerys tries to persuade the Second Sons to join her against Yunkai. Stannis releases Davos from the dungeons. Sam and Gilly are attacked by a White Walker. Sansa and Tyrion wed.\n\nAired May 19th, 2013\n\nGames Of Thrones S03E09\nRobb and Catelyn arrive at the Twins for the wedding. Jon is put to the test to see where his loyalties truly lie. Bran's group decides to split up. Daenerys plans an invasion of Yunkai.\n\nAired June 2nd, 2013\n\nGames Of Thrones S03E10-Mhysa\nBran and company travel beyond The Wall. Sam returns to Castle Black. Jon says good bye to Ygritte. Jamie returns to King's Landing. The Night's Watch asks for help from Stannis.\n\nAired June 9th, 2013\n\nAbout:\nSeven noble families fight for control of the mythical land of Westeros","torrent":{"xt":"urn:btih:af21eb33c21b763d1425f540e3e07c7b9d7a01d8","amp;dn":"Games+Of+Thrones+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af21eb33c21b763d1425f540e3e07c7b9d7a01d8","infoHashBuffer":{"type":"Buffer","data":[175,33,235,51,194,27,118,61,20,37,245,64,227,224,124,123,157,122,1,216]},"announce":[],"urlList":[]}}