{"title":"The Premiers - Farmer John (Live) 1964 [Party Rock'n'Roll]","uid":4918736,"size":31769270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b06232ad8413db6bd3a6ca93de8134ed632d1278&amp;dn=The+Premiers+-+Farmer+John+%28Live%29+1964+%5BParty+Rock%5C%27n%5C%27Roll%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":15,"time":1243550871,"description":"The Premiers - Farmer John (Live) 1964 [Party Rock'n'Roll]\nLP (1964) To Mp3 128 mbit/s\nIncluded: LP Covers and this Info\n\nThe Premiers were an American garage band in the 1960s, best known for their 1964 hit, &quot;Farmer John&quot;.   &lt;a href=&quot; http://en.wikipedia.org/wiki/The_Premiers&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/The_Premiers&lt;/a&gt;\nThe band was formed in 1962 in San Gabriel, California, by brothers Lawrence Perez (guitar) and John Perez (drums), and neighbours George Delgado (guitar) and Frank Zuniga (bass). They practiced in the Perez brothers back yard, encouraged by their mother, and soon started drawing crowds to their rehearsals. They were discovered by Billy Cardenas, who managed and produced other Chicano bands in the East Los Angeles area and won the group slots supporting artists such as Johnny &quot;Guitar&quot; Watson and Chris Montez.\n\nFollowing The Kingsmen's success with &quot;Louie Louie&quot;, Cardenas suggested that the Premiers cover a similar song, &quot;Farmer John&quot;, which had been written and recorded by Don and Dewey. Although claimed to have been recorded &quot;live at the Rhythm Room in Fullerton, California&quot;, it was actually recorded in a small studio in Hollywood, with overdubbed party noises provided by girls of the Chevelles car club invited to the studio. The vocals were performed by John Perez and George Delgado singing in unison.\n\nReleased on co-producer Eddie Davis' Faro record label, and later licensed by Warner Bros. Records, the single rose to #19 on the U.S. Billboard Hot 100 chart in summer 1964. The group were then rushed into recording an album, Farmer John Live, which consisted mainly of R&amp;B cover versions, again with overdubbed party noises. They also toured nationally with artists such as The Crystals and Gene Pitney, and opened for such groups as The Rolling Stones, The Kinks and The Dave Clark Five.\n\nThe group recorded several more singles up to 1967, some co-produced by Larry Tamblyn of The Standells, but none were commercially successful. First Zuniga and then Lawrence Perez were drafted, and the band split up by the end of the decade.\n\nThe Premiers' &quot;Farmer John&quot; featured on the compilation album, Nuggets: Original Artyfacts from the First Psychedelic Era, 1965-1968, issued in 1972.\n\nIn 2001 the Premiers reformed with the Perez brothers and George Delgado from the original line-up, to play occasional concerts and record.\n\n\nLINER NOTES FOR THE PREMIERS' FARMER JOHN    By Richie Unterberger  &lt;a href=&quot; http://www.richieunterberger.co","torrent":{"xt":"urn:btih:b06232ad8413db6bd3a6ca93de8134ed632d1278","amp;dn":"The+Premiers+-+Farmer+John+%28Live%29+1964+%5BParty+Rock%5C%27n%5C%27Roll%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b06232ad8413db6bd3a6ca93de8134ed632d1278","infoHashBuffer":{"type":"Buffer","data":[176,98,50,173,132,19,219,107,211,166,202,147,222,129,52,237,99,45,18,120]},"announce":[],"urlList":[]}}