{"title":"India's War (2016).pdf Gooner","uid":14995148,"size":11193274,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b08fc9cb8a57406358b308c017fa2320a3dcb891&amp;dn=India%27s+War+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466349180,"description":"India's War - World War II and the Making of Modern South Asia (2016).pdf Gooner\r\n\r\nPublisher: Basic Books (10 May 2016)\r\nLanguage: English\r\nISBN-10: 046503022X\r\nISBN-13: 978-0465030224\r\n\r\nBetween 1939 and 1945 India underwent extraordinary and irreversible change. Hundreds of thousands of Indians suddenly found themselves in uniform, fighting in the Middle East, North and East Africa, Europe and something simply never imagined against a Japanese army poised to invade eastern India. With the threat of the Axis powers looming, the entire country was pulled into the vortex of wartime mobilization. By the war's end, the Indian Army had become the largest volunteer force in the conflict, consisting of 2.5 million men, while many millions more had offered their industrial, agricultural, and military labor. It was clear that India would never be same, the only question was: would the war effort push the country toward or away from independence? \r\n\r\nIn &quot;India's War,&quot; historian Srinath Raghavan paints a compelling picture of battles abroad and of life on the home front, arguing that the war is crucial to explaining how and why colonial rule ended in South Asia. World War II forever altered the country's social landscape, overturning many Indians settled assumptions and opening up new opportunities for the nation's most disadvantaged people. When the dust of war settled, India had emerged as a major Asian power with her feet set firmly on the path toward Independence. \r\n\r\nFrom Gandhi's early urging in support of Britain's war efforts, to the crucial Burma Campaign, where Indian forces broke the siege of Imphal and stemmed the western advance of Imperial Japan, Raghavan brings this under explored theater of WWII to vivid life. The first major account of India during World War II, &quot;India s War&quot; chronicles how the war forever transformed India, its economy, its politics, and its people, laying the groundwork for the emergence of modern South Asia and the rise of India as a major power","torrent":{"xt":"urn:btih:b08fc9cb8a57406358b308c017fa2320a3dcb891","amp;dn":"India%27s+War+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b08fc9cb8a57406358b308c017fa2320a3dcb891","infoHashBuffer":{"type":"Buffer","data":[176,143,201,203,138,87,64,99,88,179,8,192,23,250,35,32,163,220,184,145]},"announce":[],"urlList":[]}}