{"title":"Infotopia : How Many Minds Produce Knowledge","uid":8946641,"size":2196513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0abcbdd2e69b5a3f0982e8f98e761ec74009ed9&amp;dn=Infotopia+%3A+How+Many+Minds+Produce+Knowledge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379792817,"description":"The rise of the &quot;information society&quot; offers not only considerable peril but also great promise. Beset from all sides by a never-ending barrage of media, how can we ensure that the most accurate information emerges and is heeded? In this book, Cass R. Sunstein develops a deeply optimistic understanding of the human potential to pool information, and to use that knowledge to improve our lives. In an age of information overload, it is easy to fall back on our own prejudices and insulate ourselves with comforting opinions that reaffirm our core beliefs. Crowds quickly become mobs. The justification for the Iraq war, the collapse of Enron, the explosion of the space shuttle Columbia--all of these resulted from decisions made by leaders and groups trapped in &quot;information cocoons,&quot; shielded from information at odds with their preconceptions. How can leaders and ordinary people challenge insular decision making and gain access to the sum of human knowledge? Stunning new ways to share and aggregate information, many Internet-based, are helping companies, schools, governments, and individuals not only to acquire, but also to create, ever-growing bodies of accurate knowledge. Through a ceaseless flurry of self-correcting exchanges, wikis, covering everything from politics and business plans to sports and science fiction subcultures, amass--and refine--information.","torrent":{"xt":"urn:btih:b0abcbdd2e69b5a3f0982e8f98e761ec74009ed9","amp;dn":"Infotopia+%3A+How+Many+Minds+Produce+Knowledge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0abcbdd2e69b5a3f0982e8f98e761ec74009ed9","infoHashBuffer":{"type":"Buffer","data":[176,171,203,221,46,105,181,163,240,152,46,143,152,231,97,236,116,0,158,217]},"announce":[],"urlList":[]}}