{"title":"Superchick - 2003 - Regeneration","uid":4874697,"size":30725576,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b0d514201d402df0d7cc9f4cae2b57bd48716e87&amp;dn=Superchick+-+2003+-+Regeneration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":9,"time":1241062626,"description":"Superchick - 2003 - Regeneration\n\n\nTRACK LISTING:\n\n01 - One Girl Revolution\n02 - Barlow Girls\n03 - Get Up\n04 - Me Against The World\n05 - Stand Up\n06 - I Belong To Ya\n07 - Princes And Frogs\n08 - One And Lonely\n09 - Hero\n\n\n\nADDITIONAL INFORMATION:\n\nSuperchick has been making waves with their unique girl-fronted pop/punk sound since their debut Karoke Superstar. They grew in musical maturity with last year's cleverly written Last One Picked, and in 2003 are seeking to reinvent their sound with their new remix record, Regeneration. The new approach takes the guys and gals into more of an industrial rock flavor. \n\nRegeneration opens strongly with &quot;One Girl Revolution (Battle Mix),&quot; giving the original anthem a fuzzy guitar rock treatment that gives the song more authority than its original mix did. Here we're given the treat of getting to hear Tricia Brock belt out the chorus before the song's close. The thing with Tricia's voice is she has amazing vocal projection but scarcely uses it as she speak-sings most of her lines. &quot;Get Up (Heelside Mix)&quot; is another good treatment as mix master Max Hsu puts a nice edge to the song. Speaking of Max's mixes, rumor has it they had hired outside help to remix the album and weren't happy with the outcome so Max went ahead and did it himself. Hey, if you want something done right, in this case, you really do gotta do it yourself... \n\nThe band's hit &quot;Me Against the World&quot; from the Legally Blonde 2 soundtrack is a highlight on Regeneration, which mixes Superchick's upbeat garage rock sound with the newer industrial flare. Being a newer original and not a mix, &quot;Me Against The World&quot; offers stronger vocals from Tricia, almost reminiscent of the Unshakable song &quot;Holy Moment&quot; from a couple years back. &quot;Barlow Girls (Space Monkey Lab Mix)&quot; is given a funkier mixer with a slight hip-hop feel to it which is only confirmed when guest vocals kick in from KJ-52. \n\nThe album falters when remixes of hits like &quot;Stand Up&quot; are a little too similar to a Linkin Park sound. The song opens with new rap verse provided by Matt with a piano trickling through the background with a chorus that only further sounds like the Linkin guys. When Tricia's original verses drop in, the song just feels disconnected from itself. The overall sound is good, but the blatant Linkin Park impression is a little hard to digest. &quot;I Belong To You (Midnight Mix)&quot; is a beautiful rock ballad that doesn't change too drastically from its original. &quot;Princes and Frogs (Underdog Mix)&quot; has never been a favorite with vocals that kind of wear thin on you after a couple listeners (but I admit is a cute song for teens). The remix just kind of makes the song sound a little more like a classic Superchick rock tune. &quot;One And Lonely (The Beatmart Mix)&quot; is given a tight, edgy, and funky update while probably my favorite Superchick song doesn't come out as nicely. Added rap vocals from Matt Dally on their &quot;Red Pill&quot; remix of &quot;Hero&quot; are painfully similar to the dismissable Emimen. Before the raps step in to disrupt an otherwise great song, the fuzzy guitars are a nice touch as well as the synth backdrop. The layered feel adds to the tragedy and severity of the song's message about watching what we do and how we influence others. I'm sorry but Matt should really stick to his bass and programming. \n\nThe album's new direction, as a whole, is a more mature and aggressive approach that works very nicely... when the band isn't sounding specifically like another artist.\n\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:b0d514201d402df0d7cc9f4cae2b57bd48716e87","amp;dn":"Superchick+-+2003+-+Regeneration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0d514201d402df0d7cc9f4cae2b57bd48716e87","infoHashBuffer":{"type":"Buffer","data":[176,213,20,32,29,64,45,240,215,204,159,76,174,43,87,189,72,113,110,135]},"announce":[],"urlList":[]}}