{"title":"Defensive Database Programming with SQL Server - Alex Kuznetsov","uid":8422095,"size":5894412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b10ee9a9cd6cd7fb4ae5b29eb1fdea0152b982bd&amp;dn=Defensive+Database+Programming+with+SQL+Server+-+Alex+Kuznetsov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pablozky","files":1,"time":1367229046,"description":"Resilient T-SQL code is code that is designed to last, and to be safely reused by others. The goal of defensive database programming, the goal of this book, is to help you to produce resilient T-SQL code that robustly and gracefully handles cases of unintended use, and is resilient to common changes to the database environment.\n\nToo often as developers, we stop work as soon as our code passes a few basic tests to confirm that it produces the 'right result' in a given use case. We do not stop to consider what other possible ways in which the code might be used in the future, or how our code will respond to common changes to the database environment, such as a change in the database language setting, or a change to the nullability of a table column, and so on.\n\nIn the short-term, this approach is attractive; we get things done faster. However, if our code is designed to be used for more than just a few months, then it is very likely that such changes can and will occur, and the inevitable result is broken code or, even worse, code that silently starts to behave differently, or produce different results. When this happens, the integrity of our data is threatened, as is the validity of the reports on which critical business decisions are often based. At this point, months or years later, and long after the original developer has left, begins the painstaking process of troubleshooting and fixing the problem.\n\nWould it not be easier to prevent all this troubleshooting from happening? Would it not be better to spend a little more time and effort during original development, to save considerably more time on troubleshooting, bug fixing, retesting, and redeploying?\n\nThis is what defensive programming is all about: we learn what can go wrong with our code, and we proactively apply this knowledge during development. This book is filled with practical, realistic examples of the sorts of problems that beset database programs, including:\n\nChanges in database objects, such as tables, constraints, columns, and stored procedures\nChanges to concurrency and isolation levels\nUpgrades to new versions of SQL Server\nChanges in requirements\nCode reuse\nProblems causing loss of data integrity\nProblems with error handling in T-SQL\nIn each case, it demonstrates approaches that will help you understand and enforce (or eliminate) the assumptions on which your solution is based, and to improve its robustness. Ultimately, the book teaches you how to think and develop defensively, and how to proactively identify and eliminate potential vulnerabilities in T-SQL code.\n\nAbout the author\n\nAlex Kuznetsov has been working with databases for more than a decade. Currently he leads database development and optimizes database performance for a trading firm.","torrent":{"xt":"urn:btih:b10ee9a9cd6cd7fb4ae5b29eb1fdea0152b982bd","amp;dn":"Defensive+Database+Programming+with+SQL+Server+-+Alex+Kuznetsov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10ee9a9cd6cd7fb4ae5b29eb1fdea0152b982bd","infoHashBuffer":{"type":"Buffer","data":[177,14,233,169,205,108,215,251,74,229,178,158,177,253,234,1,82,185,130,189]},"announce":[],"urlList":[]}}