{"title":"Allegheny Uprising (1939) Xvid 1cd - Western - John Wayne, Clair","uid":10513872,"size":900554752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1e552a6e1a5cb1dbd32e5e6976733399a6e5007&amp;dn=Allegheny+Uprising+%281939%29+Xvid+1cd+-+Western+-+John+Wayne%2C+Clair&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":3,"time":1404880971,"description":"Allegheny Uprising (1939) Xvid 1cd - Western - John Wayne, Claire Trevor [DDR]\n\nAllegheny Uprising is a 1939 film produced by RKO Pictures, starring Claire Trevor and John Wayne as pioneers of early American expansion in south western Pennsylvania. Clad in buckskin and a coonskin cap (as he would be a decade later in The Fighting Kentuckian), Wayne plays real-life James Smith, an American coping with British rule in colonial America. The film is loosely based on a historical event known as the Black Boys Rebellion of 1765, after the conclusion of the French and Indian War.\n\nThe film did not fare well in its initial release. The superficially similar John Ford film Drums Along the Mohawk had been released only one week prior. Retitled The First Rebel for the United Kingdom, it was banned by the Ministry of Information for placing the British, already at war against Nazi Germany, in a bad light.\n\nThe supporting cast includes Brian Donlevy, George Sanders, and Chill Wills, and the movie was written by P. J. Wolfson from the 1937 novel The First Rebel by Neil H. Swanson and directed by William A. Seiter. Claire Trevor and John Wayne also headed the cast of John Ford's Stagecoach the same year, and in Allegheny Uprising Trevor is top-billed over Wayne, due to her greater name value at the time.\n\n    CAST:-\n    Claire Trevor as Janie MacDougall\n    John Wayne as James Smith\n    George Sanders as Capt. Swanson\n    Brian Donlevy as Trader Ralph Callendar\n    Wilfrid Lawson as &quot;Mac&quot; MacDougall\n    Robert Barrat as Magistrate Duncan\n    John F. Hamilton as The Professor\n    Moroni Olsen as Tom Calhoon\n    Eddie Quillan as Will Anderson\n    Chill Wills as John M'Cammon\n    Ian Wolfe as Mr. Poole\n\nDirected by William A. Seiter\nRunning time 81 min.\n\nSYNOPSIS:- Allegheny Uprising (1939)\nIn the south western Pennsylvania area of colonial America in the 1760s, colonial distaste and disapproval of the British government is starting to surface. Many local colonists have been killed by American Indians who are armed with rifles supplied by white traders. Local adventurer James Smith (John Wayne) and his followers complain to British officials, pressuring them to make it illegal to trade weapons to the native population. Trader Ralph Callender (Brian Donlevy) and other businessmen are not happy with the new laws, seeing as it cuts into their profit. They begin to trade with the local native American population, hiding rifles and rum inside military supply trains. When the British authorities fail to do anything to prevent this, James Smith organizes his men and heads out to intercept the wagon train. Smith's spirited and bold girlfriend, Janie McDougall (Claire Trevor), assists him and his men in posing as Indians to intercept the gun shipments.\n\nCaptain Swanson, a British army officer, is sent to protect the wagon train at all costs following a complaint lodged by Callender that Smith and his men intend on robbing the wagon train, while neglecting to state that the train contains guns and liquor. Captain Swanson considers the involvement of Smith and his men as a revolt to his authority, and in retaliation he jails more than half of the local colonists, holding them without trial. This sets Smith and Swanson on a collision course.\nThe film recorded a loss of $230,000.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 81 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 81 mins","torrent":{"xt":"urn:btih:b1e552a6e1a5cb1dbd32e5e6976733399a6e5007","amp;dn":"Allegheny+Uprising+%281939%29+Xvid+1cd+-+Western+-+John+Wayne%2C+Clair","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e552a6e1a5cb1dbd32e5e6976733399a6e5007","infoHashBuffer":{"type":"Buffer","data":[177,229,82,166,225,165,203,29,189,50,229,230,151,103,51,57,154,110,80,7]},"announce":[],"urlList":[]}}