{"title":"Richard Price-The Whites","uid":13178828,"size":299738771,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b30d7214da796fe42081aa3345a066d72d6eb0b4&amp;dn=Richard+Price-The+Whites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metheguy","files":11,"time":1452325354,"description":"Written by Richard Price\r\nFormat: MP3\r\nUnabridged\r\n\r\n\r\n\r\nThe Whites is the electrifying debut of a new master of American crime fiction, Harry Brandt—the pen name of novelist Richard Price Back in the run-and-gun days of the mid-90s, when Billy Graves worked in the South Bronx as part of an anti-crime unit known as the Wild Geese, he made headlines by accidentally shooting a 10-year-old boy while stopping an angel-dusted berserker in the street. Branded as a cowboy by his higher-ups, for the next eighteen years Billy endured one dead-end posting after another. Now in his early forties, he has somehow survived and become a sergeant in Manhattan Night Watch, a small team of detectives charged with responding to all night-time felonies from Wall Street to Harlem.Night Watch usually acts a set-up crew for the day shift, but when Billy is called to a 4:00 a.m. fatal slashing of a man in Penn Station, his investigation of the crime moves beyond the usual handoff. And when he discovers that the victim was once a suspect in the unsolved murder of a 12-year-old boy—a brutal case with connections to the former members of the Wild Geese—the bad old days are back in Billy's life with a vengeance, tearing apart enduring friendships forged in the urban trenches and even threatening the safety of his family.Richard Price, one of America's most gifted novelists, has always written brilliantly about cops, criminals, and New York City. Now, writing as Harry Brandt, he is poised to win a huge following among all those who hunger for first-rate crime fiction","torrent":{"xt":"urn:btih:b30d7214da796fe42081aa3345a066d72d6eb0b4","amp;dn":"Richard+Price-The+Whites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b30d7214da796fe42081aa3345a066d72d6eb0b4","infoHashBuffer":{"type":"Buffer","data":[179,13,114,20,218,121,111,228,32,129,170,51,69,160,102,215,45,110,176,180]},"announce":[],"urlList":[]}}