{"title":"Mr.Big - Mr.Big [1977] UK Classic Rock","uid":4270799,"size":35420380,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b320481808870e818750e8173282ed2911564943&amp;dn=Mr.Big+-+Mr.Big+%5B1977%5D+UK+Classic+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweetthing","files":10,"time":1214931151,"description":"Mr.Big - Mr.Big [1977] HQ Vinyl / Lame Rip @ 128kbps UNAVAILABE ON CD\n\n 01 - Photographic Smile.mp3 (3.21 megabyte)\n 02 - Romeo.mp3 (2.56 megabyte)\n 03 - What Colour Is The Wind.mp3 (3.22 megabyte)\n 04 - Louisiana Street.mp3 (2.23 megabyte)\n 05 - Feel Like Calling Home.mp3 (3.32 megabyte)\n 06 - Goodbye World.mp3 (2.23 megabyte)\n 07 - Vampire.mp3 (3.7 megabyte)\n 08 - Hold Me.mp3 (3.06 megabyte)\n 09 - Can We Live - Angel Of My Life.mp3 (6.77 megabyte)\n 10 - Easy.mp3 (3.47 megabyte)\n\n\nRipped from good quality vinyl for your listening pleasure. The vinyl was centralized which means there was absolutely no side to side movement of the tone arm. This is usually the major flaw with vinyl as it causes a &quot;WOWING&quot; effect noticable to most audiophiles. It is caused by the hole not being entirely central and is more annoying than the occasional click in my opinion. Also in use on the Dual 505 Record Deck was a Platter Pad [a solid rubber, turntable mat, about 1 and a half cm thick] which no user of vinyl should be without. It enhances the sound no end!\n\n\nBiography\n\nThe members of Mr Big had been playing together since the late 1960s, under the name &amp;#039;Burnt Oak&amp;#039;. They first played under the name Mr Big in 1972, at the Marquee Club in Oxford Street, London, when the manager billed them as Mr Big instead of Burnt Oak. The manager refused to change it, so it stuck for the rest of the band&amp;#039;s career.\n\nIn 1974 the band signed to Epic Records, releasing three singles, none of which made a significant breakthrough, but which did lead to appearances on Lift Off a TV pop show presented by Ayesha Brough, and Softly, Softly: Taskforce, a police drama, in which actor/singer Paul Nicholas played the lead singer.\n\nIn 1975 Bob Hirschman, then manager of Mott the Hoople, took over as the band&amp;#039;s manager. Their first album, Sweet Silence, was released on EMI, to greater acclaim than their previous singles. Promotional TV appearances for this album included Supersonic with Mike Mansfield and Superpop. In November 1975, Mr Big supported Queen on their A Night at the Opera tour.\n\nIn 1976 Mr Big embarked on their own UK headline tour and supported Sweet on their tour of Europe, performing on TV in Denmark, Holland and the UK. Mr Big were also the first British band to be signed to Clive Davis&amp;#039;s Arista Records in America.[citation needed] They recorded their second album, Mr Big, in Los Angeles, California with Val Garay.\n\nIn 1977 the band toured the United States in February, March and April with Tom Petty, Journey, Kansas and The Runaways. Meanwhile, the single &quot;Romeo&quot; reached No. 4 in the UK Singles Chart[1] , despite a temporary ban by the BBC. It also sold well in Japan, Australasia, the U.S. and parts of Europe, and has since been covered by a band in South Africa. The follow up single &quot;Feel Like Calling Home&quot; failed to capitalise on the success of the previous one, and only reached No. 35 in UK.[1] The band embarked on a UK headline tour with more television appearances in the UK and Europe.\n\nIn 1978 the third album Seppuku was recorded with Ian Hunter as producer and the band again toured the UK. They appeared on Top Of The Pops with &quot;Senora&quot;, and split up soon afterwards.\n\nDicken and bassist Pete Crowther went on to form another band named Broken Home, which released two albums and played the Reading Festival in 1980, also scoring a couple of minor hits in Norway and Germany. Dicken has since collaborated with a variety of different artists under various different names, as well as releasing solo material and performing Mr Big greatest hits tours. The current Mr Big consists of originals Dicken and Eddie Carter with new members on bass, keyboards and percussion. Their last album, Rainbow Bridge, was released in 1996.\n\n","torrent":{"xt":"urn:btih:b320481808870e818750e8173282ed2911564943","amp;dn":"Mr.Big+-+Mr.Big+%5B1977%5D+UK+Classic+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b320481808870e818750e8173282ed2911564943","infoHashBuffer":{"type":"Buffer","data":[179,32,72,24,8,135,14,129,135,80,232,23,50,130,237,41,17,86,73,67]},"announce":[],"urlList":[]}}