{"title":"Billy Connolly - Journey To The Edge Of The World S01E03.avi","uid":4843986,"size":366773362,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3843d8247163a390825f852a0ba03aefc753c10&amp;dn=Billy+Connolly+-+Journey+To+The+Edge+Of+The+World+S01E03.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Deibido72","files":1,"time":1239614029,"description":"In the summer of 2008 Billy Connolly set sail on a ten-week journey from ocean to ocean: from the Atlantic to the Pacific, by way of the Northwest Passage - a fabled route deep within the Arctic Circle that has thwarted explorers and fortune-hunters for centuries. For Cook, Drake and countless other adventurers, the Northwest Passage has been an alluring but impossible journey, a trial of unparallelled physical and mental strength, a haunting and fascinating wilderness. Now the Arctic is melting at a rate of 36,000 square miles a year and the journey is finally possible. For the first time, if you're quick, you can sail freely, if precariously, from Newfoundland right round to Vancouver. By plane, rail, road and boat, along coastlines and across sweeping landscapes that represent the final Northern frontier of the inhabited world for both man and beast, Billy's adventure will embrace a memorable mix of bizarre encounters, Hemingway-esque characters, incredible wildlife, forgotten languages, big game hunting and all night carousing under the midnight sun. And he's taking us with him.","torrent":{"xt":"urn:btih:b3843d8247163a390825f852a0ba03aefc753c10","amp;dn":"Billy+Connolly+-+Journey+To+The+Edge+Of+The+World+S01E03.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3843d8247163a390825f852a0ba03aefc753c10","infoHashBuffer":{"type":"Buffer","data":[179,132,61,130,71,22,58,57,8,37,248,82,160,186,3,174,252,117,60,16]},"announce":[],"urlList":[]}}