{"title":"panopticum lens pro 3 for after effects","uid":3699146,"size":4667751,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b3a6b717c6e3208b980a18da2f70418e06556106&amp;dn=panopticum+lens+pro+3+for+after+effects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sanchez12","files":2,"time":1180338326,"description":"Lens Pro 3 is a universal tool that helps you design genuine lenses and 3D-crystals.\n\nWith this tool you can create 7 types of lenses:\nEllipse, Square, Droplet, Torus, Border, Clam and Rose;\n\n15 kinds of 3D crystals: Cube, Cube Bevel, Prism, Prism Polygon, Prism Polygon Bevel, Prism Polygon Bevel and Back, Pyramid, Pyramid Back, Pyramid Polygon, Pyramid Polygon and Back, Diamond, Star, Tetrahexahedron, Hexoctahedron and Resolit;\n\nParticles System is a group of parameters that help you create a system of lens and crystal particles.\n\nFoam Lens a set of powerful tools designed to create various glass and crystal textures and backgrounds. You can create fascinating effects by adjusting parameters of particles movement and by animating backgrounds.\n\n3D Object lets you work with VRML and 3DS 3D models imported to your project.\n\nUniversal Lens - a set of useful tools that help you create a variety of glass and crystal figures and surfaces. This set features 3 types of effects: Triangular Surface, Contour Mask and Gradient Mask.\n\nFor each lens and crystal effect there&amp;#039;s a wide range of adjustable parameters that let you modify the shape, optical properties, position and illumination of crystals and lenses. By adjusting optical properties you can set and modify refraction, color deviation of the glass, its volume, direction and color of the flashing lights.","torrent":{"xt":"urn:btih:b3a6b717c6e3208b980a18da2f70418e06556106","amp;dn":"panopticum+lens+pro+3+for+after+effects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3a6b717c6e3208b980a18da2f70418e06556106","infoHashBuffer":{"type":"Buffer","data":[179,166,183,23,198,227,32,139,152,10,24,218,47,112,65,142,6,85,97,6]},"announce":[],"urlList":[]}}