{"title":"ADOBE PHOTOSHOP CS5 EXTENDED 12.0 MULTILINGUAL PORTABLE [ak]","uid":6370255,"size":67735119,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b3c7a52ce9e0c824b7a1c99d9032046292d7e062&amp;dn=ADOBE+PHOTOSHOP+CS5+EXTENDED+12.0+MULTILINGUAL+PORTABLE+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1304657864,"description":"ADOBE PHOTOSHOP CS5 EXTENDED 12.0 MULTILINGUAL PORTABLE\n\nAdobe Photoshop CS5 Extended software helps you create the ultimate images for print, the web, and video. Get all the state-of-the-art editing, compositing, and painting capabilities in industry-standard Photoshop CS5 plus tools that let you create and edit 3D images and motion-based content.\n\nGo beyond traditional digital imaging. Easily select intricate image elements, such as hair. See space fill in almost magically when you remove image elements. Create 3D logos and artwork by easily extruding text and other 2D graphics.\n\n* Extraordinary painting effects: Achieve natural and realistic painting effects with the Mixer Brush, which offers on-canvas color blending; Bristle Tips, which let you create lifelike, textured brush strokes; an onscreen color picker; and more.\n\n* Content-Aware Fill: Remove any image detail or object and watch as Content-Aware Fill magically fills in the space left behind. This breakthrough technology matches lighting, tone, and noise so it looks as if the removed content never existed.\n\n* Complex selections made easy: Easily select intricate image elements, such as hair, for refinements, compositing, or placing in layout. Eliminate background color around selection edges, and automatically vary selection edges and perfect masks using new refinement tools.\n\n* Puppet Warp: Precisely warp or stretch graphics, text, or image elements to create unique new looks for your designs.\n\n* Superior HDR imaging: Create photo-realistic or surreal HDR images with unprecedented speed, control, and accuracy. Get better-than-ever results thanks to automatic ghost removal and greater control with tone mapping and adjustments, and even give single-exposure photos the look of HDR.\n\n* Efficient workflow: Enjoy productivity and creativity boosts thanks to dozens of features and enhancements requested by Photoshop users. Straighten images automatically, choose colors from an onscreen color picker, adjust the opacity of many layers at once, and more.\n\n* Better media management: Easily manage media with more flexible batch renaming, and access your assets in the context of what you're working on by using the customizable Adobe Mini Bridge panel in Photoshop Extended.\n\n* 3D extrusions with Adobe Repousse: Create 3D logos and artwork from any text layer, selection, path, or layer mask with Adobe Repousse technology. Twist, rotate, extrude, bevel, and inflate your designs.\n\n* State-of-the-art raw image processing: Use the Adobe Photoshop Camera Raw 6 plug-in to nondestructively remove image noise while preserving color and detail; add grain to make digital photos look more organic; enjoy more control when performing post-crop vignetting; and more.\n\n* Enhanced 3D realism and rich materials: Enhance 3D objects and designs with easy shadow creation, image-based lights, and materials like glass and chrome. Explore with different focus points in your 3D scene by adjusting the range for depth of field.\n\n* Faster performance across platforms: Speed up day-to-day imaging tasks and process very large images up to 10 times faster by taking advantage of cross-platform 64-bit support. (Requires a 64-bit-capable computer with a 64-bit version of Mac OS, MicrosoftÃ‚Â® WindowsÃ‚Â® 7, or Windows VistaÃ‚Â®. Actual performance varies depending on amount of RAM, driver types, and other factors.)\n\nNote: Installer in Portable Apps format (.paf), at least 350 MB diskpace required for installation.\n\nHome Page - http://www.adobe.com\n","torrent":{"xt":"urn:btih:b3c7a52ce9e0c824b7a1c99d9032046292d7e062","amp;dn":"ADOBE+PHOTOSHOP+CS5+EXTENDED+12.0+MULTILINGUAL+PORTABLE+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c7a52ce9e0c824b7a1c99d9032046292d7e062","infoHashBuffer":{"type":"Buffer","data":[179,199,165,44,233,224,200,36,183,161,201,157,144,50,4,98,146,215,224,98]},"announce":[],"urlList":[]}}