{"title":"Meade Star Locator II (Epoch 2000 Lite) - Astronomy Software","uid":8617163,"size":1396973,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b3ecdec87915529587bc87bfeab1267e33fd5caa&amp;dn=Meade+Star+Locator+II+%28Epoch+2000+Lite%29+-+Astronomy+Software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mkpelican","files":-1,"time":1372282164,"description":"Meade Astronomy Software\n\n=================\nSTAR LOCATOR II\n\n(EPOCH 2000 Lite)\n=================\n\n\nReleased in 1997 for use with the Meade LX 200, this software is simple to use and pretty comprehensive for beginners and ultra-serious amateurs alike. It comes packed with NGC, SAO, IC and Messier catalog objects as well as having a sizeable array of data files covering stars, constellations, boundries, deep sky objects, both named and numbered asteroids, comets, planets. It permits the user to add in user defined objects simply by clicking on its coordinates. Comprehensive ephemeris text tables can be generated with just a click. You can set your viewing location and have it saved for future use. It offers the ability to add viewing notes and object details for any session (past or present). Developed before Windows98 was released, many .dat files are ASCII text which can be edited if desired. All user settings such as fonts, colors, display info, lines, views, magnitude preferences, etc., are saved to an INI file in the Windows directory so running in Windows95 compatibility mode will certainly help stave off potential problems.\n\n\nAnd as if that isn't enough, the software permits you to animate the map both automatically and manually in user defined steps for as far into the future (or past) you wish to travel. Or you can click on &quot;Go to Current Zenith&quot; to see what's up above you at any given moment.\n\n\n***PLEASE NOTE: When you open the program, you must go into the Starmap menu and turn the map on to see anything. I've tried to drive other Meade telescopes with this software using its Port Setup feature, to no avail. If you happen to have a telescope with a motorized mount and it has a COM port, perhaps you will have better luck. \n\n\nInstallation: Rename the self-extracting executable to &quot;Starfind.exe&quot; and run it in Windows95 compatibility mode. No serial # is required.\n\n\nTip: Manually edit the &quot;cities.dat&quot; file placing your viewing location(s) at the top of the list if you find yourself wanting to easily switch viewing locations. This keeps you from having to remember the multiple latitudes, longitudes and elevations.","torrent":{"xt":"urn:btih:b3ecdec87915529587bc87bfeab1267e33fd5caa","amp;dn":"Meade+Star+Locator+II+%28Epoch+2000+Lite%29+-+Astronomy+Software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ecdec87915529587bc87bfeab1267e33fd5caa","infoHashBuffer":{"type":"Buffer","data":[179,236,222,200,121,21,82,149,135,188,135,191,234,177,38,126,51,253,92,170]},"announce":[],"urlList":[]}}