{"title":"Blood.And.Oil.2010.DVDRip.XviD.UNDEAD","uid":5554125,"size":1466951680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b58e3d9df664a1153608a898064a6f778542a8a9&amp;dn=Blood.And.Oil.2010.DVDRip.XviD.UNDEAD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"agentpiratebay","files":-1,"time":1273632165,"description":"Alice, a British-Nigerian PR exec, travels to the Niger Delta to represent an oil firm during a hostage crisis...\n\nMark Unwin is one of four employees of Krielsen International oil company captured by militant group MEND whilst they are working in Nigeria. His wife Claire flies out with Alice Onuko, Nigerian-born,British-raised P.R. for Krielsen. When the women arrive in Port Harcourt they are told a ransom has been agreed - as is the norm since MEND depends on ransoms to fund itself.\n\nHowever when civil rights worker Keme, acting as go-between, escorts the women to the handover place they find only the corpses of Mark and his co-workers.\n\nNext day Claire meets a journalist who tells her the men were killed by the Nigerian government after their release by MEND and he is himself later found dead. She also learns that he was having an affair with Angel, a prostitute,whom she confronts but who is whisked away in a car before she can say anything.\n\nAlice is equally shocked to find that her father has made his money less than scrupulously from oil. Keme is jailed but Alice levers Tunde,the police chief, into releasing him despite Tunde's efforts to silence her. Keme takes Alice and Claire deep into the jungle to meet MEND leader Ebi who swears that Mark's murderers were Nigerian officers under Tunde,who staged the massacre to blame MEND.\n\nMark and his dead colleagues were being recruited as mercenaries against the government, a fact Claire does not reveal in her press statement when she returns to England. Keme continues to canvass for equality in Nigeria,with a new recruit - Alice.\n. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1337578/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1337578/&lt;/a&gt;\n\nScreenshots:\nhttp://bayimg.com/image/oamomaaci.jpg\nhttp://bayimg.com/image/aampjaaci.jpg","torrent":{"xt":"urn:btih:b58e3d9df664a1153608a898064a6f778542a8a9","amp;dn":"Blood.And.Oil.2010.DVDRip.XviD.UNDEAD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58e3d9df664a1153608a898064a6f778542a8a9","infoHashBuffer":{"type":"Buffer","data":[181,142,61,157,246,100,161,21,54,8,168,152,6,74,111,119,133,66,168,169]},"announce":[],"urlList":[]}}