{"title":"Jeff Lindsay - Dexter  The Complete Set (Unabridged) earReaders","uid":3958737,"size":1638468563,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5c5e5c1bd7cc53e764361a0d777650ba6ae009e&amp;dn=Jeff+Lindsay+-+Dexter++The+Complete+Set+%28Unabridged%29+earReaders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"earReaders","files":86,"time":1199315769,"description":"                       \n\n\n                        Jeff Lindsay - Dexter Complete Set (Unabridged)\n\n\n                        DEXTER IN THE DARK\n                        DEARLY DEVOTED DEXTER\n                        DARKLY DREAMING DEXTER\n\n\n             ****************************************************\n              \n             \n                        Type       : MP3 Audiobook; (Fiction) Unabridged\n                        Source     : various\n                        Publisher  : Recorded Books\n                        Language   : English\n                        Narrator   : Nick Landrum\n                        Encoder    : GoldWave\n                        Codec      : LAME 3.91\n                        Bitrate    : 128ks - 96K/s  Mono\n                        Packed By  : earReaders\n                        \n                        Language   : English\n\n\n             ****************************************************                                                                      \n\n\n                         \n\n                       &lt;a href=&quot; http://www.randomhouse.com/doubleday/dexter/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.randomhouse.com/doubleday/dexter/&lt;/a&gt;\n          \n\n\n                                                                             \n             ****************************************************\n\n\nAbout the Books\n\t\n\nDEXTER IN THE DARK\n\nIn his work as a Miami crime scene investigator, Dexter Morgan is not unaccustomed to seeing evil deeds?particularly because, on occasion, he commits them himself. Guided by his Dark Passenger (the reptilian voice inside him), he lives his outwardly normal life adhering to one simple rule: he only kills very bad people. But Dexter?s happy existence is turned upside-down when he is called to a particularly disturbing crime scene at the university campus. Dexter?s Dark Passenger immediately senses something it recognizes, something utterly chilling, and the Dark Passenger?mastermind of Dexter?s investigative and homicidal prowess?goes into hiding.\n\nDexter is alone for the first time in his life, and he realizes he?s being hunted by an adversary more sinister than anything he?s ever faced. Dexter must summon his sharpest investigative powers not only to pursue his enemy, but to locate?and truly understand?his Dark Passenger. It is nothing less than a search for his own dark soul?fueled by a steady supply of cream-filled donuts.\n\nMacabre, ironic, and wonderfully entertaining, DEXTER IN THE DARK goes deeper into the dark psyche of one of the freshest protagonists in recent fiction.\n\nDEARLY DEVOTED DEXTER\n\nHe&amp;#039;s a charming monster . . .\nA macabre hero . . .\nA serial killer who only kills bad people\n\n\nDexter Morgan has been under considerable pressure. It&amp;#039;s just not easy being an ethical serial killer?especially while trying to avoid the unshakable suspicions of the dangerous Sergeant Doakes (who believes Dexter is a homicidal maniac . . . which, of course, he is). In an attempt to throw Doakes off his trail, Dexter has had to slip deep into his foolproof disguise. While not working as a blood-spatter analyst for the Miami Police Department, he now spends nearly all his time with his cheerful girlfriend, Rita, and her two children, sipping light beer and slowly becoming the world&amp;#039;s first serial couch potato. But how long can Dexter play Kick the Can instead of Slice the Slasher? How long before his Dark Passenger forces him to drop the charade and let his inner monster run free?\n\nIn trying times, opportunity knocks. A particularly nasty psychopath is cutting a trail through Miami?a man whose twisted technique leaves even Dexter speechless. As Dexter&amp;#039;s dark appetite is revived, his sister, Deborah (a newly minted, tough-as-nails Miami detective) is drawn headlong into the case. It quickly becomes clear that it will take a monster to catch a monster?but it isn&amp;#039;t until his archnemesis is abducted that Dex can finally throw himself into the search for a new plaything. Unless, of course, his plaything finds him first . . .\n\nWith the incredible wit and freshness that drew widespread acclaim to Darkly Dreaming Dexter, Jeff Lindsay now takes Dexter Morgan to a new level of macabre appeal and gives us one of the most original, colorful narrators in years.\n\n\nDARKLY DREAMING DEXTER\n\nMeet Dexter Morgan, a polite wolf in sheep&amp;#039;s clothing... a monster who cringes at the sight of blood... a serial killer whose one golden rule makes him immensely likable: HE ONLY KILLS BAD PEOPLE.\n\nDexter Morgan isn&amp;#039;t exactly the kind of man you&amp;#039;d bring home to Mom. Though he&amp;#039;s playful and has a wonderfully ironic sense of humor, Dexter&amp;#039;s one character flaw (his proclivity for murder) can be off-putting. But at heart Dexter is the perfect gentleman, supportive of his sister, Deb, a Miami cop, and interested only in doing away with people who really deserve his special visit. Dex is quite good-looking but totally indifferent to (and, frankly, a bit puzzled by) the attention paid to him by women. Despite the fact that he cant&amp;#039; stand the sight of blood, he works as a blood-splatter analyst for the Mmiami police department, a job that allows him to keep tabs on the latest crimes and keep an eye open for his next quarry.\n\nDexter&amp;#039;s well-organized life is suddenly disrupted when a second, much more visible serial killer appears in Miami. Dex is intrigued, even delighted, by the fact that the other killer appears to have a style reminiscent of his own. Yet he can&amp;#039;t help but feel that the mysterious new arrival is not merely invading his turf but reaching out to him as well. This new killer seems to be doing more tha copying Dexter?he seems to be saying, &quot;Come out and play.&quot; Dexter&amp;#039;s secret life makes for a lonely existence... even a lovable monster can be intrigued by the prospect of finding a friend.\n\nIntroducing one of the most witty and orginial narrators in years, Jeff Lindsay&amp;#039;s Darkly Dreaming Dexter is a fresh, surprising, and brilliantly executed novel.\n\n \n             ****************************************************\n\nIf you like audio books please buy some. Then share.\n\nEnclosed in every book released are the tools required to convert almost all audiobook file formats and DRM files to .mp3\n\nIf you would like help converting your Audible .aa files, or Apple .m4b files to .mp3 for use on whatever device YOU choose, please see the converting instructions included and email any further questions to..                                                                                        \n\n                                     &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d1b4b0a383b4b0b5b4a3a291b6bcb0b8bdffb2bebc&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n \n                                   \n             ****************************************************\n\t\t\t\t","torrent":{"xt":"urn:btih:b5c5e5c1bd7cc53e764361a0d777650ba6ae009e","amp;dn":"Jeff+Lindsay+-+Dexter++The+Complete+Set+%28Unabridged%29+earReaders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5c5e5c1bd7cc53e764361a0d777650ba6ae009e","infoHashBuffer":{"type":"Buffer","data":[181,197,229,193,189,124,197,62,118,67,97,160,215,119,101,11,166,174,0,158]},"announce":[],"urlList":[]}}