{"title":"Time.Team.S20xE11.An.Englishmans.Castle.(Xvid)","uid":8261072,"size":401055744,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b7de1835d56cd17ecd9f5e635105a552001ef5a1&amp;dn=Time.Team.S20xE11.An.Englishmans.Castle.%28Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pspxxx","files":1,"time":1363382256,"description":"Time Team\n\nSeries 20 | Episode 11 | An Englishman's Castle\n\nWhat happens when you try to create your own grand design but find a mystery at the heart of your home, and its origins are so unclear that it could either be medieval or Victorian? You call in Time Team to help you work out the answers. \n\nWhen Steve and Pru Barlow fell in love with pretty Upton Castle in Pembrokeshire they had little idea what they were buying. Acres of overgrown gardens surrounded the building, which looked like a medieval castle at the front and a Victorian mansion at the back. \n\nIt was a romantic mystery. Is it part of the network of castles built by Anglo-Norman invaders to defend themselves against Welsh tribes? Or perhaps a Victorian folly? \n\nTwo effigies in the castle's chapel may provide a key clue, but are they originals or copies? And the chapel's age and origins are no clearer than the castle's. \n\nTony and the Team dig trenches as they look for a medieval courtyard, building specialists crawl through the roof, there's digging out front for the remains of a drawbridge, and there's a mound of documents to pore over... and some wet Welsh weather to contend with. \n\nCan the Team determine if Steve and Pru's home really was one of the Anglo-Norman castles built to defend 'Little England beyond Wales' from the locals?","torrent":{"xt":"urn:btih:b7de1835d56cd17ecd9f5e635105a552001ef5a1","amp;dn":"Time.Team.S20xE11.An.Englishmans.Castle.%28Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7de1835d56cd17ecd9f5e635105a552001ef5a1","infoHashBuffer":{"type":"Buffer","data":[183,222,24,53,213,108,209,126,205,159,94,99,81,5,165,82,0,30,245,161]},"announce":[],"urlList":[]}}