{"title":"Saves the Day - Discography (1998-2013) [FLAC]","uid":8945867,"size":3052467310,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b8620b9a9d2a7143ce8d01e31c4e311cd68105ed&amp;dn=Saves+the+Day+-+Discography+%281998-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1379774198,"description":"\n  Saves the Day - Discography (1998-2013) [FLAC]\n\n  Gnere: Pop/Rock\n  Styles: Alternative, Indie Rock, Emo, Punk-Pop\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Dpeth: 16\n  Sampling Rate: 44,100 Hz\n\n  1998 Can't Slow Down\n  1999 Through Being Cool\n  2001 I'm Sorry I'm Leaving (Acoustic EP)\n  2001 STay What You Are\n  2002 Freakish (Single)\n  2003 In Reverie\n  2004 Ups &amp; Downs Early Recordings and B-Sides\n  2006 Bug Sessions Vol. 1 (EP)\n  2006 Sound the Alarm\n  2007 Under the Boards\n  2008 Bug Sessions Vol. 2 (EP)\n  2008 Bug Sessions Vol. 3 (EP)\n  2011 Daybreak\n  2013 Saves the Day\n\n  Perfecting their power pop rock since the mid-'90s, New Jersey's Saves the Day call it like it is. They refrain from characteristic pogo-bouncing anthems for their own quirky post-punk and energetic live shows, influencing a new school of emo/punk bands along the way. The first incarnation of Saves the Day happened when singer/songwriter Chris Conley was only 13, and the band was first called Indifference and, later, Seffler. A name change to their current moniker, taken from a lyric from the Farside song &quot;Hero,&quot; came with the recording of their first demo. Conley (vocals), Eben D'Amico (bass), Ted Alexander (guitar), David Soloway (guitar), and Bryan Newman (drums) made their debut with 1997's Can't Slow Down on Equal Vision Records, though D'Amico didn't join the lineup until after this album. Recorded during winter break of their high-school senior year, the record featured production work from Steve Evetts (Sepultura, Dillinger Escape Plan, Sick of It All).\n\n  Through Being Cool followed two years later, gaining a wider fan base and critical success among select punk markets with its greater pop sensibility. However, Saves the Day changed things up for 2001's Stay What You Are. Their third installment, and first release for Vagrant Records, Stay What You Are brought Rob Schnapf (Beck, Elliott Smith, Toadies) to the mixing boards for a more structured punk rock effort. The album sold more than 200,000 copies, landed on the Billboard charts, and produced two heavily rotated MTV2 videos for &quot;At Your Funeral&quot; and &quot;Freakish.&quot; Lots of touring followed; they headlined 2001's Vagrant tour with labelmates Dashboard Confessional, and scored opening slots for Weezer and the Pop Disaster Tour with Green Day and blink-182.\n\n  In Reverie, the band's first for DreamWorks and with new drummer Pete Parada, followed two years later. Vagrant issued Ups &amp; Downs: Early Recordings and B-Sides in August 2004, an album that contained exactly what the title states. The band re-signed with Vagrant in early 2006 and officially welcomed new bassist Manny Carrero into its ranks. Sound the Alarm followed that April, which of course meant tour dates through the rest of the year, including dates on that summer's Warped Tour. Parada made his exit in March 2007 and was replaced soon enough by ex-Classic Case/Glassjaw drummer Durijah Lang. Later that year, Saves the Day released Under the Boards, the second of their three-album concept that began with Sound the Alarm. Before they could finish the trio, Saves the Day would almost completely change their lineup, with Soloway, Lang, and Carrero leaving the band. Conley brought in bassist Rodrigo Palma, guitarist Arun Bali, and drummer Claudio Rivera to bolster the ranks, and went back into the studio in 2009 to begin work on a new album. Saves the Day shopped the completed album around and eventually signed on with Razor &amp; Tie, and in 2011 released their seventh album, Daybreak. With their trilogy complete, the band made the move back to Equal Vision, releasing their eighth album, the self-titled Saves the Day, in the summer of 2013.","torrent":{"xt":"urn:btih:b8620b9a9d2a7143ce8d01e31c4e311cd68105ed","amp;dn":"Saves+the+Day+-+Discography+%281998-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8620b9a9d2a7143ce8d01e31c4e311cd68105ed","infoHashBuffer":{"type":"Buffer","data":[184,98,11,154,157,42,113,67,206,141,1,227,28,78,49,28,214,129,5,237]},"announce":[],"urlList":[]}}