{"title":"Fallout.2.ISO","uid":4266697,"size":635621376,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8a7f6b3621f2cebf373bc5a954fc6cc310c6227&amp;dn=Fallout.2.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xGothicAngelx","files":1,"time":1214728344,"description":"~ GoThIcHaCk.cOm PrEsEnTs ~\n\nName: Fallout2\nType: ISO\nSite: http://www.nma-fallout.com/fallout1/official_site/\nFull Name: &quot;Fallout 2&quot;\nContents: Fallout2.iso\n\nUS ENGLISH\n\n-----\n\nDuring 2241, Arroyo suffered the worst drought on record. Faced with the calamity, the village elders asked the direct descendant of the Vault Dweller, referred to as the Chosen One, to perform the quest of retrieving a Garden of Eden Creation Kit (GECK) for Arroyo. The GECK is a device that can create thriving communities out of the post-apocalyptic wasteland.[4]\n\nThe player, assuming the role of the Chosen One, is given nothing more than the Vault Dweller's jumpsuit, a RobCo PIPBoy 2000 handheld device, a Vault 13 water flask, and some cash to start on his mission.\n\nThe player eventually finds Vault 13 (the first place possible to obtain a GECK) devoid of the majority of its former human inhabitants. The Chosen One returns to find his village captured by the remnants of the United States government known as &quot;The Enclave&quot;. The Enclave often terrorizes the inhabitants of mainland United States with their supreme arsenal of advanced technology. The player, through various means, activates an ancient oil tanker and engages its autopilot, thus allowing him to reach the Enclave's main base on an offshore oil rig.\n\nIt is revealed that the dwellers of Vault 13 were captured as well, to be used as test subjects for FEV (Forced Evolutionary Virus). Vault 13 was supposed to be closed for 200 years as part of a government experiment;[3] this makes them perfect test subjects. The Enclave modified the Forced Evolutionary Virus into an airborne disease, designed to attack any living creatures with mutated DNA. With all genetic impurities removed, the Enclave (who remain protected from radiation) could take over. The player frees both his fellow villagers from Arroyo and the Vault 13 dwellers from Enclave control and subsequently destroys the Enclave's oil rig, killing the Enclave and United States President Richardson as well as a genetically-modified secret service enforcer known as Frank Horrigan on his way. In the end, the inhabitants of Vault 13 and the Arroyo villagers create a new prosperous community with the help of the GECK.\n\n-----\n\nFiles are ISO files, so you need to mount it with Alcohol 120%, or any other software that can burn/mount. http://thepiratebay.se/search/alcohol%20120/0/99/300\n\n\n~ GoThIcHaCk.cOm.cOm DreamHack ~\nFinal farewells; only in fairy tales.\n\n[Comments welcome and encouraged.]","torrent":{"xt":"urn:btih:b8a7f6b3621f2cebf373bc5a954fc6cc310c6227","amp;dn":"Fallout.2.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a7f6b3621f2cebf373bc5a954fc6cc310c6227","infoHashBuffer":{"type":"Buffer","data":[184,167,246,179,98,31,44,235,243,115,188,90,149,79,198,204,49,12,98,39]},"announce":[],"urlList":[]}}