{"title":"Benjamin Grob-Fitzgibbon - Imperial Endgame. Britains Dirty Wars","uid":10382282,"size":5425494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8ff0895a3bb34e4fad8df0231d1131d5caa7fff&amp;dn=Benjamin+Grob-Fitzgibbon+-+Imperial+Endgame.+Britains+Dirty+Wars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403096809,"description":"Description\nProduct Details\nBook Title: Imperial Endgame: Britain's Dirty Wars and the End of Empire (Britain and the World)\t\nBook Author: Benjamin Grob-Fitzgibbon\nSeries: Britain and the World\nPaperback: 392 pages\nPublisher: Palgrave Macmillan (May 15, 2011)\nLanguage: English\nISBN-10: 023024873X\nISBN-13: 978-0230248731\n\n===================================================================================\nBook Description\nRelease date: May 15, 2011 | ISBN-10: 023024873X | ISBN-13: 978-0230248731\nThe story of the British Empire in the twentieth century is one of decline, disarray, and despondency. Or so we have been told. In this fresh and controversial account of Britain's end of empire, Benjamin Grob-Fitzgibbon rejects this consensus, showing instead that in the years 1945-1960 the British government developed a successful imperial strategy based on devolving power to indigenous peoples within the Commonwealth. This strategy was calculated to allow decolonization to occur on British terms rather than those of the indigenous populations, and thus to keep these soon-to-be former colonies within the British and Western spheres of influence during the Cold War. To achieve this new form of informal liberal imperialism, however, the government had to rely upon the use of illiberal dirty wars. Spanning the globe from Palestine to Malaya, Kenya to Cyprus, these dirty wars represented Britain's true imperial endgame.\n\n===================================================================================\nReviews\n&quot;Grob-Fitzgibbon challenges the popular view that Britain shed its empire politely, like a tea party at the vicarage in an Agatha Christie mystery. He makes it clear that the reality was very different. Withdrawal from empire was difficult, dangerous and dirty and the politicians, diplomats, soldiers and policemen who brought empire to an end did so in a way not brought out as powerfully and persuasively before. For anyone worried about how things might end in Iraq or Afghanistan, Grob-Fitzgibbon's excellent, dispassionate, forensic analysis will make uncomfortable but illuminating reading.&quot; - Colonel Alex Alderson, MBE, Director of the United Kingdom Counterinsurgency Centre\n\n&quot;Imperial Endgame is a controversial and important book. Benjamin Grob-Fitzgibbon has no time for conventional pieties. Junking the tired story of disarray and humiliation, he shows how Britain ruthlessly disposed of the Empire on its own unsentimental terms. This strategy often involved dirty tactics and dirty wars but the objective was clear: to keep newly-independent states within Britain's sphere of influence. It's a bold re-telling of the decolonisation story, pulled off with great style and panache.&quot;- Richard Aldous, author of The Lion and the Unicorn, and Eugene Meyer Professor of British History and Literature at Bard College\n\n&quot;The end of the British Empire was characterized not only by relatively smooth transitions to independence but also by the winning of independence by violent means of insurgency. Imperial Endgame is an excellent history of the British counter-insurgency campaigns marking the end of colonial rule, above all in Palestine, Malaya, Kenya, Cyprus, and Aden.&quot; - Wm. Roger Louis, University of Texas at Austin\n\n===================================================================================\nAbout the Author\nBENJAMIN GROB-FITZGIBBON is Assistant Professor of History, Cleveland C. Burton Professor of International Programs, and Associate Director of the International Relations Program at the University of Arkansas, USA. Born in the north of England in 1979, he received his doctorate from Duke University in 2006. His first book, The Irish Experience during the Second World War, was published in 2004. His second book, Turning Points of the Irish Revolution, in 2007. He has previously taught at Duke University and North Carolina State University.\n===================================================================================","torrent":{"xt":"urn:btih:b8ff0895a3bb34e4fad8df0231d1131d5caa7fff","amp;dn":"Benjamin+Grob-Fitzgibbon+-+Imperial+Endgame.+Britains+Dirty+Wars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ff0895a3bb34e4fad8df0231d1131d5caa7fff","infoHashBuffer":{"type":"Buffer","data":[184,255,8,149,163,187,52,228,250,216,223,2,49,209,19,29,92,170,127,255]},"announce":[],"urlList":[]}}