{"title":"Battle Cry (1955) DVD9 - War Drama - Van Heflin, Aldo Ray, Dorot","uid":10513873,"size":7111981056,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b9589c771dc9824e71f122725115974a24bb02dd&amp;dn=Battle+Cry+%281955%29+DVD9+-+War+Drama+-+Van+Heflin%2C+Aldo+Ray%2C+Dorot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"SaM","files":12,"time":1404881060,"description":"Battle Cry (1955) DVD9 - War Drama - Van Heflin, Aldo Ray, Dorothy Malone [DDR]\n\nBattle Cry is a 1955 CinemaScope film, starring Van Heflin, Aldo Ray, James Whitmore, Tab Hunter, Anne Francis, Dorothy Malone, Raymond Massey, and Mona Freeman. The movie is based on the novel by Leon Uris, who also wrote the screenplay, and was produced and directed by Raoul Walsh.\n\n    CAST:-\n    Van Heflin as Major (later, LtCol) Sam &quot;High Pockets&quot; Huxley (CO, 2nd Bn., 6th Marine Regt.)\n    Aldo Ray as PFC Andy Hookens\n    Nancy Olson as Pat Rogers / Mrs. Pat Rogers\n    James Whitmore as MSgt. Mac\n    Tab Hunter as PFC./Cpl. Danny Forrester\n    Anne Francis as Rae, party girl\n    Dorothy Malone as Mrs. Elaine Yarborough, USO Manager\n    Raymond Massey as Maj. Gen. Snipes\n    Mona Freeman as Kathy, Danny's girl / Mrs. Danny Forrester\n    William Campbell as Pvt. 'Ski' Wronski\n    John Lupton as Pvt. / Cpl. Marion 'Sister Mary' Hotchkiss\n    L.Q. Jones as Pvt. L.Q. Jones (as Justus E. McQueen) [2]\n    Perry Lopez as Pvt. Joe Gomez aka Spanish Joe\n    Fess Parker as Pvt. Speedy\n    Willis Bouchey as Mr. Forrester\n    Jonas Applegarth as Pvt. Lighttower (Navajo Phonetalker)\n    Felix Noriego as Pvt. Crazy Horse (Navajo Phonetalker)\n    Rhys Williams as Pat Rogers's father\n\nThe film is a drama set in World War II, following a group of United States Marines from boot camp to combat. It depicts the forming of comradeships and the relentless training which the battalion, led by Major &quot;High Pockets&quot; Huxley, has to undergo. In two battles (Guadalcanal and Tarawa), the battalion is only used in mop-up duties, but after an out-of-line argument between &quot;High Pockets&quot; and the commanding general, they are used as lead battalion in the battle for Saipan, suffering heavy casualties as they land on the exposed left flank of Red Beach. Huxley is killed and as they watch his body being carried off the field his grim-faced men fix bayonets ready to meet a Japanese counter-attack.\n\nBesides describing the battalion's everyday activities, the movie also details the private lives of three of the Marines. On R'n'r in New Zealand, Andy Hookens falls in love with Pat Rogers, the widow of a New Zealand soldier killed at El Alamein. Pat becomes pregnant and they marry. Andy is tempted to desert in order to be with his wife and baby, but Pat persuades him that their lives would be impossible as fugitives and he goes back to his ship. Andy loses a leg on Saipan and speaks bitterly of a useless future, but the Master Sergeant, Mac, convinces him he is wrong and at the end of the movie Andy returns to his wife and child on her family's New Zealand farm. During training, Danny Forrester has an affair with an older woman, Mrs Yarborough, the USO manager. He realises there is no future in the relationship and breaks it off, to Mrs Yarborough's distress. While on furlough he marries his sweetheart Kathy. After being wounded on Saipan he is reunited with his wife.\n\nIn 1942, a group of young men join the Marines, leaving loved ones behind. Primed for battle, they are frustrated by many non-combat assignments, as we follow their wartime romances, especially Andy Hookens' involvement with Pat, a New Zealand widow. Andy and Pat have just decided that war requires them to 'live for the moment' when, in 1944, our team finally goes into a real battle\n\nAwards\nBattle Cry received an Academy Award nomination for Scoring of a Dramatic or Comedy Picture by composer Max Steiner.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 149 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 149 mins","torrent":{"xt":"urn:btih:b9589c771dc9824e71f122725115974a24bb02dd","amp;dn":"Battle+Cry+%281955%29+DVD9+-+War+Drama+-+Van+Heflin%2C+Aldo+Ray%2C+Dorot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9589c771dc9824e71f122725115974a24bb02dd","infoHashBuffer":{"type":"Buffer","data":[185,88,156,119,29,201,130,78,113,241,34,114,81,21,151,74,36,187,2,221]},"announce":[],"urlList":[]}}