{"title":"Boys On Film 12 Confession (2014) DVD RIP","uid":12205259,"size":1068887962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bad391c8c025526186cc6b225afbbd7f5e9ff8b1&amp;dn=Boys+On+Film+12+Confession+%282014%29+DVD+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmanwf","files":11,"time":1438930534,"description":"Boys On Film 12 Confession (2014) DVD RIP\n\n\n\nALL In MP4\n\n\n\nHome From The Gym - dir. Robert Hawk (USA) 6mins 2014\n\nFrom Robert Hawk, who consulted on The Celluloid Closet, Gay Sex In The 70s and Travis Mathews I Want Your Love and Interior. Leather Bar (with James Franco) comes his directorial debut, which places the male form front and centre. An unnamed, sexy man comes home, alone and starts to undress...\n\nShowboy - dir. Samuel Leighton-Dore (Australia) 15mins 2014\n\nA young football player, Julian Maxwell, finds himself struggling to support his unemployed, recently widowed father while fighting to keep safe the secret he once shared with his mother: He's not only gay, but performs a drag act in a local bar.\n\nCruise Patrol - dir. Bobby de Groot &amp; Arjan van Meerten (Netherlands) 8mins 2013\n\nTake a walk on the wild side and explore what happens on a long and dusty road where a routine cruise patrol takes a strange turn and spirals totally out of control.\n\nI Am Syd Stone - dir. Denis Theriault (Canada) 11mins 2014\n\nLights, Camera, Action! When a much-desired Hollywood heartthrob returns back to his home town for a reunion of sorts, he expects to rekindle an old closeted relationship. But soon he learns that things aren t as they seem and secrets always catch up in the end.\n\nDeflated - dir. Dustin Shroff (USA) 6mins 2012\n\nChris has come to the store with his dad to spend his allowance. His heart is set on getting a bouncy ball, but all of the balls in the ball cage are bright pink...except for one deflated green ball. Ultimately Chris must make a choice: is it okay for boys to play with the bright pink balls or will he take home the deflated green one?\n\nAge 17 - dir. Filippo Demarchi (Switzerland) 22mins 2013\n\nMatteo is a 17-year-old boy who has fallen in love with Don Massimo, a young who leads the local marching band in which Matteo plays the drum. Matteo sees in Massimo a person willing to listen to his fears and desires and for the first time in his life, Matteo feels ready to open up to someone...\n\nHuman Warmth - dir. Christophe Predari (Belgium) 11mins 2013\n\nAntoine has a desire. His passion and his love is so overwhelming that he has to stay close to Bruno. He loves his warmth and he needs it. But as with any relationship, soon comes the time of detachment and what will happen if Antoine s body stops responding?\n\nTonight It s Me - dir. Dominic Haxton (USA) 13mins 2014\n\nA hot young hustler finds himself in uncharted waters when he spends the night with a client who is far from the &quot;Johns&quot; he's used to servicing.\n\nGood Morning dir. Stephen Dunn and Peter Knegt (Canada) 10mins 2014\n\nGood Morning comically examines the ideas of sexual identity and age anxiety via the story of a man who on the morning after his 30th birthday party wakes up with both a massive hangover, and a 17-year-old boy sleeping on his couch.\n\n\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/504/dp/B00JGQLHFG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/504/dp/B00JGQLHFG&lt;/a&gt;","torrent":{"xt":"urn:btih:bad391c8c025526186cc6b225afbbd7f5e9ff8b1","amp;dn":"Boys+On+Film+12+Confession+%282014%29+DVD+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bad391c8c025526186cc6b225afbbd7f5e9ff8b1","infoHashBuffer":{"type":"Buffer","data":[186,211,145,200,192,37,82,97,134,204,107,34,90,251,189,127,94,159,248,177]},"announce":[],"urlList":[]}}