{"title":"BBC Later with Jools Holland S48E03 1080i HDTV h264-NX","uid":14548938,"size":2938582504,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bb6ca64d2b50aae48df526d2f531a095df4f48d3&amp;dn=BBC+Later+with+Jools+Holland+S48E03+1080i+HDTV+h264-NX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BasilBrush","files":1,"time":1462624141,"description":"BBC Later with Jools Holland S48E03 1080i HDTV h264-NX\r\n\r\nBroadcast date: 6th May 2016\r\n\r\nJoining Jools on the third show of this current run and making their debut on the show is the British electronic group Underworld, who recently returned with their first studio album in six years entitled Barbara Barbara, We Face a Shining Future. Karl Hyde and Rick Smith perform a couple of tracks from the album along with their classic 1996 anthem Born Slippy.NUXX.\r\n\r\nAlso on the show and making their debut are Denver-based folk pop trio the Lumineers, whose irresistible anthem Ho Hey became one of the tunes of 2012. They now return with their follow up Cleopatra, which recently topped the UK album charts and is the result of three years of non-stop touring, six months of secluded writing in a small house in Denver and two months of recording in the rural isolation of Woodstock. British post-punk band, led by French-born Jehnny Beth, Savages return to the show following their debut back in 2012, with tracks from their recent album Adore Life, the follow-up to their Mercury-nominated debut Silence Yourself.\r\n\r\nMaking his TV debut is London-based producer and singer Rationale, whose rich baritone voice combined with his slick, synth-led soulful songs have been garnering him attention since he started mysteriously posting them online last year. Also, Jools introduces New Zealand singer-songwriter Marlon Williams, whose take on old-school Americana is combined with a striking voice that sometimes brings comparisons to the likes of Jeff Buckley, performing songs from his self-titled debut album.\r\n\r\nAnd a performance by British soul singer and West End star Beverley Knight. For Soulsville, her first album in five years, Beverley travelled to Willie Mitchell's legendary Royal Studios in Memphis to record a selection of original songs and a handful of Memphis classics.\r\n\r\nTechnical Spec\r\nVideo Codec: h264 CABAC   \r\nVideo Bitrate: 5900Kbps\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 50i/MBAFF\r\nAudio Codec: AC3\r\nAudio Bitrate: 384Kbps CBR 48KHz\r\nAudio Channels: 6\r\nRun-Time: 59 mins\r\nNumber Of Parts: 1\r\nPart Size: 2.73 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:bb6ca64d2b50aae48df526d2f531a095df4f48d3","amp;dn":"BBC+Later+with+Jools+Holland+S48E03+1080i+HDTV+h264-NX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb6ca64d2b50aae48df526d2f531a095df4f48d3","infoHashBuffer":{"type":"Buffer","data":[187,108,166,77,43,80,170,228,141,245,38,210,245,49,160,149,223,79,72,211]},"announce":[],"urlList":[]}}