{"title":"Bibble.Pro.5.1.0c+Serials (Murlok)","uid":5633488,"size":75152230,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bb9216add6f4e01a0cdabcda7c01dc704e90625e&amp;dn=Bibble.Pro.5.1.0c%2BSerials+%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1276786613,"description":"Bibble 5 is a fast, flexible photographic workflow application. Bibble 5 is designed to help you optimize your digital photographic images and to help you organize and catalog those images. It allows you to adjust and optimize your images very quickly, and to batch adjust and convert these images to prints, send via email, share on the web or edit or view in other applications.\nBibble 5 provides three major categories of features: Asset Management, Image Editing, and Output Generation. Asset Management is the means to catalog your digital photographic\nassets (called Master Files), view and add metadata to these assets, and search and browse based on that metadata. As your volume of digital photographs grows from hundreds to thousands of images, maintaining a coherent and organized library of those photographs becomes quite critical. Bibble 5 provides all the tools needed to catalog your current photographs, to search and to browse through those catalogs quickly and efficiently.\n\nImage Adjustment &amp; Optimizing is the process of applying color management and correction, exposure adjustment, and other creative image editing tools to your original photographs, enabling you to optimize your photographs in the least amount of time. Bibble 5 offers image adjustment tools that operate on entire images (like exposure compensation or white balance) and also offers Selective Editing to allow you to adjust regions or smaller portions of your images.\n\nOutput Generation will take the previews you see in Bibble and create new image files that you can print, share on the web, and access in other applications. Bibble 5's powerful Batch Conversion system helps automate this process.\n\nMajor Features\n- Advanced Lens Correction\n- Noise Ninja Powered Digital Noise Suppression\n- One-Click Image Correction with Perfectly ClearÃ‚Â®\n- Fully Integrated Browser\n- User Configurable Tools/Views\n- Powerful Batch Processing\n- Raw Optimized Printing\n- User Assignable Hotkey's\n- Flexible Renaming System\n- Photosop Elements Plug in\n- Advanced Settings Copy/Paste\n- Plug-in interface and Black &amp; White / Spot Color Plugin\n- Highlight / Fill-light tool for High Dynamic Range\n- Fastest RAW Conversion\n- Runs on Windows, OS X and Linux!\n- Best-In-Class Detail Enhancement\n- Fully Configurable Workflow\n\nWhat's new:\n\nÃ‚Â· New Click Black / Gray / White tool\nÃ‚Â· This tool is a great way to quickly set curve points based on image content, to neutralize and deepen shadows and set the output white point. This much-requested feature from Bibble Labs' customers further expands the wide array of image adjustments possible in Bibble 5.\n\nÃ‚Â· Powerful 3rd Party Plug-ins\nÃ‚Â· This release also includes the free version of Andrea - a powerful and exciting plugin for Bibble 5 build by Sean Puckett. Rediscover 90 years of traditional photo films and papers in B&amp;W and color! Andrea, the film simulator for Bibble 5, takes your digital camera back to the film era with picture perfect simulations of image-making classics! Andrea is the evolution of AndyPRO, the preeminent film simulator for Bibble 4, and contains all of the simulations from AndyPRO.\n\nÃ‚Â· 2 New Cameras &amp; 13 Newly Calibrated Lenses\nÃ‚Â· Rapid updates for RAW file support for new cameras was a hallmark of Bibble 4, and we're thrilled to be able to return to that trad...\n \n \n  OS: Windows 2000/XP/Vista/7\n\n\n\nTested And Working\n\nEnjoy","torrent":{"xt":"urn:btih:bb9216add6f4e01a0cdabcda7c01dc704e90625e","amp;dn":"Bibble.Pro.5.1.0c%2BSerials+%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb9216add6f4e01a0cdabcda7c01dc704e90625e","infoHashBuffer":{"type":"Buffer","data":[187,146,22,173,214,244,224,26,12,218,188,218,124,1,220,112,78,144,98,94]},"announce":[],"urlList":[]}}