{"title":"The Mammoth Book of Travel in Dangerous Places - John Keay","uid":13205969,"size":2856956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb95b3a9a9cdb9361344146d559b5009e56432a4&amp;dn=The+Mammoth+Book+of+Travel+in+Dangerous+Places+-+John+Keay&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1452594404,"description":"The great explorers were the celebrities of their day - the romance and danger of their daring expeditions captured the public imagination and the world's headlines to an extraordinary degree. Not all of them lived to tell the tale, of course, but those who emerged triumphant from jungle, desert or polar wasteland were hailed as if returning from beyond the grave. Journalists vied for their stories and publishers rushed their first-hand accounts of exciting and dangerous journeys into print for a wide and voracious readership. Acclaimed travel historian John Keay introduces this selection of the best of these first-hand narratives, including those of John Ross and John Franklin, writing about their experiences in the Arctic; Richard Burton's account of his search for the source of the Nile; John Speke on Lake Victoria; David Livingstone and Henry Stanley's adventures in central Africa; Alexander McKenzie's first crossing of America and Meriwether Lewis's encounter with the Shoshonee; Robert Peary and Roald Amundsen's voyages to the poles; and the poignant last words of William Wills in Australia and Robert Scott's In Extremis. Keay includes the experiences of four remarkable twentieth-century explorers: Hiram Bingham on the discovery of Machu Picchu; Wilfred Thesiger on Arabia's Empty Quarter; Edmund Hillary on reaching the summit of Everest; and Harry St John Bridger Philby facing despair and defeat in the Arabian desert","torrent":{"xt":"urn:btih:bb95b3a9a9cdb9361344146d559b5009e56432a4","amp;dn":"The+Mammoth+Book+of+Travel+in+Dangerous+Places+-+John+Keay","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb95b3a9a9cdb9361344146d559b5009e56432a4","infoHashBuffer":{"type":"Buffer","data":[187,149,179,169,169,205,185,54,19,68,20,109,85,155,80,9,229,100,50,164]},"announce":[],"urlList":[]}}