{"title":"Sexually Broken--Casey Calvert upside down skullfucked by 2 cock","uid":9400781,"size":757203071,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bbc6fcfe06ab385d153e3e040f892dc278e3757c&amp;dn=Sexually+Broken--Casey+Calvert+upside+down+skullfucked+by+2+cock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1388070030,"description":"Casey Calvert hung upside down, skullfucked into oblivion by 2 cocks brutal relentless deepthroating | Casey Calvert | Matt Williams\n\nDecember 25, 2013\n\n\nMP4 only.\n \n \nCasey Calvert cute as a button and as real and authentic as they come. She is a lifestyler that thrives on seeing just how far she can push herself. We are going to satisfy that thirst in spades. Even the most hardcore lifesyler will not be forgetting today anytime soon.\n\nBound by a custom made metal and wooden bondage device into an inverted strappado suspension, Casey's throat is deliciously, completely exposed. She might as well be a flank of meat hanging in a butcher's shop. She can go nowhere, and hanging upside down with her mouthhole at perfect cock height, she is going to be throat blasted into another dimension. All the while, a didlo impales her perfectly shaved pussy and a vibrator simulates her throbbing clit. This is a blowjob for the record books.\n\nOne after the other, the cocks step up and own her mouth. The dicks drilling down make her woozy and lightheaded, the fact that she is enduring it upside down doubly so. Even for the sexual superstar that she is, Casey is being pushed to her limits. As the cocks slide down her facepussy, multiple orgasms rip through her suspended body. She can't help how much she relishes giving up control, how much she loves being used and bound for others pleasure.\n\nThere is no pleasure without pain, and we add weighted nipple clamps that pull down heavily. Casey is gasping and moaning, drool pouring helplessly out of her well used mouth. The drool runs down like a faucet, coating the wooden stage in thick puddles. What a messy little pet this one is. The harder we are on her, the more she cums. When we have used her to our fill, we walk away, leaving her swaying gently, clamped, impaled, completely lost and drifting in sexual subspace.  \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_25ccalvert4/SexuallyBroken-Casey-Calvert-Matt-Williams-Casey-Calvert-hung-upside-down-skullfucked-into-oblivion-by-2-cocks-brutal-relentless-deepthroating.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_25ccalvert4/SexuallyBroken-Casey-Calvert-Matt-Williams-Casey-Calvert-hung-upside-down-skullfucked-into-oblivion-by-2-cocks-brutal-relentless-deepthroating.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:bbc6fcfe06ab385d153e3e040f892dc278e3757c","amp;dn":"Sexually+Broken--Casey+Calvert+upside+down+skullfucked+by+2+cock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc6fcfe06ab385d153e3e040f892dc278e3757c","infoHashBuffer":{"type":"Buffer","data":[187,198,252,254,6,171,56,93,21,62,62,4,15,137,45,194,120,227,117,124]},"announce":[],"urlList":[]}}