{"title":"Nationalism, Marxism, and African American Literature Between th","uid":8758225,"size":8858868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc1aaecada5fbb1ab1e184ffbcf89895ec364d51&amp;dn=Nationalism%2C+Marxism%2C+and+African+American+Literature+Between+th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375145132,"description":"\nPublication Date: November 15, 2002 | filetype: pdf\n\nDuring and after the Harlem Renaissance, two intellectual forces --nationalism and Marxism--clashed and changed the future of African American writing. Current literary thinking says that writers with nationalist leanings wrote the most relevant fiction, poetry, and prose of the day.\n\nNationalism, Marxism, and African American Literature Between the Wars: A New Pandora's Box challenges that notion. It boldly proposes that such writers as A. Philip Randolph, Langston Hughes, and Richard Wright, who often saw the world in terms of class struggle, did more to advance the anti-racist politics of African American letters than writers such as Countee Cullen, Jessie Redmon Fauset, Alain Locke, and Marcus Garvey, who remained enmeshed in nationalist and racialist discourse.\n\nEvaluating the great impact of Marxism and nationalism on black authors from the Harlem Renaissance and the Depression era, Anthony Dawahare argues that the spread of nationalist ideologies and movements between the world wars did guide legitimate political desires of black writers for a world without racism. But the nationalist channels of political and cultural resistance did not address the capitalist foundation of modern racial discrimination.\n\nDuring the period known as the &quot;Red Decade&quot; (1929-1941), black writers developed some of the sharpest critiques of the capitalist world and thus anticipated contemporary scholarship on the intellectual and political hazards of nationalism for the working class.\n\nAs it examines the progression of the Great Depression, the book focuses on the shift of black writers to the Communist Left, including analyses of the Communists' position on the &quot;Negro Question,&quot; the radical poetry of Langston Hughes, and the writings of Richard Wright.\n\n\nFile Size: 1757 KB\nPrint Length: 208 pages\nPublisher: University Press of Mississippi (November 15, 2002)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B001M5U1D8\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Nationalism-Marxism-American-Literature-ebook/dp/B001M5U1D8/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Nationalism-Marxism-American-Literature-ebook/dp/B001M5U1D8/&lt;/a&gt;\n\n\n\nTags: nation, nationalist, marx, marxism, marxist, das kapital, africa, african, america, american, african american, black, literature, ww2, cold war, ghana, Nkrumah, Garvey, A. Philip Randolph, Langston Hughes, Richard Wright,Harlem, capital, communism, capitalism, left, right, politics, pan-african, ","torrent":{"xt":"urn:btih:bc1aaecada5fbb1ab1e184ffbcf89895ec364d51","amp;dn":"Nationalism%2C+Marxism%2C+and+African+American+Literature+Between+th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1aaecada5fbb1ab1e184ffbcf89895ec364d51","infoHashBuffer":{"type":"Buffer","data":[188,26,174,202,218,95,187,26,177,225,132,255,188,248,152,149,236,54,77,81]},"announce":[],"urlList":[]}}