{"title":"Raising.Hope.S03E13.HDTV.x264-LOL","uid":8053966,"size":182449427,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bc1b114710d63f07403be9856ac1e8795e0b1c7a&amp;dn=Raising.Hope.S03E13.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1358916254,"description":"Raising Hope\n\nGenre: Comedy, Family\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: Gregory Thomas Garcia\nCast: Kelly Heyer, Cloris Leachman, Lucas Neff, Martha Plimpton, Garret Dillahunt\n\nIMDB: http://www.imdb.com/title/tt1615919/\n\n.: Plot :.\n&quot;RAISING HOPE&quot; is a new single-camera family comedy from Emmy Award winner Greg Garcia (&quot;My Name Is Earl&quot; ) that follows the Chance family as they find themselves adding an unexpected new member into their already terribly flawed household. At 23 years old, JIMMY CHANCE (Lucas Neff, &quot;The Beast&quot; ) is going nowhere in life. He skims pools for a living, parties every night and still lives at home with his family, including his MAW MAW (guest star Academy Award and Emmy Award winner Cloris Leachman); his mother, VIRGINIA (Martha Plimpton, &quot;How to Make It in America&quot; ); his father, BURT (Garret Dillahunt, &quot;Terminator: The Sarah Connor Chronicles,&quot; &quot;Damages&quot; ); and his cousin, MIKE (Skyler Stone, &quot;The Mentalist,&quot; &quot;Dollhouse&quot; ). Jimmy's life takes a drastic turn when a chance romantic encounter with LUCY (guest star Bijou Phillips, &quot;Choke,&quot; &quot;Almost Famous&quot; ) goes awry once he discovers she is a wanted felon. Months later, when Jimmy pays a visit to the local prison, he discovers Lucy gave birth to their baby, who he is now charged with raising. At home with his new daughter, Jimmy's family is less than enthusiastic about a new addition to the household. His parents, who had him when they were 15, never knew anything about raising a child and have no interest in trying again. If Jimmy can work up the nerve to ask her out on a date, he might get some help from SABRINA (Shannon Woodward, &quot;The Riches,&quot; &quot;ER&quot; ), a sardonic checkout clerk he met at the supermarket. Cousin Mike is only concerned about how the baby is going to affect their social life, and out-of-touch Maw Maw is no help either. But Jimmy is determined to take care of his baby - whom Virginia thinks they should name HOPE. With very few useful skills but their hearts in the right place, will the Chance family be successful when they step into the unpredictable and immensely challenging world of parenting?\n","torrent":{"xt":"urn:btih:bc1b114710d63f07403be9856ac1e8795e0b1c7a","amp;dn":"Raising.Hope.S03E13.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1b114710d63f07403be9856ac1e8795e0b1c7a","infoHashBuffer":{"type":"Buffer","data":[188,27,17,71,16,214,63,7,64,59,233,133,106,193,232,121,94,11,28,122]},"announce":[],"urlList":[]}}