{"title":"The Unwinding Hours - The Unwinding Hours [2010][EAC,log,cue. FL","uid":8663245,"size":249042109,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcbe31b78a4a2d507b8ae0b79f3783a34f5e611e&amp;dn=The+Unwinding+Hours+-+The+Unwinding+Hours+%5B2010%5D%5BEAC%2Clog%2Ccue.+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":11,"time":1373353532,"description":"Artist:The Unwinding Hours\nRelease:The Unwinding Hours\nReleased: 2010\nLabel: Chemikal Underground \nCatalog#: CHEM132CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: scotland\nStyle:rock\n\n01 knut 05:56\n02 tightrope 03:21\n03 little one 04:16\n04 there are worse things than being alone 05:02\n05 solstice 02:56\n06 peaceful liquid shell 05:03\n07 child 04:46\n08 traces 03:56\n09 annie jane 04:51\n10 the final hour 05:22\n\nThe self-titled debut release by former Aereogramme members Craig B. and Iain Cook, The Unwinding Hours is that sometimes all-too-rare release, a fresh start from a previous band that might well top the earlier work altogether. In ways, the duo is almost a classic Chemikal Underground band given the songs on offer -- there's everything from tender, sweetly sung indie rock rambles to massive building arcs of feedback and contemplation, and the ghosts of not only Aerogramme but past labelmates like the Delgados and (going back further) Mogwai hang a bit heavy at points. But for all the familiar elements, there's a sense of free-spirited release on songs like &quot;Tightrope,&quot; with a dramatic string break that actually works where so many similar examples are mere scene-setting atmospherics, and the lovely &quot;Peaceful Liquid Shell,&quot; which uses the loud-soft-loud trope as element rather than as raison d'etre for the whole song. By never losing the steady, gentle rhythm underpinning it, the performance feels stronger as a result, making it the possible standout for the whole album. &quot;Child&quot; shows that they can also create something carefully unsettling, with the low bass growls at the start defining a feeling of distanced unease that never quite leaves, while the combination of punishing, steady guitar bursts and calm singing on &quot;The Final Hour&quot; concludes the album on a spectacular note. Meanwhile, at the album's most fragile with &quot;There Are Worse Things Than Being Alone&quot; the Unwinding Hours make a compelling case for the qualities of a hushed ballad from an indie rock band as being more than a punch line for Shins haters -- and when the waves of near-MBV-level echoed guitar slowly surge forward toward the end to drown the singing, the effect is gently breathtaking.","torrent":{"xt":"urn:btih:bcbe31b78a4a2d507b8ae0b79f3783a34f5e611e","amp;dn":"The+Unwinding+Hours+-+The+Unwinding+Hours+%5B2010%5D%5BEAC%2Clog%2Ccue.+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcbe31b78a4a2d507b8ae0b79f3783a34f5e611e","infoHashBuffer":{"type":"Buffer","data":[188,190,49,183,138,74,45,80,123,138,224,183,159,55,131,163,79,94,97,30]},"announce":[],"urlList":[]}}