{"title":"Baise-moi Partout (1978) [480p].wmv","uid":7064010,"size":803142116,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bd23b9b963c449425bdaa76ee408608bd85290c2&amp;dn=Baise-moi+Partout+%281978%29+%5B480p%5D.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplashPt","files":1,"time":1330447396,"description":"\nBaise-moi Partout (1978) [480p].wmv\n\n\nCast:\n\nDiane Dubois, Karine Gambier, Cathy Stewart, Marie-Claude Viollet, Dominique Saint Claire, Dominique Irissou, Guy Royer, Jean-GÃƒÂ©rard Sorlin\n\n\nDescription:\n\nUpper-class Madame Vinclair (Karine Gambier) has sex with a teacher she obviously knows although despising him for being working class. She starts the scene talking about his sticking up political posters and compares him to Georges Marchais (leader of the French Communist Party at the time) and FranÃƒÂ§ois Mitterand (then leader of the Socialist Party, but not yet President - that will come three years later). Throughout the scene Madame Vinclair alludes to his proletarian prick and asks him what it's like to fuck a bourgeoise.\nMeanwhile, Dominique, the housekeeper (Cathy Stewart), has it off with her boyfriend, Nicolas (Madame Vinclair's woodcutter), in the kitchen. Contrary to most of Stewart's scenes where she looks quite distant, this time she really looks as if she is enjoying it. All through the scene Stewart keeps on with her girlish talk about their future holidays in Morocco. Her best scene as far as I know - with the one coming up in two or three minutes!\nOnce her good time with Guy Royer is over, Madame calls her woodcutter and watches him putting wood in the hearth while fantasizing about him. Royer leaves the place and Stewart runs after him, threatening to tell her boss, Monsieur Vinclair, about his wife and the teacher. She will not say a word if he agrees to let her compare his prick with Nicolas's. Reluctant at first, the teacher gives in and they are in for a roll in the hay: just another superb scene. Awesome Stewart with Guy Royer and her lover who joins them for a threesome.\nNicolas and Dominique (though she is reluctant at first) have another go at it in the kitchen and are soon joined by Madame who, once the scene is over, announces a party for the following day featuring Patricia and her sister, a journalist and her girlfriend Marie-Pierre.\nDiane Dubois has a little talk with Dominique Saint-Claire about watching Emmanuelle 2 and her liking for erotic films before the discussion turns into a lesbian scene first, which turns into a threesome when Guy Royer joins in.\nWe now see a hunting party coming home. Dominique Saint-Claire and Guy Royer are part of it and yet, a few seconds later we see them together in the house having a talk against hunting and welcoming the rest of the party back. The group (notice Karine Gambier's absence - not an accident as it is mentioned by Monsieur Vinclair) plays some sort of game of truth. Monsieur Vinclair is accused of having an affair with Diane Dubois. He has some acid words with Dominique Saint-Claire about bourgeoisie and after a parody of a communist trial in the old USSR, he is sentenced to lovemaking in front of the audience...\nIn fact the next scene features Diane Dubois having a lick at each participant except the woodsman - notice Karine Gambier back on the right of the screen but keeping away from the action. Then we are treated with mostly a lesbian scene, joined at the end by Guy Royer. In parallel, Dominique Saint-Claire makes it with Monsieur Vinclair.\n\n\nTags: Hardcore, Orgy, XxX, Fuck\n\nResolution:   640x480 \n\nDuration:     01:19:01\n\t\nSize:\t      765 MB\n\nScreens:\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/1455_0.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/1455_0.jpg.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/1454_00.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/1454_00.jpg.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/1453_01.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/1453_01.jpg.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bd23b9b963c449425bdaa76ee408608bd85290c2","amp;dn":"Baise-moi+Partout+%281978%29+%5B480p%5D.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd23b9b963c449425bdaa76ee408608bd85290c2","infoHashBuffer":{"type":"Buffer","data":[189,35,185,185,99,196,73,66,91,218,167,110,228,8,96,139,216,82,144,194]},"announce":[],"urlList":[]}}