{"title":"[Jazz] Johnny Griffin - Birds &amp; Ballads (1978)  Japan","uid":3555538,"size":66539635,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c05624abe1961db3cb53a1216e616b22a2ecdffa&amp;dn=%5BJazz%5D+Johnny+Griffin+-+Birds+%26+Ballads+%281978%29++Japan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xenu dot net","files":9,"time":1163264284,"description":"Another rare release. Please share the CDs which are most difficult to find in stores.\n\n\n\nArtists: Art Pepper, John Klemmer, Johnny Griffin, Joe Farrell, Joe Henderson. Harold Land with Rhythm Section Of Stanley Conwell , Roy Haynes, Cecil McBee, John Heard\nTitle: \tBirds &amp; Ballads (1978)\nStyle: \tJazz\npress: \tJAPAN\n\nTrack listing:\n\n\tBillie&amp;#039;s Bounce\n\t&amp;#039;Round Midnight\n\tConfirmation\n\tYardbird Suite\n\tBloomdido\n\tOver The Rainbow\n\tSmoke Gets In Your Eyes\n\tGood Morning, Heartache\n\n\n&quot;I like to play fast. I get excited, and I have to sort of control myself, restrain myself. But when the rhythm section gets cooking, I want to explode.&quot;--Johnny Griffin\n\nUnquestionably Johnny Griffin can play the tenor saxophone faster, literally, than anyone else alive. At least he can claim this until it&amp;#039;s demonstrated otherwise. And in the course of playing with this incredible speed, he also manages to blow longer without refueling than you would ordinarily consider possible. With this equipment he is able to play almost all there could possibly be played in any give chorus.&quot;\n\nAs far as it goes Gleason&amp;#039;s words are probably correct. (In the absence of a jazz section to the Guiness Book of Records we must assume Griffin&amp;#039;s leading position in the field of runners in the Semi-Quaver Race.) But it would be wrong to assume that John Arnold Griffin III was nothing more than a note-producing machine fitted with a control graduated from &quot;Finished With Engines&quot; up to &quot;Full Speed Ahead.&quot;\n\nHe is an amazingly consistent soloist, a man who is never off form by all accounts; undeniably he likes fast tempos but is a complete, rounded jazz musician, capable of tackling any material with the aid (or something otherwise!) of any rhythm section. Since he came to Europe in 1962, at the age of 34, he has been giving free lessons on the gentle arts of relaxation, saxophone technique, deep-seated emotional intensity and a host of other important elements to thousands of listeners in Paris, London, Copenhagen and any other centers where jazz is appreciated.\n\nWhen John left the United States he seemed already to have achieved more than many jazzmen achieve in a lifetime. He was 16 when he joined Lionel Hampton&amp;#039;s band as an alto saxophonist. At least Griffin thought he had been booked to play alto in the reed section. On his first date with the band he took out the smaller horn only to be asked the whereabouts of his tenor. He dashed back home to Chicago at the earliest opportunity laid hands on a tenor and rejoined Hamp&amp;#039;s reed section which contained such stalwarts as Arnett Cobb, Bobby Plater and Charlie Fowlkes.\n\nWhen Joe Morris, one of Hamp&amp;#039;s trumpeters, left to form his own band in 1947 John went with him and stayed with Morris for three years. Morris&amp;#039;s lively little rhythm-and-blues band had a rhythm section comprising Elmo Hope, Percy Heath and Philly Joe Jones for a time. He spoke of the Joe Morris band with pride, listed the names of the men who had passed through its ranks and gave me the news that Morris had died a few years earlier.\n\nApart from a handful of relatively short engagements with other bands (Arnett Cobb&amp;#039;s unit in 1951, Art Blakey&amp;#039;s Jazz Messengers from March to October 1975 and the Thelonious Monk Quartet during the summer of 1958) Griffin has been a solo artist or band leader since leaving the Joe Morris band. When I spoke to him during one of his bookings at the Ronnie Scott Club during the late &amp;#039;60s he seemed content to be touring the European jazz centers, secure in the knowledge that he would find a suitable rhythm section for his engagements. \n\n\n\nEncoded with lame 3.97 -V4 --vbr-new (~170 kbit/s) and should be close to perceptual transparency.\n\n\nKids, always remember Xenu is your friend.\n\nwww.xenu.net\n\n \n","torrent":{"xt":"urn:btih:c05624abe1961db3cb53a1216e616b22a2ecdffa","amp;dn":"%5BJazz%5D+Johnny+Griffin+-+Birds+%26+Ballads+%281978%29++Japan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05624abe1961db3cb53a1216e616b22a2ecdffa","infoHashBuffer":{"type":"Buffer","data":[192,86,36,171,225,150,29,179,203,83,161,33,110,97,107,34,162,236,223,250]},"announce":[],"urlList":[]}}