{"title":"The.Captains.Close.Up.2013.DVDRip.x264.AC3-HQ-Pegatoni","uid":9442000,"size":2489469130,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c10f23eb835a9f8c6c67163b2db38b28254c9e41&amp;dn=The.Captains.Close.Up.2013.DVDRip.x264.AC3-HQ-Pegatoni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":9,"uploader":"Pegasus3245","files":-1,"time":1389027320,"description":"Actor William Shatner revisits his fellow Enterprise commanders in The Captains Close Up, an engaging five-part follow-up to The Captains. Culled in part from unaired footage from that 2011 documentary, The Captains Close Up comprises half-hour conversations with Shatner, Patrick Stewart, Kate Mulgrew, Avery Brooks, and Scott Bakula interspersed with comments by many of their Trek collaborators, including Christopher Plummer, Ronald D. Moore (Battlestar Galactica), Jonathan Frakes, Walter Koenig, and numerous others. The &quot;new&quot; Enterprise captain, Chris Pine, is also featured on the box cover art, but it's a bit misleading: his presence is limited to a brief Q&amp;A at the end of the episode devoted to Shatner. The interviews are friendly and informative in regard to each actor's career, and Shatner does a capable job of drawing out some personal observations on the performing life from his subjects, most notably Patrick Stewart, who is remarkably open about his difficult childhood and his two failed marriages, and Kate Mulgrew, who expresses her reservation about certain career choices. Even Shatner lets down his guard during his own segment and discusses the death of his third wife, Nerine Kidd, and his own concerns about his association with Star Trek. However, hardcore Trek fans seeking purely franchise-related observations from the captains may find the interviews somewhat lacking: only Brooks's and Mulgrew's interviews devote a substantial amount of their running time to the actors' respective series. But The Captains Close Up still works as supplemental material to the vast array of Trek-related media, and as a document of Shatner's seemingly relentless career drive in his eighth decade. The actor is also front and center on the disc's two minute-plus extras, which are devoted to his recollections of a 1983 fire at Paramount that nearly consumed the Star Trek III set and the 1967 merger of Trek's production company, Desilu, with Paramount, which resulted in the formation of Paramount Television.","torrent":{"xt":"urn:btih:c10f23eb835a9f8c6c67163b2db38b28254c9e41","amp;dn":"The.Captains.Close.Up.2013.DVDRip.x264.AC3-HQ-Pegatoni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c10f23eb835a9f8c6c67163b2db38b28254c9e41","infoHashBuffer":{"type":"Buffer","data":[193,15,35,235,131,90,159,140,108,103,22,59,45,179,139,40,37,76,158,65]},"announce":[],"urlList":[]}}