{"title":"Sons of Liberty - Guerrilla Warfare Training","uid":4151504,"size":91612612,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c16907b98a596a6f029eeb4bb4aea12d54100d12&amp;dn=Sons+of+Liberty+-+Guerrilla+Warfare+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ForceMultiplication","files":1,"time":1208971156,"description":"********UPDATED VERSION*******\n\nPreface -- Our country has been raped of it&amp;#039;s Constitution and Bill of Rights. America is quickly moving toward a police state and total panopticon where technology will create a perfect prison and the fate of Liberty will be sealed forever. Traitors with no loyalty to country or countrymen fill public office while complicit cowards in the media help to puppeteer the minds of Americans. Thousands have died in a war for Israel while tens of thousands return home injured and disfigured. Who among us has the honor, courage and commitment to stand up?\n\nChapter 1: Gather Information -- If one wishes to conduct war, one must study war. Various places to begin are presented.\nChapter 2: Forming an Assault Team -- Do you need a compound with dozens of men or can you be effective with one loyal friend?\nChapter 3: Soldiering, Soldier Psychology &amp; Military Bearing -- What will separate the men from the boys and make a civilian militiaman effective against regulars is is discipline, honor, courage and commitment.\nChapter 4: Training Environment -- The living room is a perfect training environment.\nChapter 5: Supplies -- Home base will need a healthy cache of food, water and ammunition.\nChapter 6: Equipment Checklist -- Everything a serious American guerrilla fighter needs to conduct combat and survive in a wilderness environment, and then some.\nChapter 7: Resources -- Places to acquire the goods that were outlined and additional sources of information and training.\nChapter 8: Operations &amp; Counter Operations -- The hypothetical basics of American guerrilla warfare and what to expect from the enemy.\n\nPlease spread this video far and wide. Copy it, download it, host it, burn it, pass it along.\n\nLiberty or Death,\nSons of Liberty","torrent":{"xt":"urn:btih:c16907b98a596a6f029eeb4bb4aea12d54100d12","amp;dn":"Sons+of+Liberty+-+Guerrilla+Warfare+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c16907b98a596a6f029eeb4bb4aea12d54100d12","infoHashBuffer":{"type":"Buffer","data":[193,105,7,185,138,89,106,111,2,158,235,75,180,174,161,45,84,16,13,18]},"announce":[],"urlList":[]}}