{"title":"Skyrim Wasteland Overhaul (needs Skyrim, re-texture overhaul)","uid":10359501,"size":439439855,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1866229d6f343c76d9bf849f2a742460497e7c8&amp;dn=Skyrim+Wasteland+Overhaul+%28needs+Skyrim%2C+re-texture+overhaul%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Vendayn","files":1,"time":1402781018,"description":"Can be seen here also (and for screenshots): http://www.moddb.com/mods/vendayn\n\nand the ENB is here: http://thepiratebay.se/torrent/10358153/Vendayns_Wasteland_ENB_for_Skyrim_Wasteland_Overhaul\n\nI have changed land textures (not all may be apparent). I have changed a lot of the trees/foliage (but not all). And of course the ENB adds a lot to the effect. I also made personal changes to the night sky.\n\nReally, a lot of this is lighting changes and texture changes for now. However, it makes such a huge change...makes it almost horror like. It feels really creepy going through Skyrim now. Especially with the above weather code always on.\n\nWith that said...I want this to be more than just a texture overhaul with a custom ENB. So, later...at some point in time...because I like to play Skyrim and my life is rather busy right now so my modding is a bit random. I will be adding different effects from Dragonborn, adding ruins in various places to give it that wasteland look and make a huge city of ruins with nasty stuff in it and a big reward. No quests though...I suck at that. And I prefer voice acted quests, and I am not able to spend that much time with that.\n\nBut, my goal is to add a lot of destruction to the world...in part, to show the war of imperials vs stormcloaks vs thalmor has taken a huge hit to the land. That, and the effects of Morrowind itself going into Skyrim. I will however not be changing any cities (I like them how they are, but I use open cities mod)...I may change/add to towns though.\n\nAnd I am going to try and keep it as close to Elder Scrolls as I can...but I am sure it will be similar to Fallout in ways :P\n\nAnyway, with all that said...don't think anything else to add. Hope you all enjoy. :) ","torrent":{"xt":"urn:btih:c1866229d6f343c76d9bf849f2a742460497e7c8","amp;dn":"Skyrim+Wasteland+Overhaul+%28needs+Skyrim%2C+re-texture+overhaul%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1866229d6f343c76d9bf849f2a742460497e7c8","infoHashBuffer":{"type":"Buffer","data":[193,134,98,41,214,243,67,199,109,155,248,73,242,167,66,70,4,151,231,200]},"announce":[],"urlList":[]}}