{"title":"Nutrition Standards for Foods in Schools Leading the Way Toward","uid":6470350,"size":1354619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1dc2f4d6b4d2b981822d568e450a42a7b4f7cd2&amp;dn=Nutrition+Standards+for+Foods+in+Schools+Leading+the+Way+Toward+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lionzbay","files":1,"time":1308122439,"description":"\nAuthor(s):Committee on Nutrition Standards for Foods in Schools\nPublisher:National Academies Press\nDate: 2007-08-15\nFormat:pdf\nLanguage:English\nISBN10:0309103835\nPages:296\nISBN13:9780309103831\n\nProduct Description: Food choices and eating habits are learned from many sources. The school environment plays a significant role in teaching and modeling health behaviors. For some children, foods consumed at school can provide a major portion of their daily nutrient intake. Foods and beverages consumed at school can come from two major sources: federally funded programs that include the National School Lunch Program (NSLP), the School Breakfast Program (SBP), and after-school snacks and; competitive sources that include vending machines, 'a la carte' sales in the school cafeteria, or school stores and snack bars. Foods and beverages sold at school outside of the federally reimbursable school nutrition programs are referred to as &quot;competitive foods&quot; because they compete with the traditional school lunch as a nutrition source. There are important concerns about the contribution of nutrients and total calories from competitive foods to the daily diets of school-age children and adolescents.&quot; Nutrition Standards for Foods in Schools&quot; offers both reviews and recommendations about appropriate nutrition standards and guidance for the sale, content, and consumption of foods and beverages at school, with attention given to foods and beverages offered in competition with federally reimbursable meals and snacks. It is sure to be an invaluable resource to parents, federal and state government agencies, educators and schools, health care professionals, food manufacturers, industry trade groups, media, and those involved in consumer advocacy.","torrent":{"xt":"urn:btih:c1dc2f4d6b4d2b981822d568e450a42a7b4f7cd2","amp;dn":"Nutrition+Standards+for+Foods+in+Schools+Leading+the+Way+Toward+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1dc2f4d6b4d2b981822d568e450a42a7b4f7cd2","infoHashBuffer":{"type":"Buffer","data":[193,220,47,77,107,77,43,152,24,34,213,104,228,80,164,42,123,79,124,210]},"announce":[],"urlList":[]}}