{"title":"jurgen_habermas","uid":3388362,"size":1123258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c272b864ca9a58edc85c15e197a2cca7c4b818a1&amp;dn=jurgen_habermas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"switchblade424","files":5,"time":1127753430,"description":"[vidensdeling.nu].jurgen_habermas.torrent\n\nhabermas - idea of the theory of knowledge as social theory.htm\nHabermas discourse net Toward a Critical Theory of Cyberspace.pdf\nHabermas The Erosion of our Value Spheres  The ways in which society copes with scientific, moral and ethical.txt\nHabermas, J&amp;Atilde;&amp;frac14;rgen - Knowledge and Human Interests - ch3 - The.doc\nHabermas's Idea of the Theory of Knowledge as Social Theory.htm\n\n---------------------------\n\nLSC is a new re-releasegroup. Our goal is to re-release/re-seed .torrents which has died in the enormous informationflow on the internet.\nWe will never claim to have done any new releases, because that is not our goal.\n\nWe will work for emancipating knowledge for everyone, so that students and information-loving people will have full access to texts, ebooks and written knowledge in general, therefore we feel that it is necessary that somebody constantly re-seeds relevant material. Our primary target is danish students, which is why we have chosen to pre-fix all of our re-releases with &quot;vidensdeling&quot;.\nVidensdeling.nu is a new danish site which tries to politicise the practise of students sharing knowledge, information and e-books by digital means. \nWe encourage all danish users to support the project.\n\n\nWe will however will point out that we have *nothing* to do with Piratgruppen or Vidensdeling.nu, except for the common goal of keeping information free and available for everyone to share.\n\nHowToUseBitTorrent (in danish): http://www.piratgruppen.org/piratviden/article.php3?id_article=11\n\n\n\n** CREDITS: **\n** - Everybody that scans&amp;shares their books: for using bandwidth and time for other peoples pleasure **\n** - Piratgruppen: for making Vidensdeling.nu **\n** - The danish publishers organization: for beeing so reasonable **\n** - The danish AntiPiracyGroup: for beeing such fucking wankers **","torrent":{"xt":"urn:btih:c272b864ca9a58edc85c15e197a2cca7c4b818a1","amp;dn":"jurgen_habermas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c272b864ca9a58edc85c15e197a2cca7c4b818a1","infoHashBuffer":{"type":"Buffer","data":[194,114,184,100,202,154,88,237,200,92,21,225,151,162,204,167,196,184,24,161]},"announce":[],"urlList":[]}}