{"title":"Stalingrad 1942","uid":11693513,"size":14195556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3265a7ecd70f3569b27b7b74d823f06a870f5bd&amp;dn=Stalingrad+1942&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1423621049,"description":"Stalingrad has become a by-word for grim endurance and tenacity; for the refusal to give up, no matter the cost. In this book, Peter Antill takes a dispassionate look at one of the most talked about battles in history. He asks why the Germans allowed themselves to be diverted from their main objective, which was to capture the oil fields of the Caucasus, and concentrate such large resources on a secondary target. He discusses the merits of the commanders on both sides and also the relationship on the German side with Hitler as well as reviewing the ways in which the command structures influenced the battle. Apart from the overall question of German objectives, this book also unpicks the detail of unit directions, priorities and deployments, leading to a vivid account of the day-by-day war of attrition that took place in Stalingrad during World War II (1939-1945), between September 14, 1942 and February 2, 1943. Stalingrad was more than a turning point, it was the anvil on which the back of German military ambitions in the east were broken and the echoes of its death knell were heard in Berlin and indeed the world over","torrent":{"xt":"urn:btih:c3265a7ecd70f3569b27b7b74d823f06a870f5bd","amp;dn":"Stalingrad+1942","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3265a7ecd70f3569b27b7b74d823f06a870f5bd","infoHashBuffer":{"type":"Buffer","data":[195,38,90,126,205,112,243,86,155,39,183,183,77,130,63,6,168,112,245,189]},"announce":[],"urlList":[]}}