{"title":"Blessed End - Movin' On (1971) [1998]","uid":10408141,"size":300425652,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c3fed07965fa810dbb4aaffc306e3d280d8f4e60&amp;dn=Blessed+End+-+Movin%27+On+%281971%29+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ArkieOkie","files":-1,"time":1403490707,"description":"eac secure cue log scans\n\nBlessed End - Movin' On [1971]\n1998 - Gear Fab / GF-112 / CD\n\nHailing from the Philadelphia area, Blessed End was a five-piece rock band with a sound often compared to that of the Doors. The band was conceived in 1968 by Ken Carson (bass) and Jim Shugarts (guitar) when the two were high school sophomores and having neither owned or played a guitar, they each bought their first instruments that summer and practiced constantly at each other's houses. In 1969, Carson's neighbor Lenny Perchowski (guitar) joined the two, followed by schoolmate Mike Petrylak (drums) and Doug Teti (vocals), who they met, in characteristic garage-band fashion, in a bowling league. They began playing at dances and parties after a few months of practice, and could be found playing a regular gig most Fridays at the coffeehouse at the United Methodist Church in Drexel Hill, which would become the center of the band's social life as well as the place where they honed their skills and sound. Perchowski left the band in 1970 to attend medical school, and the band chose to replace him with a keyboardist instead of another guitarist, so Steve Quinzi came on board. Quinzi and Shugarts developed a songwriting partnership and took their ten best songs into the studio to record Movin' On in the summer of 1971. Recorded entirely in one day, including several songs recorded completely live, the album indeed bore a distinct Doors influence. The album was only pressed in a run of a thousand and was quite strong, if not earth-shatteringly original, yet Blessed End chose not to pursue a recording contract, perhaps as a result of their youthful naivete. Carson left the band to join the navy a few months later, essentially ending the band, though the remaining members soldiered on with various replacements for the next couple years. By the end of 1973, the band was finished. Shugarts, Petrylak, and Carson later played together as Free Bear and Argus.\n\nKEN CARSON - bass\nMIKE PETRYLAK - drums\nSTEVE QUINZI - keyboards\nJIM SHUGARTS - guitar\nDOUG TETI - vocals\n\nTracks:\n01. Nighttime Rider (3:09)\n02. Someplace to Hide (3:30)\n03. Is It Time (4:22)\n04. Sometime You've Got to Be Strong (3:51)\n05. Movin' On (7:45)\n06. Day Before Tomorrow (4:15)\n07. Dead Man (2:36)\n08. Can't Be Without Her (4:05)\n09. One Stop Woman (3:07)\n10. Escape Train (5:51)\n11. Can't Be Without Her (4:31)","torrent":{"xt":"urn:btih:c3fed07965fa810dbb4aaffc306e3d280d8f4e60","amp;dn":"Blessed+End+-+Movin%27+On+%281971%29+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3fed07965fa810dbb4aaffc306e3d280d8f4e60","infoHashBuffer":{"type":"Buffer","data":[195,254,208,121,101,250,129,13,187,74,175,252,48,110,61,40,13,143,78,96]},"announce":[],"urlList":[]}}