{"title":"TSPussyhunters--TPH-32877 TS Foxxy, Jesssica Fox, Simone Sonay a","uid":8914635,"size":545965586,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c44526865a873e99970ac365eb2b368e3412a5bc&amp;dn=TSPussyhunters--TPH-32877+TS+Foxxy%2C+Jesssica+Fox%2C+Simone+Sonay+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1379111084,"description":"Jessica Fox and TS Foxxy Double Team MILF sensation, Simone Sonay\n\nSep 13, 2013 - Performers: Jesssica Fox ,  TS Foxxy ,  Simone Sonay  and  Jay Taylor \n\n \nWMV only. MP4 + Pics later.\n  \n\nJay and her Mother-in-Law, Simone are visiting San Francisco from the Mid-West. The trip is going like most family vacations with in-laws goes: awkward, painfully embarrassing and sometimes down right blood pressure raising. Jay is trying her best to stay calm but Simone is driving her very last nerve into the ground. \n The final straw comes when Simone gets in to an argument with a bartender in a dive bar. \n\nIt's almost a relief for Jay when the nice manager lady takes Simone away to discuss the problem she is having with her staff. That feeling, however, doesn't last long. The bartender grabs Jay and handcuffs her the storage room. Things have now gone from boring, to exciting to down right scary. \n\nMeanwhile Simone faces a whole other set of problems as she is handcuffed in the bar office and Jessica and Foxxy are taking their clothes off. Simone's squirming and cussing vaguely mask her curiosity with the bulge in each of her perpetrators panties. When Jessica and Foxxy unleash their cocks Simone barely resists, instead she lets the ladies take over and dominate her. A cock in all her holes and two cum loads in her mouth that give a new meaning to kiss and make-up. \n\nDouble penetration, cock sucking, intense sex that has all three women sweating and breathless. Simone finally gets to have orgasms that she has always dreamed about from women she has only fantasized over. \n\nAnd next week, we find out what happened to her daughter-in-law in the final episode of this feature.\n\nScreens &lt;a href=&quot;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=32877&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=32877&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:c44526865a873e99970ac365eb2b368e3412a5bc","amp;dn":"TSPussyhunters--TPH-32877+TS+Foxxy%2C+Jesssica+Fox%2C+Simone+Sonay+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44526865a873e99970ac365eb2b368e3412a5bc","infoHashBuffer":{"type":"Buffer","data":[196,69,38,134,90,135,62,153,151,10,195,101,235,43,54,142,52,18,165,188]},"announce":[],"urlList":[]}}