{"title":"Gold in the Furnace: Experiences in Post-War Germany","uid":11720912,"size":2485087,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c450a08ec6db47cd7dd49c557838c5d36c456c1d&amp;dn=Gold+in+the+Furnace%3A+Experiences+in+Post-War+Germany&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424810217,"description":"Gold in the Furnace is an ardent National Socialist's vivid and moving account of life in occupied Germany in the aftermath of World War II, based on extensive travels and interviews conducted in 1948 and 1949. The authoress, Savitri Devi, is scathing in her description of Allied brutality and hypocrisy: millions of German civilians died from Allied firebombing; millions more perished after the war, driven from their homes by Russians, Czechs, and Poles; more than a million prisoners of war perished from planned starvation or outright murder in Allied concentration camps; untold thousands more disappeared into slave labour camps from the Congo to Siberia. Savitri Devi describes in vivid detail how individual National Socialists were subjected to de-Nazification by Germany s democratic liberators : murder, torture, starvation, show-trials, imprisonment, and execution for the higher echelons; petty indignities and recantations extorted under the threat of imprisonment, hunger, and the denial of livelihood for ordinary party members. She also chronicles the systematic plunder of Germany by the Allies: the clear-cutting of ancient forests, the dismantling of factories, the theft of natural resources. In spite of the disaster, Savitri Devi did not view it as the end of National Socialism, but as a purification a trial by fire separating the base metal from the gold a prelude to a new beginning. Thus Savitri also devotes chapters to presenting the basic philosophy and the constructive political programme of National Socialism. Gold in the Furnace is a valuable historical document: of the National Socialists who never lost faith, despite suffering, persecution, and martyrdom of the ordinary Germans who revered Hitler even after the war of the widespread rumours of Hitler s survival of the hopes of imminent National Socialist revival, perhaps in the aftermath of a Third World War of the expectations of Soviet victory in such a war and of the philosophy, experiences, and unique personality of a remarkable woman. Gold in the Furnace is one of the first revisionist books on World War II and its aftermath. But although Savitri Devi exposes many falsehoods about the concentration camps, she accepted the existence of homicidal gas chambers and regarded attempts to deny the mass-extermination of Jews as intellectually dishonest pandering to humanitarian sentimentality. It was only in 1977, after reading Arthur Butz s The Hoax of the Twentieth-Century, that Savitri Devi came to reject the central claims of the Holocaust story","torrent":{"xt":"urn:btih:c450a08ec6db47cd7dd49c557838c5d36c456c1d","amp;dn":"Gold+in+the+Furnace%3A+Experiences+in+Post-War+Germany","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c450a08ec6db47cd7dd49c557838c5d36c456c1d","infoHashBuffer":{"type":"Buffer","data":[196,80,160,142,198,219,71,205,125,212,156,85,120,56,197,211,108,69,108,29]},"announce":[],"urlList":[]}}