{"title":"The Last Testament vol-5 #29-interviews in Nepal.avi","uid":14727889,"size":232742872,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c4670253ff65fdd4eb3ec898fa1d22f76d21c3e8&amp;dn=The+Last+Testament+vol-5+%2329-interviews+in+Nepal.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1464566292,"description":"The Last Testament vol5 #29 , Nepal 1986\r\n\r\nVideo is not of the best quality, but answers are very interesting, see list of questions below\r\n\r\nINTERVIEW WITH ENZO BIAGI, AKA SARJANO, IL MANIFESTO, ITALY\r\n\r\nQ: YOUR COMMUNE IN AMERICA OREGON, HAS BEEN DESCRIBED AS BOTH, AS AN EXPERIMENT OF AN ALTERNATIVE SOCIETY AND AS AN EXPERIMENT OF A REAL COMMUNIST.(*) WOULD YOU AGREE?\r\n\r\nA: Yes, I agree. I agree totally.\r\n\r\nIt was an experiment for both: as an alternative society and as a higher quality of communism.\r\n....................\r\nQ: HAS THE FACT YOU LEFT AMERICA TO BE CONSIDERED A FAILURE OF YOUR EXPERIMENT?\r\n\r\nA: It was not a failure. It was an absolute success....\r\n..............................\r\nQ: BHAGWAN, THAT MEANS THAT THERE IS NO HOPE FOR WHEREVER PEOPLE LIKE YOU WILL TRY AN EXPERIMENT LIKE THIS -- IT WILL, IS IT BOUND TO BE DESTROYED?\r\n\r\nA: No, there is always hope. They can destroy one time, they can destroy hundred times, but they cannot destroy it always.\r\n...........\r\nQ: WE THINK THAT THERE HAS BEEN SOME MISUNDERSTANDING WHEN YOU TALK AGAINST POVERTY TOO. IN FACT, IT HAS BEEN A REPORT TODAY YOU ARE AGAINST THE POOR. WILL YOU PLEASE MAKE IT CLEAR: ARE YOU AGAINST POVERTY OR AGAINST THE POOR?\r\n\r\nA: There is no misunderstanding. I am against poverty, but without poverty how can there be poor people?\r\n..............................\r\nQ: WHAT IS YOUR ADVICE TO DESTROY POVERTY FROM THE WORLD?\r\n.............................\r\nQ: BHAGWAN, WE AGREE WITH YOU IN TOTAL AND FOR, WHATEVER HELP WE CAN BE WE WOULD LIKE TO KNOW IN WHICH CIRCUMSTANCE WOULD YOU BE WILLING TO CREATE ANOTHER EXPERIMENT OF AN ALTERNATIVE SOCIETY TO OFFER AS A MODEL TO THE WORLD?\r\n.Q: YOU TALK ABOUT MEDITATION. CAN YOU EXPLAIN THE DIFFERENCE BETWEEN MEDITATION TECHNIQUES AND MEDITATION ITSELF? AND HOW THERE CAN BE MEDITATION THAT CAN DRIVE YOU IN A BULLDOZER, OR WORKING TWELVE HOURS A DAY?\r\n\r\nA: Meditation techniques are not really meditation.\r\n\r\nMeditation techniques only prepare the ground.\r\n............................\r\nQ: DO YOU THINK THAT YOUR SANNYASI AND FRIENDS HAVE NOW LEARNED THE LESSON ABOUT THE DANGER OF AN ORGANIZED RELIGION?\r\n..............................\r\nQ: IF YOU HAVE THE CHANCE TO SPEAK BOTH TO REAGAN AND GORBACHOV WHAT WOULD YOU SAY TO THEM?\r\nQ: IF YOU HAVE THE CHANCE TO SPEAK BOTH TO REAGAN AND GORBACHOV WHAT WOULD YOU SAY TO THEM?\r\n\r\nA: I would say to them that if they have any humanity left in them then the first thing is: help to create one world.\r\n\r\nThey are the greatest powers in the world -- if they want, it becomes a very easy thing","torrent":{"xt":"urn:btih:c4670253ff65fdd4eb3ec898fa1d22f76d21c3e8","amp;dn":"The+Last+Testament+vol-5+%2329-interviews+in+Nepal.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4670253ff65fdd4eb3ec898fa1d22f76d21c3e8","infoHashBuffer":{"type":"Buffer","data":[196,103,2,83,255,101,253,212,235,62,200,152,250,29,34,247,109,33,195,232]},"announce":[],"urlList":[]}}