{"title":"The Loss of USS Liberty (USS Liberty attacked by Israel)","uid":3420880,"size":88475206,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:c4ffb47d4899f9179120b2e90867cf70654e9f57&amp;dn=The+Loss+of+USS+Liberty+%28USS+Liberty+attacked+by+Israel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ReVIsed","files":1,"time":1134558290,"description":"?Loss of Liberty,? dramatically proves, beyond any doubt, that the attack by Israel on June 8, 1967 against the U.S. naval intelligence gathering ship USS Liberty, in which 34 Americans were killed and 171 wounded, was deliberate. Produced by Howard Films (Tito Howard), the video first lets Israeli officers make their totally unconvincing case that the attack was a ?tragic accident? when the Israelis mistook the much larger and differently configured USS Liberty for the totally unlike Egyptian ship El Quseir.\n\nThis filmed testimony by dozens of USS Liberty survivors of the agony they suffered during and after the Israeli attack, even unto this day, has gut-wrenching emotional power. The testimony of many heroic Americans, including dozens of Congressional Medal of Honor winners, demolishes Israel?s ?tragic accident? claim. Former Secretary of State Dean Rusk and former chairman of the Joint Chiefs of Staff Admiral Thomas Moorer are representative of the honored high-ranking Americans supporting the condemnation of deliberate aggression against the United States by ?ally? Israel.\n\n?Loss of Liberty? makes clear that then-President Lyndon Johnson conspired with Israel and its Israel-First supporters inside the U.S. government to support the ?tragic accident? scheme. Johnson was bogged down at the time in the Vietnam war, and thought he needed Israel Lobby support. Still, Johnson?s behavior is as unforgivable now as it was then.\n\nRuntime......: 00:51:48\nVideo Codec..: Windows Media Video 8\nVideo Bitrate: ? Kbps\nAudio Codec..: Windows Media Audio 8\nAudio Bitrate: 32 kbps\nFrame Size...: 320 x 240","torrent":{"xt":"urn:btih:c4ffb47d4899f9179120b2e90867cf70654e9f57","amp;dn":"The+Loss+of+USS+Liberty+%28USS+Liberty+attacked+by+Israel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4ffb47d4899f9179120b2e90867cf70654e9f57","infoHashBuffer":{"type":"Buffer","data":[196,255,180,125,72,153,249,23,145,32,178,233,8,103,207,112,101,78,159,87]},"announce":[],"urlList":[]}}