{"title":"The Ghost - New Political Thriller by Robert Harris - BBC Radio ","uid":4082894,"size":128877493,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c509f5d4ef3d8950c2d93dbbad95271a3d52457a&amp;dn=The+Ghost+-+New+Political+Thriller+by+Robert+Harris+-+BBC+Radio+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"simonyfox","files":2,"time":1205653376,"description":"The Ghost - New Political Thriller by Robert Harris - BBC Radio Audiobook\n\nRobert Harris thriller about a professional ghost writer who takes on an assignment to write the memoirs of former Prime Minister Adam Lang.\n\nRead by Douglas Hodge\n\nTen episodes of approximately 15 minutes each in high quality MP3.\n\nEpisode 1:\nThere is plenty to write about, for Lang, a persuasive and charismatic politician, had taken Britain into an unpopular war and now faces retribution from the International Courts of Justice. But as the ghost writer delves into Lang`s past, he discovers more than he had ever bargained for.\n\nEpisode 2:\nMartha`s Vineyard in midwinter is a hostile environment. When he reads the first draft of the memoirs, the ghost writer realises that things can only get a whole lot worse.\n\nEpisode 3:\nWith his work already cut out for him, the ghost writer rolls up his sleeves and settles down to interview Lang. The man`s charisma is all he ever thought it would be, but the details of his life are strangely hard to grasp.\n\nEpisode 4:\nThe charming story of how Lang`s wife first turned him on to politics makes a perfect beginning for the memoir. However, events quickly conspire against the ghost writer as an investigation is launched into the former PM`s time in power.\n\nEpisode 5:\nAs the world`s press descend on Lang in his Martha`s Vineyard retreat, the ghost writer discovers the intoxicating effects of life in the eye of the political storm.\n\nEpisode 6:\nFull of foreboding about the fate of his predecessor, the ghost writer cycles down to the beach where the body was found and learns something that makes the hairs on the back of his neck stand on end.\n\nEpisode 7:\nThe ghost writer wakes up in the arms of his client`s wife.\n\nEpisode 8:\nThe ghost writer tracks down a figure from Adam Lang`s past and finds himself caught up in a world of Harvard academics, CIA agents and professional hard men.\n\nEpisode 9:\nThe ghost writer is caught between a rock and a hard place. Behind him lies the full apparatus of the secret state, in front of him a single-minded man bent on destroying Adam Lang.\n\nEpisode 10:\nThe ghost writer returns to London to finish the book. His journey through high politics and personal vengeance is by no means over.\n\n_______________________\n\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 48000 Hz\nEncoder : Lame 3.96\n_______________________","torrent":{"xt":"urn:btih:c509f5d4ef3d8950c2d93dbbad95271a3d52457a","amp;dn":"The+Ghost+-+New+Political+Thriller+by+Robert+Harris+-+BBC+Radio+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c509f5d4ef3d8950c2d93dbbad95271a3d52457a","infoHashBuffer":{"type":"Buffer","data":[197,9,245,212,239,61,137,80,194,217,61,187,173,149,39,26,61,82,69,122]},"announce":[],"urlList":[]}}