{"title":"Historical Dictionary of the Republic of Macedonia","uid":11742923,"size":1620291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c54df5e937e6f903141d0581765cfcf5beb31941&amp;dn=Historical+Dictionary+of+the+Republic+of+Macedonia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425871216,"description":"Located at the very heart of the Balkans, the Republic of Macedonia has a rich and turbulent history, which reflects all the complexities of the region's past and present-day politics. In the late 19th and the early 20th century, it became the focal point of competition by the fledgling Balkan nation-states over the declining Ottoman Empire's European possessions. Late Ottoman Macedonia was a region, which impressed the external observer with its diversity: ethnic, religious, linguistic, clannish, and territorial identities all overlapped in a complex and puzzling mosaic. It is this diversity that has led to the Macedonian Question of the late 19th and early 20th centuries and continues to raise questions today.\n\nThe Historical Dictionary of the Republic of Macedonia traces the key political, socio-economic, and cultural developments in the multiethnic mosaic that is Republic of Macedonia following its secession from the Yugoslav federation in the autumn of 1991. It also surveys often overlooked topics, such as the social transformations underwent in the course of the 20th century and during the decades of socialism, as well as the recent debates about historical memory and roots of the Slav Macedonian nation. Complete with a chronology, an introductory essay, a bibliography, and over 400 hundred cross-referenced dictionary entries, this reference provides a rich account of the history, present-day politics, and society of the Republic of Macedonia","torrent":{"xt":"urn:btih:c54df5e937e6f903141d0581765cfcf5beb31941","amp;dn":"Historical+Dictionary+of+the+Republic+of+Macedonia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c54df5e937e6f903141d0581765cfcf5beb31941","infoHashBuffer":{"type":"Buffer","data":[197,77,245,233,55,230,249,3,20,29,5,129,118,92,252,245,190,179,25,65]},"announce":[],"urlList":[]}}