{"title":"Black Rednecks &amp; White Liberals","uid":11426507,"size":2343893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5f478ddece6cdd61493955e005008849f30a365&amp;dn=Black+Rednecks+%26amp%3B+White+Liberals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1415670283,"description":"This explosive new book challenges many of the long-prevailing assumptions about blacks, about Jews, about Germans, about slavery, and about education. Plainly written, powerfully reasoned, and backed with a startling array of documented facts, Black Rednecks and White Liberals takes on not only the trendy intellectuals of our times but also such historic interpreters of American life as Alexis de Tocqueville and Frederick Law Olmsted. In a series of long essays, this book presents an in-depth look at key beliefs behind many mistaken and dangerous actions, policies, and trends. It presents eye-opening insights into the historical development of the ghetto culture that is today wrongly seen as a unique black identity--a culture cheered on toward self-destruction by white liberals who consider themselves &quot;friends&quot; of blacks. An essay titled &quot;The Real History of Slavery&quot; presents a jolting re-examination of that tragic institution and the narrow and distorted way it is too often seen today. The reasons for the venomous hatred of Jews, and of other groups like them in countries around the world, are explored in an essay that asks, &quot;Are Jews Generic?&quot; Misconceptions of German history in general, and of the Nazi era in particular, are also re-examined. So too are the inspiring achievements and painful tragedies of black education in the United States. &quot;Black Rednecks and White Liberals&quot; is the capstone of decades of outstanding research and writing on racial and cultural issues by Thomas Sowell","torrent":{"xt":"urn:btih:c5f478ddece6cdd61493955e005008849f30a365","amp;dn":"Black+Rednecks+%26amp%3B+White+Liberals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f478ddece6cdd61493955e005008849f30a365","infoHashBuffer":{"type":"Buffer","data":[197,244,120,221,236,230,205,214,20,147,149,94,0,80,8,132,159,48,163,101]},"announce":[],"urlList":[]}}