{"title":"Handbook of Mobile Communication Studies by James E. Katz [==HxH","uid":10766540,"size":2375619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6001bf469a7ef1261a854539b603e1c63030c0f&amp;dn=Handbook+of+Mobile+Communication+Studies+by+James+E.+Katz+%5B%3D%3DHxH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408036466,"description":"\nBook Description:\n\nMobile communication has become mainstream and even omnipresent. It is arguably the most successful and certainly the most rapidly adopted new technology in the world: more than one of every three people worldwide possesses a mobile phone. This volume offers a comprehensive view of the cultural, family, and interpersonal consequences of mobile communication across the globe. Leading scholars analyze the effect of mobile communication on all parts of life, from the relationship between literacy and the textual features of mobile phones to the use of ringtones as a form of social exchange, from the &quot;aspirational consumption&quot; of middle class families in India to the belief in parts of Africa and Asia that mobile phones can communicate with the dead. The contributors explore the ways mobile communication profoundly affects the tempo, structure, and process of daily life around the world. They discuss the impact of mobile communication on social networks, other communication strategies, traditional forms of social organization, and political activities. They consider how quickly miraculous technologies come to seem ordinary and even necessary--and how ordinary technology comes to seem mysterious and even miraculous. The chapters cut across social issues and geographical regions; they highlight use by the elite and the masses, utilitarian and expressive functions, and political and operational consequences. Taken together, the chapters demonstrate how mobile communication has affected the quality of life in both exotic and humdrum settings, and how it increasingly occupies center stage in people's lives around the world.James E. Katz is Chair of the Department of Communication at Rutgers University and director of the Center for Mobile Communication Studies. He is the author of Magic in the Air: Mobile Communication and the Transformation of Social Life and coauthor of Social Consequences of Internet Use (MIT Press, 2002).\n\nProduct Details:\n\nHardcover: 485 pages\nPublisher: The MIT Press (May 9, 2008)\nLanguage: English\nISBN-10: 0262113120\nISBN-13: 978-0262113120\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:c6001bf469a7ef1261a854539b603e1c63030c0f","amp;dn":"Handbook+of+Mobile+Communication+Studies+by+James+E.+Katz+%5B%3D%3DHxH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6001bf469a7ef1261a854539b603e1c63030c0f","infoHashBuffer":{"type":"Buffer","data":[198,0,27,244,105,167,239,18,97,168,84,83,155,96,62,28,99,3,12,15]},"announce":[],"urlList":[]}}