{"title":"Iggy Pop - Soldier [Bonus Tracks] 320 bit","uid":6878417,"size":105639502,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c63c36934f2cacf5cef438b2a204f136443d6c27&amp;dn=Iggy+Pop+-+Soldier+%5BBonus+Tracks%5D+320+bit+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gumball66","files":-1,"time":1323546757,"description":"Track Listing   \n\nAll songs composed by Iggy Pop, except where indicated.\n\n   1. &quot;Loco Mosquito&quot; - 3:13\n   2. &quot;Ambition&quot; (Glen Matlock) - 3:25\n   3. &quot;Knocking 'Em Down (In The City)&quot; - 3:20\n   4. &quot;Play It Safe&quot; (David Bowie, Pop) - 3:05\n   5. &quot;Get Up And Get Out&quot; - 2:43\n   6. &quot;Mr. Dynamite&quot; (Pop, Matlock) - 4:17\n   7. &quot;Dog Food&quot; - 1:47\n   8. &quot;I Need More&quot; (Pop, Matlock) - 4:02\n   9. &quot;Take Care Of Me&quot; (Pop, Matlock) - 3:25\n  10. &quot;I'm A Conservative&quot; - 3:55\n  11. &quot;I Snub You&quot; (Pop, Barry Andrews) - 3:07\n\nBonus tracks\n\n  12. &quot;Low Life&quot; (Pop, Kral) - 2:57\n  13. &quot;Drop A Hook&quot; - 4:25\n\n\nFrom Wikipedia:\n\nSoldier is a 1980 (see 1980 in music) album by proto-punk musician Iggy Pop. David Bowie and Simple Minds provide backing vocals on &quot;Play it Safe&quot;.\n\nIt is the first album on which Iggy collaborated with ex-Sex Pistols bassist Glen Matlock. Videos were made for songs &quot;Loco Mosquito&quot;, &quot;Knocking 'Em Down (in the City)&quot; and &quot;Dog Food&quot;. The album peaked at number 125 on the Billboard charts. Ex-Stooge James Williamson was originally hired to produce the album but a conflict between Williamson and David Bowie (who was assisting as a friend of Pop) over recording techniques led to Williamson walking out on the project.\n\nThere has been some debate over the lack of lead guitar on the final mix, which has been criticized by Glen Matlock. In Iggy Pop's biography, Matlock claims that the lead guitar was stripped after David Bowie was punched by Steve New for hitting on his girlfriend.\n\nRolling Stone's David Fricke reviewed the album positively, calling attention to Iggy Pop's successful weathering of his own self-destructive persona. Of the album, Fricke wrote: &quot;Soldier, like all of his albums, is a hard-fought battle in a war that Iggy Pop is determined to win. Call him Ig noble.&quot;\n\n\nReview from Allmusic.com\n\nby Mark Deming\n\nIn 1980, every punk rocker in Christendom cited Iggy Pop as a key influence, and Soldier was the album where he started asking for some payback. Original Sex Pistols bassist Glen Matlock, Rich Kids' guitarist Steve New, Ivan Kral of the Patti Smith Group, and former XTC keyboardist Barry Andrews all signed on to back Iggy on Soldier, but the result was hardly the full-frontal rock assault one might have hoped for. Reportedly, conflicts between producers James Williamson and David Bowie led to both of them walking out on the project, and Iggy is said to have gotten along so poorly with Steve New that he stripped most of New's lead guitar from the mix (which would explain why keyboards and acoustic guitar dominate the album). While 1979's New Values showed Iggy growing as a lyricist with a number of tough but introspective songs, Soldier sounds goofy by comparison, featuring oddball throwaways like &quot;Dog Food,&quot; &quot;Get up and Get Out&quot; (whose lyrics are mostly cribbed from old R&amp;B tunes), and the political &quot;satire&quot; &quot;I'm a Conservative.&quot; But Iggy's in great voice throughout, and on the few songs where the band fully catches fire (like &quot;Knocking 'Em Down (In the City)&quot; and &quot;Loco Mosquito&quot;), he leaves little doubt that his powers as a performer were still with him. Buddha reissued the album in 2000 with two non-essential bonus tracks, &quot;Low Life&quot; and &quot;Drop a Hook.&quot;\n\n\n\n","torrent":{"xt":"urn:btih:c63c36934f2cacf5cef438b2a204f136443d6c27","amp;dn":"Iggy+Pop+-+Soldier+%5BBonus+Tracks%5D+320+bit+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63c36934f2cacf5cef438b2a204f136443d6c27","infoHashBuffer":{"type":"Buffer","data":[198,60,54,147,79,44,172,245,206,244,56,178,162,4,241,54,68,61,108,39]},"announce":[],"urlList":[]}}