{"title":"[ExploitedCollegeGirls] Skylar (21 Year Old from Arizona State /","uid":8742609,"size":363900437,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c6830b78c348c76a809f0b765275fe5b9f48c013&amp;dn=%5BExploitedCollegeGirls%5D+Skylar+%2821+Year+Old+from+Arizona+State+%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1374829005,"description":"[ExploitedCollegeGirls] Skylar (21 Year Old from Arizona State / 07.25.2013)\n\nThis week I go back to that bottomless well of exploitable college girls, ASU, to find Skylar. A fresh faced 21 year old spinner who is dying to break into the porn biz. If there's anything I look for in a girl, aside from a love of anal of course, it's enthusiasm and Skylar shows up with plenty of it.\nDuring our interview Skylar doesn't come off as especially wild until she starts talking about her masturbatory habits, which turn out to be eye opening. She loves to engage in marathon masturbation where she gives herself as many as 20 or 30 orgasms in a single multi hour session. I hope she uses rechargeable batteries in her toys or that could get expensive! As soon as she reveals that she prefers to be naked, I have her strip to her cute black bra and purple panties which show off her slim body amazingly well.\nWhen she spins around and peels off her panties, I am pleased to find a nearly perfect ass and pussy. I can't wait to get my hands on both so I position her on the bed and get to work with my fingers. It doesn't take long to find Skylar's first orgasm, which is a real leg shaker for her. Trying to keep her on the edge, I grab a big toy and get back to work and give her a second one in no time at all.\nShe's really sensitive, so to give her pussy a break I have her drop to her knees and blow me. She's a little too gentle for my preference and I coach her to the point where I can face fuck her a little. She really gets into it and I'm certain that tight pussy of hers is getting wetter by the second. I toss her on the bed get to work fucking her. Feeling her tight pussy wrapping around my dick and watching her perky B cups bounce is pretty amazing stuff. Eventually, I pin her down and pound her, which she loves and she has another big, leg shaking orgasm.\nThis update is far from Skylar's record setting 20-30 orgasms, but she is certainly a happy girl after her huge pin down climax. She's done a great job, but there's one tiny bit of unfinished business. I have her drop to her knees at the foot of the bed and get to work on my cock with her mouth and eventually I unload on her face with one of my trademark uber facials.\n\nScreens: &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=19n3dwc7cw71iv5sh6j6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=19n3dwc7cw71iv5sh6j6.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=6utdlt0kdm92cjtt2yhc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=6utdlt0kdm92cjtt2yhc.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c6830b78c348c76a809f0b765275fe5b9f48c013","amp;dn":"%5BExploitedCollegeGirls%5D+Skylar+%2821+Year+Old+from+Arizona+State+%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6830b78c348c76a809f0b765275fe5b9f48c013","infoHashBuffer":{"type":"Buffer","data":[198,131,11,120,195,72,199,106,128,159,11,118,82,117,254,91,159,72,192,19]},"announce":[],"urlList":[]}}