{"title":"Everything You Know About CSS is Wrong (2008)","uid":4860111,"size":18270887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6b527be97f49008d310a5fb68de4820e1889ba1&amp;dn=Everything+You+Know+About+CSS+is+Wrong+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malkavius","files":1,"time":1240234173,"description":"Get ready to experience an eye-opening expos on CSS as you know it today. You'll discover a fresh approach to coding Cascading Style Sheets, making old hacks and workarounds a distant memory.\n\nIn this book, you'll learn how to start taking full advantage of Internet Explorer 8 using the very latest CSS techniques -- whilst still catering for those nasty old browsers. You'll unearth what's put the final nail in the HTML table-based layout coffin, and gain an understanding from two experts why CSS has a very bright future.\n\nSome of the valuable insights in this book include:\n\n    * how you can take full advantage of IE8\n    * how to take CSS tables to the limit and beyond\n    * letting you say goodbye to old hacks and workarounds FOREVER!\n    * help you rediscover what you first loved about CSS\n    * ensure make the most of what CSS has to offer\n    * understand the road ahead for CSS\n\nCSS was conceived in an age when web site design was simple; its creators never anticipated the level of intricacy required in the designs that it would be asked to deliver today. Clever designers figured out ways to make CSS do what they needed, but using techniques so convoluted that it became unpredictable and difficult to master. CSS just became too hard ...\n\nThe good news is, that's all about to change, and this book will show you how!\n","torrent":{"xt":"urn:btih:c6b527be97f49008d310a5fb68de4820e1889ba1","amp;dn":"Everything+You+Know+About+CSS+is+Wrong+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6b527be97f49008d310a5fb68de4820e1889ba1","infoHashBuffer":{"type":"Buffer","data":[198,181,39,190,151,244,144,8,211,16,165,251,104,222,72,32,225,136,155,161]},"announce":[],"urlList":[]}}