{"title":"Successful Composites Technology Transfer","uid":14728905,"size":14625811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6d079ee914dd9559e30ebadd5b5716ecb934d19&amp;dn=Successful+Composites+Technology+Transfer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464575389,"description":"Successful Composites Technology Transfer - Applying NASA Innovations to Industry - George N. Bullen (SME, 2015).pdf\r\n\r\nISBN 9780872638808\r\n\r\nThe ingenuity and visibility of NASA space programs, such as the max launch abort system (MLAs), are sparking the creativity, knowledge transfer, and unique applications of revolutionary technologies in areas such as aerospace, wind energy, transportation, oil, safety, and civil infrastructure. Lightweight, high-strength, carbon-fiber composites materials, vacuum-assisted resin transfer molding, smart sensors, out-of-autoclave curing of autoclave composites, unified structures, structural health monitoring systems, smart phone/rfid tracking, determinant assembly, forensic engineering, and the digital tapestry that ties everything together are just a few of the technological advances perfected in NASA s programs. Successful composites technology transfer takes the discussion of these technologies to the next level addressing the advantages and challenges to their more widespread industrial application. Readers will get insight into how high-strength, carbon-fiber composites and its related technologies are making inroads into products such as commercial airplane seats and carts, turbine blades, firefighting equipment, trucks, buses, lifting and support devices, and containers. The author shares breakthrough thinking on other potential applications, such as a new lighter than air ship, prototype vehicles, driver health and safety, firefighter safety, and bridge infrastructure safety and health monitoring. According to Foreword author, Tim Shinbara, vice president of manufacturing technology at AMT (Association for Manufacturing Technology), ...it is of considerable value to search out, discover, and digest resources such as this book in an effort to continually improve the lens by which we innovate. Aside from new product innovations, extension of the manufacturing technologies, and processes described herein have the potential to not only add new functionality or modify the existing functionality of existing products and systems, but in many cases, adoption would require minimal effort from the manufacturing enterprise","torrent":{"xt":"urn:btih:c6d079ee914dd9559e30ebadd5b5716ecb934d19","amp;dn":"Successful+Composites+Technology+Transfer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d079ee914dd9559e30ebadd5b5716ecb934d19","infoHashBuffer":{"type":"Buffer","data":[198,208,121,238,145,77,217,85,158,48,235,173,213,181,113,110,203,147,77,25]},"announce":[],"urlList":[]}}