{"title":"Serbian Rap - Znamo vas od ranije","uid":9289423,"size":2810497,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6ee4c282368a02f77953e34b7e5e5d825a09a50&amp;dn=Serbian+Rap+-+Znamo+vas+od+ranije&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Balkana","files":1,"time":1386064715,"description":"This song is dedicated to repressive Serbian government. In Serbia, politicians criminals, nazi-fascists and murderers are in government. Police mistreat and kill innocent. The Gendarmerie dealing drugs, weapons... They are involved in human trafficking. They're like the Mafia. You must pay them to protect you. It is otherwise called racketeering. People in Serbia do not have a job. Especially young people. People in Serbia are dying of starvation. They die because they have no money to pay for the surgery. They die in the silent war, war of the rich against the poor. They are 1%. We are the 99%.\n\nSerbia is ruled by those who are in the wars in '90th were killing innocent civilians in Bosnia and Herzegovina, in Croatia, in Serbia... Names such as Aleksandar Vucic, Tomislav Nikolic, Ivica Dacic, and many others similar to them, they are a symbol of nazi-fascism, as Hitler's Germany... They are thieves and liars, murderers, hypocrites... They are bullet that kills the hungry people in Serbia. They are government, they are terrorists, they are rich, they are powerful and they do not deny this fact. They simply avoided the truth. Like Obama. Or Bush.\n\nWe are Serbian rebels and we are fighting against this system.\n\nFrom Balkans with the rage tears... No fear. Never again. We will rise...\n\nLa Rabia Del Pueblo!","torrent":{"xt":"urn:btih:c6ee4c282368a02f77953e34b7e5e5d825a09a50","amp;dn":"Serbian+Rap+-+Znamo+vas+od+ranije","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ee4c282368a02f77953e34b7e5e5d825a09a50","infoHashBuffer":{"type":"Buffer","data":[198,238,76,40,35,104,160,47,119,149,62,52,183,229,229,216,37,160,154,80]},"announce":[],"urlList":[]}}