{"title":"NubileFilms - Kimber Day (Affairs Of The Heart / 11.08.2013","uid":9163727,"size":258042935,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c6f51861e492e61de6c8685c9008e0326ce7a2fe&amp;dn=NubileFilms+-+Kimber+Day+%28Affairs+Of+The+Heart+%2F+11.08.2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"codho","files":-1,"time":1383925815,"description":"Luscious Kimber Day enjoys a night on the town with her man Ryan Driller. The couple ducks into the elevator of their hotel where they exchange longing kisses, and as soon as the doors open they make their way back to their room where they can enjoy the soft hotel bed.\n\nThere's not much for Ryan to do when it comes to disrobing his partner; when he pulls Kimber's dress up with his teeth he finds her bare of panties and dripping wet beneath. Taking the invitation that is offered by his woman's dripping pussy, Ryan presses his tongue to her swollen clitoris and goes to work with his magical mouth. Meanwhile, Kimber increases her pleasure by pulling the top of her dress down to massage her full needy breasts and her tight little nipples.\n\nThe extended pussy feast continues until Ryan can no longer stand the exquisite tension. The brunette is receptive to her man's advances, pulling his long hard cock from his jeans and fondling it with her eager hands to get him warmed up and ready to go.\n\nOnce he's naked, Ryan wastes no time in parting Kimber's legs and sliding his dick home into the tight warmth of her welcoming pussy. The lovers are enamored by the intimacy of missionary position and the many variations they can enjoy, and so they take their time enjoying each other until Kimber gives in and moans her first orgasm.\n\nTemporarily satisfied, Kimber wraps her lovely lips around her beau's erection and settles in for a good long blowjob that she delivers with a smile.\n\nAlthough she enjoys her delicious treat, Kimber isn't ready to let her man cum until she gets another orgasm! Rolling onto her hands and knees so that her tits hang in the air, Kimber presents her lush ass to Ryan so that he can push his cock home and pound into her from behind. The rhythm they set is fast and furious, swiftly bringing the brunette to another fulfilling climax.\n\nFinally sated, Kimber rolls onto her back and opens her mouth to eagerly await Ryan's cum all over her face. When he is finished, she takes her time licking off her man's cock and then her fingers to make sure that she has swallowed every delicious drop.\n\n\n\nScreenshot :\n  &lt;a href=&quot;\nhttp://bayimg.com/LaCbPaafc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LaCbPaafc&lt;/a&gt;","torrent":{"xt":"urn:btih:c6f51861e492e61de6c8685c9008e0326ce7a2fe","amp;dn":"NubileFilms+-+Kimber+Day+%28Affairs+Of+The+Heart+%2F+11.08.2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f51861e492e61de6c8685c9008e0326ce7a2fe","infoHashBuffer":{"type":"Buffer","data":[198,245,24,97,228,146,230,29,230,200,104,92,144,8,224,50,108,231,162,254]},"announce":[],"urlList":[]}}