{"title":"Mon valet et moi - Herve Guibert epub","uid":15648719,"size":1306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c70ca8d19cd61f11edaf9b6ae4601c9a90174dad&amp;dn=Mon+valet+et+moi+-+Herve+Guibert+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ad2san","files":1,"time":1472074992,"description":"Mon Valet et moi (1991)\r\n \r\nParis, Seuil, 1991.\r\n \r\nPrésentation :\r\n\r\n« Le héros qui dit ‘je’ est un riche vieillard de quatre-vingts ans et n’est pas homosexuel, le valet qui le sert est un jeune homme d’à peine vingt ans qui ne l’est plus. Il n’est rien, à vrai dire, simple acteur d’un jour dans un film médiocre que s’est trouvé voir par hasard celui qui deviendra son maître. On peut imaginer ce vieillard affaibli comme une image qu’un Guibert malade et enrichi se donne, dans ces fictions qu’on s’invente, par impossibilité de ne pas imaginer. Et que le valet serait une des innombrables versions du désir qu’on se prête d’une biographie neuve, presque instantanée, ou tout peut arriver. »\r\n\r\nRaymond Bellour, « Double jeu », Le Magazine littéraire, octobre 1991, p.84.\r\n\r\nHervé Guibert à propos de Mon valet et moi :\r\n\r\n« Je connais mal Romain Gary, mais j’ai l’impression que le choix qu’il a fait un jour d’écrire sous le nom d’Emile Ajar répond au même besoin que celui qui m’a fait écrire Mon valet et moi : l’urgence de changer de peau. La différence, c’est que, moi, je n’utilise pas de pseudonyme. »\r\n\r\n« J’ai l’impression de survivre », entretien avec Jérôme Garcin, L’Evénement du jeudi, 26 septembre-2octobre 1991, p.104.\r\n\r\nExtrait :\r\n\r\n« Les narrateurs des romans russes ont des valets qui dorment comme des chiens dans des vestibules traversés de courant d’air, aiguisent le fleuret de leurs duels et portent leurs vieux pardessus. Ce sont des ratés, souvent des doubles de leurs maîtres, qui auraient pu être à leur place, mais qu’une infortune de naissance ou une femme, le jeu, a abaissés à ce rang. Ils sont serviles par lassitude, tout leur être exhale quelque chose de rance. Ils travaillent sans amour et sans précision, cirer les bottes de leurs maîtres ne les enthousiasme même pas. Mon valet à moi était un tueur en puissance, c’est pour cela que je l’avais choisi. J’étais un homme sur le déclin. J’avais besoin d’un vrai garde du corps, quelqu’un qui me ramasse quand je tombe, m’habille, pince mes jambes quand elles s’engourdissent au point que je ne les sens plus. Mon valet était tout le contraire du typique valet russe : le moindre de ses services, il me les procurait avec fougue, comme si ce geste, en l’occurrence me relever de ma baignoire, était du plus crucial intérêt pour lui. C’était peut-être la passion de la haine qui le motivait, je l’ignorais alors. »","torrent":{"xt":"urn:btih:c70ca8d19cd61f11edaf9b6ae4601c9a90174dad","amp;dn":"Mon+valet+et+moi+-+Herve+Guibert+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c70ca8d19cd61f11edaf9b6ae4601c9a90174dad","infoHashBuffer":{"type":"Buffer","data":[199,12,168,209,156,214,31,17,237,175,155,106,228,96,28,154,144,23,77,173]},"announce":[],"urlList":[]}}