{"title":"DVD shrink Version. 3.2.0.15","uid":5673673,"size":970918,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c9125dd24a4901d055b33191da20009b22af5534&amp;dn=DVD+shrink+Version.+3.2.0.15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"auchlinn","files":20,"time":1278449781,"description":"DVD Shrink is a software application that allows you to backup your DVD disks.You can use this software in conjunction with DVD burning software of your choice, to make a backup copy of any DVD video disk.\n\nDVD Shrink does burn DVDs! The output from DVD Shrink is saved as files on your hard drive, which you can then burn to a DVD-R using separate burning software, such as alcohol 120%\n\n\nWhy Use DVD Shrink :\n\nMost DVD titles are designed to prevent you from making copies.\n\nThe first preventative measure is encryption. Most DVD titles are encrypted, \nwhich prevents you from either copying them to your hard drive, or if you manage to do so, being able to play the resulting files. DVD Shrink overcomes this problem with built-in decryption algorithms.\n\nThe next problem is not so easy. Most DVD video titles are simply too large to fit, without modification, onto a single recordable DVD-R disk. DVD Shrink overcomes this problem by modifying or &quot;shrinking&quot; the data from your original DVD.\n\nDVD Shrink provides two ways of shrinking your DVD disk. These are re-authoring and re-encoding. You can use one, or the other, or for maximum &quot;shrinkage&quot;, both combined.\n\t","torrent":{"xt":"urn:btih:c9125dd24a4901d055b33191da20009b22af5534","amp;dn":"DVD+shrink+Version.+3.2.0.15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9125dd24a4901d055b33191da20009b22af5534","infoHashBuffer":{"type":"Buffer","data":[201,18,93,210,74,73,1,208,85,179,49,145,218,32,0,155,34,175,85,52]},"announce":[],"urlList":[]}}