{"title":"The Seahawk - Complete Soundtrack (Erich Wolfgang Korngold)","uid":4441294,"size":42745760,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c99d8a44a386c8f9e3f75b12dc761dc7cc530b8e&amp;dn=The+Seahawk+-+Complete+Soundtrack+%28Erich+Wolfgang+Korngold%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelingeorgia","files":17,"time":1223828977,"description":"This is the complete film score to the 1935 classic film THE SEAHAWK starring Erroll Flynn and Brenda Marshall. It&amp;#039;s a great film, owing much to the incredible music of ERICH WOLFGANG KORNGOLD.\n\nDuring the 1920s and 1930s, Korngold was renowned in Europe as a &quot;wunderkind&quot;, a musical genius compared to Mozart. His godfather was Richard Strauss. Erich was primarily known as an opera composer, and it was this sensibility that he would later take with him to Hollywood. Indeed, he practically invented the lush &quot;Hollywood sound&quot; of orchestral scoring that would become a staple in Hollywood&amp;#039;s best films.\n\nBarely escaping the Nazis with his life, Korngold worked in Hollywood during the war years, composing the music for just 17 films, which included THE ADVENTURES OF ROBIN HOOD, ANTHONY ADVERSE, BETWEEN TWO WORLDS, CAPTAIN BLOOD, and DEVOTION. Later, he returned to his home in Europe only to find out that the romantic style which he loved was considered old-fashioned: atonality and serialism dominated. \n\nKorngold died in 1957. It is a shame that he did not live to see not only the virtual death of the so-called &quot;modern school&quot;, but also the resurrection of the &quot;Hollywood sound&quot;, not only in the movies by such composers as John Williams, Jerry Goldsmith, and others, but also in the concert hall. \n\nTHE SEAHAWK represents Hollywood film scoring at its finest, and is arguably one of Korngold&amp;#039;s best scores (aren&amp;#039;t they all?). It certainly is one of most energetic and exciting scores. \n\n\nSOURCE: Compact Disc\nFORMAT: MP3, Fraunhofer II 128kbs, Highest Quality\n\n ","torrent":{"xt":"urn:btih:c99d8a44a386c8f9e3f75b12dc761dc7cc530b8e","amp;dn":"The+Seahawk+-+Complete+Soundtrack+%28Erich+Wolfgang+Korngold%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c99d8a44a386c8f9e3f75b12dc761dc7cc530b8e","infoHashBuffer":{"type":"Buffer","data":[201,157,138,68,163,134,200,249,227,247,91,18,220,118,29,199,204,83,11,142]},"announce":[],"urlList":[]}}