{"title":"Donut Shop Mystery Series - Jessica Beck","uid":9328588,"size":4803674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca2a3fde22e52db71a2e734ecd2fa2179a089e33&amp;dn=Donut+Shop+Mystery+Series+-+Jessica+Beck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1386688001,"description":"Jessica Beck is a pseudonym used by\nTim Myers.\nJessica Beck is the penname of an author who has been nominated for the Agatha Award and named an Independent Mystery Booksellers Association national bestseller nearly a dozen times.\n\nJessica Beck loves donuts, and has the figure to prove it. It's amazing what people can convince themselves is all in the name of research! For each recipe featured in the donut mysteries, a dozen more are tried and tested. \n\nWhen not concocting delicious treats, Beck enjoys the rare snowfalls near her home in the foothills of North Carolina.\n\n\nMeet Suzanne Hart, owner and operator of Donut Hearts coffee shop in April Springs, North Carolina. After her divorce from Max, an out-of-work actor she's dubbed 'The Great Impersonator,' Suzanne decided to pursue her one true passion in life: donuts. So she cashed in her settlement and opened up shop in the heart of her beloved hometown.\n\nBut when a dead body is dumped on her doorstep like a sack of flour, Suzanne's cozy little shop becomes an all-out crime scene. Now, everyone in town is dropping by for glazed donuts and gruesome details. The retired sheriff warns her to be careful - and they're all suspects. Soon Suzanne - who finds snooping as irresistible as donuts - is poking holes in everyone's alibis.","torrent":{"xt":"urn:btih:ca2a3fde22e52db71a2e734ecd2fa2179a089e33","amp;dn":"Donut+Shop+Mystery+Series+-+Jessica+Beck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2a3fde22e52db71a2e734ecd2fa2179a089e33","infoHashBuffer":{"type":"Buffer","data":[202,42,63,222,34,229,45,183,26,46,115,78,205,47,162,23,154,8,158,51]},"announce":[],"urlList":[]}}