{"title":"Nubiles-Porn - Sandra Wellness aka Jezla (Cum Swallowing Cutie)","uid":14742218,"size":289543699,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ca765347c4a48daa26fdb0f09d01cb232c27f173&amp;dn=Nubiles-Porn+-+Sandra+Wellness+aka+Jezla+%28Cum+Swallowing+Cutie%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1464689604,"description":"Cute coed Sandra Wellness is on a seductive mission as she struts towards Leo Dee wearing just a bra and panties. Leo is quick to strip his lusty girlfriend naked and to lay her down on the bed for a bald pussy feast that leaves her squirming and moaning. When Sandra returns the favor by wrapping her warm puffy lips around his stiffie and sucking him like a pro, Leo knows he's in for a great afternoon.Climbing on top of Leo, Sandra sinks down slowly until his stiffie has filled her up and she's ready to start moving her hips. Her ride gets faster and hornier the longer it goes on, and gets even more delightful when Sandra turns around for some reverse cowgirl action. By the time she needs a break, Leo is happy to spoon with her while driving in and out of her soft twat.A doggy style pussy pounding is just what Sandra needs to finally find the satisfaction she craves. The feeling of Leo's balls slapping against her ass brings her to climax, a feeling that she is happy to help Leo experience as well. Using her soft lips once again she sucks her boyfriend off, not stopping until she has swallowed every last drop of his cum shot.\r\nTags: Medium Boobs, Shaved Pussy, Brunette, Short hair, Bras, Panties, Hardcore, Girl-Boy, Blowjob, European, Swallow, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=39152967685926914168.jpg\r\n \nhttp://imgdone.com/viewer.php?file=37783497473992935379.jpg","torrent":{"xt":"urn:btih:ca765347c4a48daa26fdb0f09d01cb232c27f173","amp;dn":"Nubiles-Porn+-+Sandra+Wellness+aka+Jezla+%28Cum+Swallowing+Cutie%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca765347c4a48daa26fdb0f09d01cb232c27f173","infoHashBuffer":{"type":"Buffer","data":[202,118,83,71,196,164,141,170,38,253,176,240,157,1,203,35,44,39,241,115]},"announce":[],"urlList":[]}}