{"title":"Alex Jones Show - 2012 Mar 04 SU [sebaygo1]","uid":7078348,"size":42752280,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cb06c41f3cad0c61a108a36cc91875b329a3a9c2&amp;dn=Alex+Jones+Show+-+2012+Mar+04+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":8,"time":1330928952,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 04 March 2012\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events.\n\nThe Infowars web site describes today's broadcast as follows.\n\nToday on this LIVE Sunday edition of the Alex Jones Show, Alex welcomes author and leading birth certificate researcher Jerome Corsi to unveil the latest information on the shadow war for leading up to the 2012 elections. The investigation into the mysterious death of Andrew Breitbart continues, as reports show he had been meeting with Sheriff Joe Arpaio just days before his untimely demise. Breitbart had been poised to release bombshell footage of Obama on the day of his death which he hoped would sink Obama's re-election chances, while Arpaio is pursuing 'probable cause' in a case questioning Obama's birth certificate and eligibility. \n\nAlex covers other news, including the declared victory by Vladimir Putin in Russia's elections, hotly contested by a largely Western-backed opposition crying fraud at the results. \n\nAlso, Alex discusses the release of his speech from Dallas, Texas, the Blueprint to Defeat the New World Order, accompanying the new mini-documentary New World Order: Blueprint of Madmen, both available at PrisonPlanet.tv and on You Tube.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:cb06c41f3cad0c61a108a36cc91875b329a3a9c2","amp;dn":"Alex+Jones+Show+-+2012+Mar+04+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb06c41f3cad0c61a108a36cc91875b329a3a9c2","infoHashBuffer":{"type":"Buffer","data":[203,6,196,31,60,173,12,97,161,8,163,108,201,24,117,179,41,163,169,194]},"announce":[],"urlList":[]}}