{"title":"Microsoft Office 2016 - Language Accessory Packs (x86/x64)","uid":12798665,"size":252343954,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb1217c4e9c43002316dcfc68cb2a2b7fdf5e07b&amp;dn=Microsoft+Office+2016+-+Language+Accessory+Packs+%28x86%2Fx64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1448017708,"description":"***********************************************************************\r\nMicrosoft Office 2016 (Office 365) - Language Accessory Packs (x86/x64)\r\n***********************************************************************\r\n\r\nYou can install language accessory packs after installing Microsoft Office, to add additional display, help, or proofing tools.\r\nLanguage Packs, LIPs and Proofing Tools have now been released into a single downloadable package called the Language Accessory Pack for Office 2016 (for O365).\r\n\r\nLanguage Accessory Pack for Office 2016 are offered as free downloads from MS https://support.office.com/en-gb/article/Language-Accessory-Pack-for-Office-2016-82ee1236-0f9a-45ee-9c72-05b026ee809f\r\n\r\nIt offers DL links for 32-bit Packs only, also stating that the Packs can be installed on either 32-bit or 64-bit versions of Office 2016.\r\nThis doesn't seem to be the case according to many users' comments: MS does not mention that the version of the packs (x86/x64) should match the version of the installed Office 2016.\r\nThat's why I created this compilation, which includes all available Language Accessory Packs - sorted by language (x86/x64).\r\n\r\nRequirements\r\n------------\r\n\r\n- Microsoft Office 2016 (Office 365 / Click-to-Run)\r\n- These Language Accessory Packs are NOT compatible with Office 2016 Volume Licensing edition\r\n\r\nRelease Info\r\n------------\r\n\r\n- Includes: 102 Language Accesory Packs sorted by language (x86/x64)\r\n- Format: DAA (ISO compressed)\r\n- Size: 735 MB uncompressed ISO file\r\n\r\nThis compilation includes\r\n-------------------------\r\n\r\n*** Full Packs (40): Display in selected language + Help in selected language + Proofing tools for selected language\r\n\r\nArabic, Bulgarian, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English (US), Estonian, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kazakh, Korean, Latvian, Lithuanian, Malay (Latin), Norwegian Bokmål, Polish, Portuguese (Portugal), Portuguese (Brazil), Romanian, Russian, Serbian (Latin, Serbia), Slovak, Slovenian, Spanish, Swedish, Thai, Turkish, Ukrainian, Vietnamese\r\n\r\n*** Partial Packs (62): Display in selected language for some Office applications + Proofing tools for selected language\r\n\r\nAfrikaans, Albanian, Amharic, Armenian, Assamese, Azerbaijani (Latin), Basque (Basque), Belarusian, Bangla (Bangladesh), Bangla (Bengali India), Bosnian (Latin), Catalan, Dari, Filipino, Galician, Georgian, Gujarati, Hausa, Icelandic, Igbo, Irish, isiXhosa, isiZulu, Kannada, Khmer, Kinyarwanda, KiSwahili, Konkani, Kyrgyz, Luxembourgish, Macedonian (FYRO Macedonia), Malayalam, Maltese, Maori, Marathi, Mongolian (Cyrillic), Nepali, Norwedian Nynorsk, Odia, Pashto, Persian (Farsi), Punjabi (Gurmukhi), Quechua, Romansh, Scottish Gaelic, Serbian (Cyrillic, Serbia), Serbian (Cyrillic, Bosnia &amp; Herzegovina), Sesotho sa Leboa, Setswana, Sindhi (Arabic), Sinhala, Tamil, Tatar (Cyrillic), Telugu, Turkmen (Latin), Urdu, Uyghur, Uzbek (Latin), Valencian, Welsh, Wolof, Yoruba\r\n\r\nInstallation\r\n------------\r\n\r\nExtract archive, obviously\r\nIf you have PowerIso / AnyToISO / UltraIso installed, just use it to convert the DAA file to ISO format\r\nIf you don't, extract all files into the same folder and run the batch file Makeiso (this will convert the DAA file to ISO)\r\nMount / extract ISO and install the desired Language Pack(s)\r\n\r\nConfigure Office language\r\n-------------------------\r\n\r\nAfter you install the language accessory pack, you must configure Office for your new language preferences.\r\n\r\n- Open any Office program and then click File &gt; Options &gt; Language.\r\n- Under Choose Editing Languages, make sure that the language you want to use is added to this list.\r\n- If the language accessory pack includes proofing tools for that language, the Proofing column shows Installed.\r\n- Under Choose Display and Help languages, you can change the default display and help languages for all your Office applications.\r\n- Restart all Office programs for your changes to take effect.\r\n- You can change the default language for all your Office applications in the Set the Office Language Preferences dialog.\r\n\r\nPlease SEED for a while!","torrent":{"xt":"urn:btih:cb1217c4e9c43002316dcfc68cb2a2b7fdf5e07b","amp;dn":"Microsoft+Office+2016+-+Language+Accessory+Packs+%28x86%2Fx64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1217c4e9c43002316dcfc68cb2a2b7fdf5e07b","infoHashBuffer":{"type":"Buffer","data":[203,18,23,196,233,196,48,2,49,109,207,198,140,178,162,183,253,245,224,123]},"announce":[],"urlList":[]}}