{"title":"Handy GPS v15.8","uid":13828558,"size":5731010,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:cb3eea000a4179945163dab776cc8d19f2916a99&amp;dn=Handy+GPS+v15.8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1457725517,"description":"The perfect companion for your next outdoor adventure. Seek, find, record and return home with Handy GPS.\r\n\r\nThis app is a real navigation tool designed for outdoors sports like hiking, bushwalking, mountain biking, kayaking and trail riding. Its simple to use and works even in the remotest back country since it doesn't need network connectivity. \r\n\r\nIt allows you to work in UTM or lat/lon coordinates so you can use it with your paper topographic maps. Waypoints and track logs recorded in the field can be be viewed later in Google Earth.\r\n\r\n\r\nBase features:\r\n\r\n* Shows your current location in easting/northing (UTM) or in lat/lon.\r\n* Shows your speed, direction of travel, and total distance travelled in either metric or imperial/US units.\r\n* Can store your current location as a waypoint, and can store a tack log to show where you've been.\r\n* Waypoints and track logs can be imported from and exported to Google Earth KML and GPX files.\r\n* Allows manual entry of waypoints in UTM or lat/lon coords.\r\n* Can guide you to a waypoint with the &quot;Goto&quot; screen using true or compass bearings.\r\n* Optional audible proximity alarm on goto page.\r\n* Has a magnetic compass page (on devices with mag sensors only).\r\n* Computes the local magnetic declination at startup using the IGRF-12 model, for use on the goto page.\r\n* Can display either a simple map of your current location and the stored waypoints, or a Google Map if a data connection is available.\r\n* Supports the world-wide WGS84 datum along with the Australian datums and map grids AGD66, AGD84, GDA94, AGD, GDA, AMG, and MGA. (You can also use WGS84 for NAD83 maps).\r\n* Shows satellite locations and signal strengths graphically.\r\n* Can display simple 6 or 8 digit grid refs, or MGRS grid refs.\r\n* Waypoint-to-waypoint distance and direction.\r\n* Optional timer to record walk duration and compute average speed.\r\n* Has online help pages.\r\n* Thoroughly tested by the developer on bushwalks.\r\n\r\n\r\nExtra features available only in this paid version:\r\n\r\n* Unlimited number of waypoints and track log points. (The free version is limited to 3 waypoints and 20 tracklog points)\r\n* An email or SMS containing a clickable link showing your location can be sent to a friend.\r\n* Common datums such as NAD83 (US), OSGB36 (UK), NZTM2000 (NZ), SAD69 (South America) and ED50 (Europe) can be selected from the custom datum page, or you can configure your own datum by specifying its ellipsoid and shift parameters.\r\n* UK grid refs with two letter prefixes can be shown if OSGB custom datum selected.\r\n* An elevation profile of your route can be shown.\r\n* Can average GPS locations over time to give a more accurate result.\r\n* Can take photos, which are optionally geotagged, directly from the app.\r\n* Show sun rise and set times.\r\n* Turn on/off flashlight from within app.\r\n* Export waypoints to a CSV file in UTM or Lat/Lon coordinates.\r\n* Create a new waypoint by projecting an existing one using an entered distance and bearing.\r\n* Can download tiles from various map tile servers, for use as offline maps.\r\n* Now comes complete with an Android Wear version for use on your Android Wear smartwatch. (This has the same functionality as was in the HandyGPSWear app).\r\n\r\n\r\nDisclaimer: You use this app at your own risk. The developer accepts no responsibility for you getting lost as a result of using this app. Batteries in mobile devices can go flat. An alternate power source is recommended for extended hikes.\r\n\r\nWhat's New:\r\n\r\n15.8: Changed launcher icon to be more rounded.\r\n15.7: Bug fixes and improvements to optional timer.\r\n15.6: Added support for manual entry of MGRS grid ref in wear app, when MGRS coord sys chosen.\r\n15.5: Improvements to timer, offline maps management, and wear compass.\r\n15.4: Added a walk timer which can be enabled from the prefs page.\r\n15.3: Added the ability to edit the list of tile servers.\r\n15.2: Bug fixes and improvements for downloading offline maps.\r\n\r\nMore Info:\r\n \nhttps://play.google.com/store/apps/details?id=binaryearth.handygps","torrent":{"xt":"urn:btih:cb3eea000a4179945163dab776cc8d19f2916a99","amp;dn":"Handy+GPS+v15.8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb3eea000a4179945163dab776cc8d19f2916a99","infoHashBuffer":{"type":"Buffer","data":[203,62,234,0,10,65,121,148,81,99,218,183,118,204,141,25,242,145,106,153]},"announce":[],"urlList":[]}}