{"title":"Knowledge And Decisions by Thomas Sowell","uid":9313484,"size":3530530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbc60e32cd6affd71b5cd73b4caab21b5b3440c0&amp;dn=Knowledge+And+Decisions+by+Thomas+Sowell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1386437455,"description":"With a new preface by the author, this reissue of Thomas Sowells classic study of decision making updates his seminal work in the context of The Vision of the Annointed, Sowell, one of Americas most celebrated public intellectuals, describes in concrete detail how knowledge is shared and disseminated throughout modern society. He warns that society suffers from an ever-widening gap between firsthand knowledge and decision makinga gap that threatens not only our economic and political efficiency, but our very freedom because actual knowledge gets replaced by assumptions based on an abstract and elitist social vision f what ought to be. Knowledge and Decisions, a winner of the 1980 Law and Economics Center Prize, was heralded as a landmark work and selected for this prize because of its cogent contribution to our understanding of the differences between the market process and the process of government. In announcing the award, the center acclaimed Sowell, whose contribution to our understanding of the process of regulation alone would make the book important, but in reemphasizing the diversity and efficiency that the market makes possible, [his] work goes deeper and becomes even more significant. ","torrent":{"xt":"urn:btih:cbc60e32cd6affd71b5cd73b4caab21b5b3440c0","amp;dn":"Knowledge+And+Decisions+by+Thomas+Sowell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbc60e32cd6affd71b5cd73b4caab21b5b3440c0","infoHashBuffer":{"type":"Buffer","data":[203,198,14,50,205,106,255,215,27,92,215,59,76,170,178,27,91,52,64,192]},"announce":[],"urlList":[]}}