{"title":"[PS3] LEGO Star Wars: The Complete Saga","uid":9336777,"size":5914836647,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:cbfd8020d47b41676160e1580c84f20aef6d5a55&amp;dn=%5BPS3%5D+LEGO+Star+Wars%3A+The+Complete+Saga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":-1,"time":1386867185,"description":" &lt;a href=&quot;http://www.lucasarts.com/games/legostarwarssaga/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.lucasarts.com/games/legostarwarssaga/&lt;/a&gt;\n\nThe aim of the game is to successfully make it through the entire story and collect the gold pieces while progressing through the game. In the Wii, PlayStation 3 and Xbox 360 versions there are 160 to collect; 120 of these are for the main levels. There are three for each of the levels. One is for completing the level in story mode, the second is for collecting a set amount of studs/coins to achieve a &quot;True Jedi&quot; status and the third is by collecting the 10 LEGO canisters, called &quot;minikits,&quot; which are hidden around the level. There are 20 gold bricks for completing the Bounty Hunter missions which involve finding key members of the Republic and Rebellion for Jabba the Hutt's capture and subsequent ransom. There are 6 gold bricks for completing the bonus missions and 14 to buy at the Cantina. There are 36 story levels, 20 bounty hunter missions, and six bonus levels (two Lego Cities, two story levels, and the original pod race and gunship levels). Most of the story levels are the same as those found in the original games.[11] A level involving the pursuit of bounty hunter Zam Wesell has been added (this was a deleted level from LEGO Star Wars: The Video Game), while another level that was cut from the first game (Anakin's starship battle from Episode I) is included as a bonus level. This level utilizes vehicle free-roam from the second game. The game takes place from &quot;the Trade Federation's negotiations&quot; above Naboo in Star Wars Episode I: The Phantom Menace to the space battle above Endor in Episode VI: Return of the Jedi. The &quot;Gunship Cavalry&quot; and &quot;Mos Espa Podrace&quot; levels have been redesigned although the original versions are still in the game as bonus levels. However, &quot;Battle over Coruscant&quot; remains the same except that players can change vehicles in free-play. A brand new 2-player Battle Arena mode has been added, called &quot;arcade mode&quot;, new vehicle bonus missions, the red power bricks from Lego Star Wars II, and 10 additional bounty hunter missions add new challenges to the Prequel Trilogy portions originally seen in Lego Star Wars: The Video Game. The Episodes I-II-III levels have been updated so that characters can build and ride vehicles, wear helmets and gain access to bounty hunter and stormtrooper areas, and those characters now have the ability to dodge blaster fire and have their own special melee attack (for example, Chewbacca rips off arms). New Force moves are included (force lightning and force choke). New characters have also been added, bringing the total up to 160. Indiana Jones is an unlockable playable character (to foreshadow Lego Indiana Jones: The Original Adventures).[12] One error that occured is that Luke is no longer shown screaming in the cutscene where Ben Kenobi is killed.\nPreviously Deleted Levels\n\nThis game incorporates two previously deleted levels from &quot;Lego Star Wars: The Video Game&quot;, Anakin's Flight and 'Bounty Hunter Pursuit'.","torrent":{"xt":"urn:btih:cbfd8020d47b41676160e1580c84f20aef6d5a55","amp;dn":"%5BPS3%5D+LEGO+Star+Wars%3A+The+Complete+Saga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbfd8020d47b41676160e1580c84f20aef6d5a55","infoHashBuffer":{"type":"Buffer","data":[203,253,128,32,212,123,65,103,97,96,225,88,12,132,242,10,239,109,90,85]},"announce":[],"urlList":[]}}