{"title":"Cadillacs and Dinosaurs (arcade game)","uid":4239819,"size":37186312,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc3f2cec8314056789196d4105698e7e04b56590&amp;dn=Cadillacs+and+Dinosaurs+%28arcade+game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bonewipe","files":34,"time":1213480050,"description":"Cadillacs and Dinosaurs is a 1992 arcade game released by Capcom. It is a beat &amp;#039;em up based upon the comic Xenozoic Tales which was created by Mark Schultz in the late eighties. A TV series made after the game was released, though it wasn&amp;#039;t a major success, and the Capcom game didn&amp;#039;t have any relation with it as it was based entirely on the comic series.\n\nNot to be confused with the console and computer game Cadillacs and Dinosaurs: The Second Cataclysm made by Rocket Science Games but based on the same license, this time on the TV series rather than on the original comic. Despite its success and popularity, the Capcom arcade was never released in home systems.\n\nThe game-play is like that of many other side-scrolling beat&amp;#039;em up games of the time, such as Streets of Rage or Final Fight. A distinctive feature of this game is the frequent use of firearms, rarely seen on other games of its kind, which normally favored weapons such as bottles and knives. There is also a sequence in which the player can get control of the titular vehicle by radioing for it. It is difficult to keep the car intact for long, because the boss at the end of the sequence (Hogg) is armed with grenades.\n\nEnjoy this awesome retro game. ","torrent":{"xt":"urn:btih:cc3f2cec8314056789196d4105698e7e04b56590","amp;dn":"Cadillacs+and+Dinosaurs+%28arcade+game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3f2cec8314056789196d4105698e7e04b56590","infoHashBuffer":{"type":"Buffer","data":[204,63,44,236,131,20,5,103,137,25,109,65,5,105,142,126,4,181,101,144]},"announce":[],"urlList":[]}}