{"title":"Martin Sexton - In the Journey [1991] [EAC/FLAC]","uid":11717068,"size":285527418,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc5c062514417b4afd5b4dff539868cdcc87bae0&amp;dn=Martin+Sexton+-+In+the+Journey+%5B1991%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1424626039,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: eOne / Koch #KOCCD 8170\nCountry: USA\nYear: October 10, 2000\nGenre: Folk,americana\nFormat:CD\n\n01 The Way I Am\n02 In The Journey\n03 13 Step Boogie\n04 Beautiful Baby\n05 Things To Come\n06 13 Step (Reprise)\n07 My Faith Is Gone\n08 Silence Now\n09 Women And Wine\n10 So Long Suzanna\n\nMartin Sexton recorded In the Journey in a friend's attic in 1990, while he was making his living busking on the streets of Boston. He sold cassette copies out of his suitcase in remarkable volumes for a demo tape (half-a-decade later the album was finally released on CD, distributed in part by Sexton's new label, Eastern Front). The cassette's success should be no surprise to anyone who has heard him sing. The chief purpose of a demo tape is to show off the artist's talent, and Sexton enthusiastically embraces any opportunity to show off. Splitting the nine songs evenly between Bostonian contemporary folk and mostly acoustic blues and jazz, Sexton displays a vocal elasticity which would be amazing even if he weren't only 23-years-old. On &quot;Things to Come,&quot; he gives his rangy Stevie Wonder baritone a splash of reggae spice. On the title track (a freshly produced Toad the Wet Sprocket-like folk-pop tune) he starts off in a restrained impersonation of mumbly '90s rockers, then belts out the chorus with R&amp;B bravado. On &quot;Hard Times,&quot; he interrupts his soulful blues performance to do a dead-on impersonation of a wah-wah trumpet. On &quot;13 Step Reprise&quot; he becomes the whole band, imitating not only a Motown background chorus but also a full brass section. He even does character voices, playing a froggy-voiced old man on the well-written folk narrative &quot;The Way I Am.&quot; Sexton seems to be able to make his voice do anything he pleases without effort. The album is also very well produced by Sexton, despite the slightly schizophrenic division between the folk and the jazz. He mixes musical elements with creative assurance, incorporating mandolins, guitars, flutes, accordions, a variety of shuffling rhythms, and a plethora of vocal tracks","torrent":{"xt":"urn:btih:cc5c062514417b4afd5b4dff539868cdcc87bae0","amp;dn":"Martin+Sexton+-+In+the+Journey+%5B1991%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc5c062514417b4afd5b4dff539868cdcc87bae0","infoHashBuffer":{"type":"Buffer","data":[204,92,6,37,20,65,123,74,253,91,77,255,83,152,104,205,204,135,186,224]},"announce":[],"urlList":[]}}