{"title":"Blind Guides - Gail Riplinger","uid":11773641,"size":4418915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccd5651c9ee2c9fdc628bd4d3913ee919e2455cd&amp;dn=Blind+Guides+-+Gail+Riplinger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427179094,"description":"Gail Riplinger exposes the fundamentalist critics of the King James Bible, among them those who think the King James is &quot;the best&quot;, but not the perfect words of God.\n\nRiplinger's detailed and scholarly responses - unanswerable by skeptics like Hunt, Cloud, James White, Hanagraaff, House, Morey, Passantino, Robert Thomas of Master's Seminary and S.E. Schnaeter of Bob Jones University.\n\nThis 2013 Updated edition includes the new &quot;Cloud vs Wycliffe&quot; a 19 page scholarly response to David Cloud's latest barrage of fables about Wycliffe.\n\nCloud admitted in his magazine O Timothy that his review of Hazardous Materials was a phoney, written by someone playing a trick on him. He published it, pretending that he had written the review, but never having read the book himself. If he had read the book, he would have known that it had nothing to do with the contents of the Hazardous Materials. Boy, does he ever have egg on his face.\n\nIt also adds a 4 page update on the errors new version user Dave Hunt has made.\n\n\nAbout the author:\nGail Anne Riplinger (born 1947) is an American writer and speaker known for her support of the inerrancy of the King James Bible. Gail has BA., M .A., and M .F.A. degrees and has done additional postgraduate study at Harvard and Cornell Universities. As a university professor, the author taught seventeen different courses, authored six college textbooks and was selected for the Honor Society?s teaching award and membership in a national Education Honorary. The seventh textbook, New Age Bible Versions, was an international best seller and for it the author was honored with a Doctorate from the College of the nation?s largest church. The author is in several editions of Who's Who and was invited to be a","torrent":{"xt":"urn:btih:ccd5651c9ee2c9fdc628bd4d3913ee919e2455cd","amp;dn":"Blind+Guides+-+Gail+Riplinger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd5651c9ee2c9fdc628bd4d3913ee919e2455cd","infoHashBuffer":{"type":"Buffer","data":[204,213,101,28,158,226,201,253,198,40,189,77,57,19,238,145,158,36,85,205]},"announce":[],"urlList":[]}}