{"title":"009 - Coast to coast - Art Bell welcomed Robert Lanza 27 Mar 10.","uid":5471954,"size":122578916,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ce5deb460c7381949b6b73f63b1cfd50a12252e4&amp;dn=009+-+Coast+to+coast+-+Art+Bell+welcomed+Robert+Lanza+27+Mar+10.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1269938080,"description":"Consciousness &amp; the Universe\nDate:03-26-10\n\nHost:Art Bell\n\nGuests:Robert Lanza\n\nFilling in for George Noory, Art Bell welcomed renegade thinker and scientist, Robert Lanza, who discussed how life and consciousness are essential to the existence of our universe -- a controversial theory called &quot;biocentrism&quot;. Numerous experiments show that everything we see out there, every single particle, depends on the presence of an observer, he said.\n\nCiting the two-hole experiment, in which particles are beamed toward a barrier with double slits, Lanza pointed out that an observed particle acts as one would expect and goes through a single hole. When unobserved, however, the particle behaves like a wave and passes through multiple slits at the same time. Lanza suggested that our observations effect the world around us as well, and without conscious observers (in the form of biological life) there would be no universe at all.\n\nSpace and time are not external objects and do not exist independent of an observer's mind, he continued. Lanza likened time to a vinyl record on a turntable. All of the songs exist simultaneously even if you only experience them one at a time. He further proposed that the choices we make in our present can effect the past, noting the conclusions of a recently published experiment in which scientists retroactively changed a quantum event that had already happened.\n\nThis theory of time may dramatically alter our understanding of what we think are linear-based events, such the Big Bang. According to Lanza, without a consciousness there to observe it, the Big Bang exists only as a probability state. As an example, he referenced the work of late physicist John Wheeler, who advanced the notion that light from distant quasars only existed when it was observed.\n\nLanza also spoke briefly about human cloning and stem cell research.\n\nThe latter half of the program featured Open Lines.\nWebsite(s):\n# robertlanza.com\nBook(s):\n# Biocentrism\n","torrent":{"xt":"urn:btih:ce5deb460c7381949b6b73f63b1cfd50a12252e4","amp;dn":"009+-+Coast+to+coast+-+Art+Bell+welcomed+Robert+Lanza+27+Mar+10.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce5deb460c7381949b6b73f63b1cfd50a12252e4","infoHashBuffer":{"type":"Buffer","data":[206,93,235,70,12,115,129,148,155,107,115,246,59,28,253,80,161,34,82,228]},"announce":[],"urlList":[]}}