{"title":"Quarter to Midnight - Darcy Coates","uid":13479886,"size":361339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce8c01fee7d24fcde7b1ecbaa9267f46f9fbace8&amp;dn=Quarter+to+Midnight+-+Darcy+Coates&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1455051965,"description":"Slip into the realm of dead-eyed monsters, restless spirits and creeping shadows with this collection of fifteen horror stories.\r\n\r\n\r\nIncluded in this volume... \r\n\r\nCrypt: In 1965, a child went missing while he and his brother explored a disused cemetery. The brother insisted his death wasn't an accident, and that something dark and dangerous lurked inside the crypt. More than fifty years later, Sara faces the gates to the abandoned graveyard, determined to solve the decades-old mystery. \r\n\r\nWhose Woods These Are: A lot has changed about Morrow Woods since Anna's last visit. A fence has been constructed around it, the campers' parking lot is closed, and the trees are scarred with deep gashes, almost as though they'd been attacked... \r\n\r\nThe Mannequin: There's a mannequin hidden at the back of Mark's rented basement room, and it gives him the creeps. Sometimes it throws its dust cloth off. Sometimes he feels it watching him when his back is turned. And sometimes it moves while he's asleep. \r\n\r\nSub Basement: The Basement Run - retrieving files from the abandoned, lightless, decaying Sub Basement - is the most feared job in the office. Unfortunately for Matt, it's his turn. \r\n\r\nThe Watcher: Jasmine reluctantly accepted a dare to watch over a shadow-filled gully at midnight. Her job: to look for the bizarre creature that's rumoured to live in the woods. \r\n\r\nThe Mallory Haunting: A paranormal investigator is invited to explore the strange events occurring at a suburban home. \r\n\r\nCrawlspace: When Erica discovers a door hidden behind the wallpaper in her new bedroom, she assumes it's a small crawlspace. There's nothing unusual about it... except for the quiet tapping noise she can hear late at night. \r\n\r\nStation 331: Three women, working on a remote moon station, are conducting a routine patrol when they find an unidentifiable alien lifeform. Rather than calling for backup from their ward planet, they decide to deal with it themselves... with terrifying consequences. \r\n\r\nPlus seven other chilling stories: Lights Out, Mirror Man, Cutty Street Lamp, Dead Call, Lucy, Hitchhiker, and Mannering House","torrent":{"xt":"urn:btih:ce8c01fee7d24fcde7b1ecbaa9267f46f9fbace8","amp;dn":"Quarter+to+Midnight+-+Darcy+Coates","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce8c01fee7d24fcde7b1ecbaa9267f46f9fbace8","infoHashBuffer":{"type":"Buffer","data":[206,140,1,254,231,210,79,205,231,177,236,186,169,38,127,70,249,251,172,232]},"announce":[],"urlList":[]}}