{"title":"Stephen King - Dokter Sleep (Ebook)NLtoppers","uid":9221580,"size":1748233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfa26dd5f6504972c5ead52c41b078fb63d15a4c&amp;dn=Stephen+King+-+Dokter+Sleep+%28Ebook%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChickieChicken","files":-1,"time":1384947713,"description":"Samenvatting\n\nGrootmeester Stephen King keert terug naar de personages en de setting van een van zijn populairste thrillers ooit: De Shining.\n\nHet jongetje Danny Torrance is inmiddels Dan, een man van middelbare leeftijd die nog steeds wordt achtervolgd door de herinneringen aan het Overlook Hotel, waar hij in zijn jeugd een gruwelijke winter doorbracht. Decennialang heeft hij rondgezworven in een poging te ontsnappen aan zijn vaders erfenis van angst, alcoholisme en geweld. Uiteindelijk vestigt Dan zich in een klein stadje om zijn gave voor stervensbegeleiding te gebruiken... ze noemen hem Dr. Sleep.\n\n\nOver de snelwegen door Amerika trekt een groep mensen die zichzelf de Ware Knoop noemen. Ze zien er onschuldig uit - de meesten zijn oud en ze rijden rond in campers. Maar Dan Torrance weet wel beter, en ook de twaalfjarige Abra Stone komt tot de bizarre ontdekking dat de leden van de Ware Knoop schijnbaar onsterfelijk zijn. Ze leven van de energie die vrijkomt als kinderen die de Shining, oftewel 'het licht' bezitten, langzaam sterven. Abra en haar spectaculaire gave - het helderste licht ooit - wekken Dans demonen weer tot leven en hij moet vechten voor Abra's ziel en zijn eigen voortbestaan.\n\n\nVeel leesplezier en please keep seeding. \n\n\nLees ook aub het documentje over de hulpactie voor Tacloban. \n\n\nGroetjes Chickcie\n\n\n","torrent":{"xt":"urn:btih:cfa26dd5f6504972c5ead52c41b078fb63d15a4c","amp;dn":"Stephen+King+-+Dokter+Sleep+%28Ebook%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfa26dd5f6504972c5ead52c41b078fb63d15a4c","infoHashBuffer":{"type":"Buffer","data":[207,162,109,213,246,80,73,114,197,234,213,44,65,176,120,251,99,209,90,76]},"announce":[],"urlList":[]}}