{"title":"Mark Hollis - 1998 - Mark Hollis (former singer of Talk Talk)","uid":6053328,"size":252011672,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cfc752059530910dec33dee832f697b7551327bc&amp;dn=Mark+Hollis+-+1998+-+Mark+Hollis+%28former+singer+of+Talk+Talk%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonesomecowboy","files":-1,"time":1292809628,"description":"A celebration of silence!\nWhere once Talk Talk's metamorphosis took shape (&quot;Spirit of Eden&quot; and more even &quot;Laughing Stock&quot;), Mark Hollis on his first solo album consequently pushes the boundaries further - sometimes up to a hardly bearable extent.\nA great piece of art - only if you are open minded and searching for a deeper sense of musical expression.\n\n--------------------\n&quot;Achingly gorgeous and hauntingly stark, Mark Hollis' self-titled debut picks up where he left off with Talk Talk's Laughing Stock seven years earlier, re-emerging at the nexus point where jazz, ambient, and folk music collide. It's quite possibly the most quiet and intimate record ever made, each song cut to the bone for maximum emotional impact and every note carrying enormous meaning. Hollis paints his music in fine, exquisite strokes, with an uncanny mastery of atmosphere that's frequently devastating. And if anything, his singularly resonant voice has grown even more plaintive with the passage of time, which -- combined with the understated artistry and minimalist beauty of tracks like &quot;The Colour of Spring&quot; and &quot;Watershed&quot; -- makes Mark Hollis a truly unique and indelible listening experience. His obvious understanding of the power of silence aside, one prays he doesn't again wait for the seven-year itch to strike before returning.&quot;  &lt;a href=&quot;\nhttp://www.allmusic.com/album/r342295&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/r342295&lt;/a&gt;\n--------------------\n\n--------------------\n&quot;...the solitude of this album is one of abandonment rather than liberation. It traffics in silences and painful proximity: the instruments are so intimately recorded that their flaws and weaknesses create much of the musical texture; the very mechanics of instrumentation seem to serve where the instruments themselves falter: the honk and spent air of the woodwinds, the scratching on worn guitar strings, the limits of Hollis' vocals. And the silences that seems to threaten the life of every song are poised as failures: the instruments or the voice or even the prosody of the lyrics simply give way into slight moments of emptiness. The refrain of &quot;Watershed&quot; seems a regretful admission of (and half- hearted apology for) all those inevitable silences.\nOn the whole, Hollis' lyrics read like Symbolist poetry: presented without syntactical scaffolding, or simply as unpredicated images, or fragments of passed conversation. The music runs from loping elegaic jazz to stark Nick Drake-ish folk and even to ambient passages reminiscent of Eno's aimless piano on Music for Airports. In short, Mark Hollis conjures the great emptiness and futility which it undoubtedly inherits from the life of its maker.&quot;\n-Brent S. Sirota &lt;a href=&quot;\nhttp://web.archive.org/web/20080603120657/http://www.pitchforkmedia.com/article/record_review/18534-mark-hollis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://web.archive.org/web/20080603120657/http://www.pitchforkmedia.com/article/record_review/18534-mark-hollis&lt;/a&gt;\n--------------------\n\nmore infos at: &lt;a href=&quot;\nhttp://www.progarchives.com/artist.asp?id=3284&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.progarchives.com/artist.asp?id=3284&lt;/a&gt;","torrent":{"xt":"urn:btih:cfc752059530910dec33dee832f697b7551327bc","amp;dn":"Mark+Hollis+-+1998+-+Mark+Hollis+%28former+singer+of+Talk+Talk%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc752059530910dec33dee832f697b7551327bc","infoHashBuffer":{"type":"Buffer","data":[207,199,82,5,149,48,145,13,236,51,222,232,50,246,151,183,85,19,39,188]},"announce":[],"urlList":[]}}