{"title":"The Forts of Colonial North America: British, Dutch and Swedish","uid":11767248,"size":28284677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d13e94ce7ce4412ded87c27923d620ecf1bf021d&amp;dn=The+Forts+of+Colonial+North+America%3A+British%2C+Dutch+and+Swedish+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426894650,"description":"The second in a two-volume study of forts in colonial North America, this title offers a detailed look at various types of fortifications built between the times of the earliest British settlements in North America in the late 16th century until the end of the Seven Years War, when France ceded New France to Britain. With photographs of these sites as they are today, specially-commissioned artwork depicting the forts in their original uses and detailed maps, author Rene Chartrand also provides readers a valuable look back at early American colonial life. Altogether, a comprehensive, detailed look into an important aspect of American history, and one that is still visible across the landscape today.\n\nForts included:\n\nRoanoke Island: fours forts built by the colonists of North Carolina, 1585-90\nJamestown: he first permanent settlements built by colonists, starting in 1607\nEarly British fortifications in New England, Nova Scotia, and along the coast\nEarly Dutch fortifications in what is now New York, Connecticut and New Jersey\nSwedish fortifications in Delaware, 1638-55\nForts in Newfoundland and the Hudson Bay area, built by the French but ceded to Britain\nCastle William, Boston\nFort Oswego, Lake Ontario\nFrontier forts along the Ohio River and Lake George\nFort Pitt and Crown point, built to secure British-American conquests","torrent":{"xt":"urn:btih:d13e94ce7ce4412ded87c27923d620ecf1bf021d","amp;dn":"The+Forts+of+Colonial+North+America%3A+British%2C+Dutch+and+Swedish+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13e94ce7ce4412ded87c27923d620ecf1bf021d","infoHashBuffer":{"type":"Buffer","data":[209,62,148,206,124,228,65,45,237,135,194,121,35,214,32,236,241,191,2,29]},"announce":[],"urlList":[]}}