{"title":"The Secrets of CEOs - Pdf - Yeal","uid":9367247,"size":1895965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d144ceb40af1fc17e8471f91e25719b76f399279&amp;dn=The+Secrets+of+CEOs+-+Pdf+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KhushSidhu","files":1,"time":1387412530,"description":"\n\nThe Secrets of CEOs - 150 Global Chief Executives Lift the Lid on Business, Life and Leadership\n\nBy Steve Tappin &amp; Andrew Cave\n\n256 pages - Publisher: Nicholas Brealey Publishing\nYear - 2008 - Language: English - Pdf \nISBN-10: 1857885139 - ISBN-13: 978-1857885132\n\nWith unprecedented access to some of the world's most high profile executives, The Secrets of CEOs: 150 Global Chief Executives Lift the Lid on Business, Life and Leadership tells us what life is really like at the top and how to cope with the pressures of top-flight business, both professionally and personally. The book features in-depth interviews with some of the West's most influential CEOs, such as Sir Martin Sorrell (WPP Group), Mike Burner (BAE Systems), Ben Verwaayen (BT Group), and Sir Terry Leahy (Tesco), as well as emerging market CEOs like Narayana Murthy (Infosys) and Alexei Mordashov (Severstad). Authors Steve Tappin and Andrew Cave reveal the issues that really affect CEOs, from globalization to the rise of sovereign wealth funds in capital markets to necessary compromises in the work-life balance. They explore the key initiatives these influential executives have used to fundamentally reshape their businesses and the ways that they develop talent. Tappin and Cave provide a radical view of future corporate leadership and the qualities that leaders will be required to have as well as practical advice for the aspiring 21st century super leader.","torrent":{"xt":"urn:btih:d144ceb40af1fc17e8471f91e25719b76f399279","amp;dn":"The+Secrets+of+CEOs+-+Pdf+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d144ceb40af1fc17e8471f91e25719b76f399279","infoHashBuffer":{"type":"Buffer","data":[209,68,206,180,10,241,252,23,232,71,31,145,226,87,25,183,111,57,146,121]},"announce":[],"urlList":[]}}