{"title":"Manny Tuttofare S02 E01~10 [SAT-Rip ~ ITA] [NavarTek.org]","uid":5346254,"size":1416134656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1735158a9954285cab68385e6981687e2ad5870&amp;dn=Manny+Tuttofare+S02+E01%7E10+%5BSAT-Rip+%7E+ITA%5D+%5BNavarTek.org%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Colombo-bt","files":-1,"time":1265648852,"description":"********************************************************\n\nMANNY TUTTOFARE - STAGIONE 2 - EPISODI 01-10 (PACK01/05)\n                    [SATRip ~ ITA]\n\n                    www.navartek.org\n\n********************************************************\n\n\nTitolo Originale: Handy Manny - Season Two\nTitolo: Manny Tuttofare - Stagione 2\nGenere: Animazione\nLingua Originale: Inglese\nAnno: 2006\nLingua: Italiano\nEpisodi: 46\nDurata: 23 minuti (doppi episodi)\nRisoluzione: 592x448\nCompressione video: Xvid\nCompressione audio: Mp3 ~ 160kbs\n\nRegia: Ted Bastien, Sue Blue\nAutori: Roger Bollen, Marilyn Sadler, Rick Gitelson\nProduzione: Disney\nTrasmesso da: Playhouse Disney, Rai2\n\t  \t\n\n*********************************************************\n\nManny Tuttofare (Handy Manny nell'originale inglese) ÃƒÂ¨ la serie di animazione in 3d rivolta ai bambini di etÃƒÂ  prescolare, che ha fatto il suo esordio nel 2006 all'interno del programma Playhouse Disney su Disney Channel. Il protagonista principale ÃƒÂ¨ il giovane Manny, un piccolo imprenditore che insieme ai suoi attrezzi animati e parlanti, ÃƒÂ¨ sempre pronto a risolvere qualsiasi problema tecnico: riparare mensole, aggiustare semafori, fissare pali e tanto altro. La serie ÃƒÂ¨ stata ideata da Roger Bollen, Marilyn Sadler, Emmy Award e prodotta da Rick Gitelson. Le animazioni sono state affidate agli studi canadesi della Nelvana. Manny di fronte a qualsiasi problema ÃƒÂ¨ sempre ottimista e confida nel suo ingegno e nella affidabilitÃƒÂ  dei suoi attrezzi. Fra questi troviamo Dente, la sega sempre pronta a tagliare l'impossibile. Philip ÃƒÂ¨ il cacciavite a croce di colore giallo, che parla sempre a sproposito e sogna di diventare un grande regista. Pim ÃƒÂ¨ un martello insicuro e un pÃƒÂ² imbranato, visto come un pericolo da parte degli altri attrezzi, ma per fortuna Manny crede nelle sue grandi capacitÃƒÂ . Becco ÃƒÂ¨ una chiave a pappagallo che si crea problemi inutili, non credendo molto nelle sue potenzialitÃƒÂ  in quanto ÃƒÂ¨ molto ansioso. Strizza ÃƒÂ¨ invece una piccola pinza, molto utile quando bisogna stringere qualche vite. Scatto ÃƒÂ¨ un metro estensibile molto pignolo, Manny ricorre sempre a lei quando bisogna prendere le misure prima di eseguire un lavoro. Infine troviamo Vito, un cacciavite a taglio dal manico blu, un pÃƒÂ² geloso di Philip, che pensa di sapere tutto in quanto ÃƒÂ¨ il piÃƒÂ¹ anziano del gruppo.\n\nQuando viene trovata la soluzione del problema da parte di Manny, il gruppo degli attrezzi inizia a lavorare, cantando una simpatica canzoncina &quot;Aggiustiamolo tutti dai, avvitalo, stringi dai, let's work togheter now, lavora insieme a noi. Taglia, calcola, battilo, sforzalo, serralo, qui ciascuno ha il suo compito e lavorano, all togheter aggiustiamo noi!&quot;. Il messaggio ÃƒÂ¨ quello che soltanto con un lavoro di squadra, dove vengono esaltate le capacitÃƒÂ  dei singoli, si possono risolvere i problemi. Fra i vari personaggi troviamo il signor Lopart, che possiede un negozio di dolci al lato del laboratorio di Manny. Lopart ÃƒÂ¨ un pÃƒÂ² imbranato, sempre pronto a cacciarsi nei guai quando deve salire in qualche scala o trasportare pacchi, nonostante i buoni consigli di Manny. C'ÃƒÂ¨ anche l'adorabile Kelly, la ragazza della ferramente, che ha sempre tutto il necessario per i lavori di Manny, anche l'impensabile.\n\nIl linguaggio utilizzato durante tutto il cartone ÃƒÂ¨ principalmente l'italiano, ma la finalitÃƒÂ  didattica del prodotto fa in modo che i dialoghi dei personaggi siano frequentemente conditi da termini inglesi con l'intendo di rendere intuitive le parole nella lingua straniera (nell'edizione originale il linguaggio ÃƒÂ¨ inglese con parole in spagnolo). Ad esempio potrebbe capitare spesso di ascoltare una frase come &quot;Becco, apri la door&quot;. Per i termini meno conosciuti, comunque, i personaggi danno sempre la giusta spiegazione. \n\n********************************************************************************\n\nvideo details in previous releases / Dettagli video nelle precedenti release.\n\n********************************************************************************\n\nPrevious season / Stagione precendente:\n &lt;a href=&quot;\nhttp://thepiratebay.se/search/manny%20tuttofare%20navartek/0/8/0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/search/manny%20tuttofare%20navartek/0/8/0&lt;/a&gt;","torrent":{"xt":"urn:btih:d1735158a9954285cab68385e6981687e2ad5870","amp;dn":"Manny+Tuttofare+S02+E01%7E10+%5BSAT-Rip+%7E+ITA%5D+%5BNavarTek.org%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1735158a9954285cab68385e6981687e2ad5870","infoHashBuffer":{"type":"Buffer","data":[209,115,81,88,169,149,66,133,202,182,131,133,230,152,22,135,226,173,88,112]},"announce":[],"urlList":[]}}