{"title":"American_Top_40_1972_August_12th","uid":10761677,"size":349754010,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d1b7f694e8579ffbec5452e1f0a211081b5bfe66&amp;dn=American_Top_40_1972_August_12th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1407982468,"description":"&quot;You're listening to American Top 40, the most authoritative survey of the best sellers from Bangor to Burbank, and the countdown rolls on.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nDebuting on the chart is the current hit by a superstar of stage, screen, and record, but Casey tells how she turned down for a New York apartment because the other tenants didn't see her as the &quot;right sort of person.&quot;\n\nThere is a song that got it's melody from a well-known commercial. Casey reminds that it already happened twice before in 1972 with &quot;We've Only Just Begun&quot; by the Carpenters and &quot;I'd Like To Teach The World To Sing&quot; by the Hillside Singers. &quot;I'd Like To Teach The World To Sing&quot; became a Coca-cola commercial and was so annoying that you promised yourself you'd sell your TV set to get away from it every time it came on. It was on very channel - all the time! (I know there were only 3) But when you saw the record at the store, you bought it in defiance of the oppressive Coke overlords who had been torturing you with it. New Coke would someday boldly-go down this already beaten-path of rejection.\n\nA listener has heard about records have a million dollars in advance sales, and asks Casey what that means. He says it means A million in advance sales before the record has been released, and tells about the biggest advance ever for $2,100,000.\n\nMac Davis is at number 27 with, &quot;Baby Don't Get Hooked On Me.&quot; Casey says that Mac used the name of his baby son to in order to avoid being confused with another famous singer. He had plenty of hits cover Elvis, Kenny Rogers and the First Edition, and Bobby Goldsboro.\n\n&quot;The Sounds Of Silence&quot; by Simon and Garfunkle, was the biggest dropping number one record there ever was. It went from the top spot to number 12 one week in 1966. Casey says the second biggest dropper fell to number nine just a few weeks ago right before he plays it as part of this countdown.\n\nThe segment 4 extra announced by Casey was taken from the September 9th, 1972 broadcast (and you can get that one right now because I have operators are standing by). That's when Casey told the story of Arlo Guthrie, &quot; . . .an ex-convict whose trouble with the law kept him out of the draft, and gave him a hit record album which was made into a major motion picture, in which he starred.&quot;\n\nWell, that gets us all ready to hear &quot;Alice's Restaurant (Massacree)&quot; but instead we get &quot;City Of New Orleans.&quot; So I put in the ever-classic &quot;Alice's Restaurant (Massacree)&quot; as a RocketMan Extra. This is what Guthrie said Nixon was listening to during the famous 18Â½ minute gap in the Watergate tapes when he was told Nixon owned copy.\n\n40: Saturday In The Park - Chicago\n39: Sweet Inspiration/Where You Lead - Barbra Streisand\n38: Take It Easy - The Eagles\n37: Backstabbers - OJ's\n36: Outta Space - Billy Preston\n35: Rocket Man - Elton John\n34: Conquistador - Procol Harum\n33: When You Say Love - Sonny &amp; Cher\n32: Small Beginings - Flash\n31: Beautiful Sunday - Daniel Boone\n30: Baby Let Me Take You In My Arms - Detroit Emeralds\n29: Breaking Up Is Hard To Do - The Partridge Family\n28: Join Together - The Who\n27: Baby Don't Get Hooked On Me - Mac Davis\n26: Guitar Man - Bread\n25: Rock &amp; Roll Part #2 - Gary Glitter\n24: Gone - Joey Heatherton\n23: Happy - The Rolling Stones\n22: Looking Through The Window - Jackson Five\n21: Sealed With A Kiss - Bobby Vinton\n20: Motorcycle Mama - Sailcat\n19: Day By Day - &quot;Godspell&quot; The Soundtrack\n18: Hold Your Head Up - Argent\n17: You Don't Mess Around With Jim - Jim Croce\n16: Layla - Derek &amp; The Dominos\n15: Lean On Me - Bill Withers\n14: Hold Her Tight - The Osmonds\n13: The Happiest Girl In The Whole U.S.A. - Donna Fargo\n12: Goodbye To Love - The Carpenters\n11: Coconut - Nilsson\n10: School's Out - Alice Cooper\n9: How Do You Do - Mouth &amp; McNeal\n8: Too Late To Turn Back Now - Cornelius Brothers &amp; Sister Rose\n7: I'm Still In Love With You - Al Green\n6: Long Cool Woman In A Black Dress - Hollies\n5: Where Is The Love - Roberta Flack &amp; Donny Hathaway\n4: Daddy Don't You Walk So Fast - Wayne Newton\n3: If Loving You Is Wrong, I Don't Want To Be Right - Luther Ingram\n2: Brandy - Looking Glass\n1: Alone Again, Naturally - Gilbert O' Sullivan","torrent":{"xt":"urn:btih:d1b7f694e8579ffbec5452e1f0a211081b5bfe66","amp;dn":"American_Top_40_1972_August_12th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b7f694e8579ffbec5452e1f0a211081b5bfe66","infoHashBuffer":{"type":"Buffer","data":[209,183,246,148,232,87,159,251,236,84,82,225,240,162,17,8,27,91,254,102]},"announce":[],"urlList":[]}}