{"title":"Steve Earle &amp; Del McCoury Band - The Mountain (1999) [FLAC]","uid":4595151,"size":297331988,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d1d4ac48d5468563a20be3fc06dd30624a0aa7ce&amp;dn=Steve+Earle+%26+Del+McCoury+Band+-+The+Mountain+%281999%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"storoa","files":16,"time":1229978625,"description":"Review\tby Michael B. Smith\n\nOn The Mountain, Steve Earle has teamed up with one of the very finest bluegrass ensembles around, the Del McCoury Band. All 14 of the songs here were written by Earle, who confesses in the liner notes that his dream is to create a timeless bluegrass classic that will live on like Bill Monroe's &quot;Uncle Pen.&quot; Well, he might very well have attained his dream. Each of the songs on The Mountain holds its own particular charm, and there isn't a loser in the bunch. &quot;Carrie Brown&quot; could have come from the very pen of &quot;the father of bluegrass&quot; himself, Monroe, and &quot;Connemara Breakdown&quot; has plenty enough fury to carve its own niche in the bluegrass tree. Outstanding performances from talented artists abound: there are the vocals of Emmylou Harris and Iris DeMent, the Dobro of Jerry Douglas and Gene Wooten, some smoking Sam Bush mandolin, and the fiddle fire of Stuart Duncan, all wrapped around these instant classics and played straight from the heart. Marty Stuart, Gillian Welch, and John Hartford all drop in to embellish the sound as well. Anyone who saw Earle perform with the McCoury Band was anxiously awaiting a CD, and with The Mountain, the wait is over. The smooth strains of &quot;Pilgrim,&quot; with its unparalleled roster of guest artists, fills the room, and everything in the world seems just a little bit happier. Steve Earle has truly gone to the mountain and had his vision quest answered in the unmistakable tones of a Dobro, a banjo, and a guitar. Some good ol' American music, right from the peak of the mountain. ","torrent":{"xt":"urn:btih:d1d4ac48d5468563a20be3fc06dd30624a0aa7ce","amp;dn":"Steve+Earle+%26+Del+McCoury+Band+-+The+Mountain+%281999%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d4ac48d5468563a20be3fc06dd30624a0aa7ce","infoHashBuffer":{"type":"Buffer","data":[209,212,172,72,213,70,133,99,162,11,227,252,6,221,48,98,74,10,167,206]},"announce":[],"urlList":[]}}