{"title":"J.R.R. Tolkien - Beowulf: A Translation and Commentary","uid":10214605,"size":1319648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3683cd7e29fd4005b0d0c67ba582b1103206510&amp;dn=J.R.R.+Tolkien+-+Beowulf%3A+A+Translation+and+Commentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1400948530,"description":"\nJ.R.R. Tolkien - Beowulf: A Translation and Commentary (HarperCollins, 2014).  Edited by Christopher Tolkien.\n\nISBN: 9780544442788 | 448 pages | ePUB/MOBI\n\n\nThe translation of Beowulf by J.R.R. Tolkien was an early work, very distinctive in its mode, completed in 1926: he returned to it later to make hasty corrections, but seems never to have considered its publication.  This edition edited by his son, Christopher Tolkien, is twofold, for there exists an illuminating commentary on the text of the poem by the translator himself, in the written form of a series of lectures given at Oxford in the 1930s; and from these lectures a substantial selection has been made, to form also a commentary on the translation in this book.\n\nFrom his creative attention to detail in these lectures there arises a sense of the immediacy and clarity of his vision. It is as if he entered into the imagined past: standing beside Beowulf and his men shaking out their mail-shirts as they beached their ship on the coast of Denmark, listening to the rising anger of Beowulf at the taunting of Unferth, or looking up in amazement at Grendel's terrible hand set under the roof of Heorot.\n\nAlso included in this volume is &quot;Sellic Spell&quot;, a story written by Tolkien suggesting what might have been the form and style of an Old English folk-tale of Beowulf, in which there was no association with the &quot;historical legends&quot; of the Northern kingdoms.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                       &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:d3683cd7e29fd4005b0d0c67ba582b1103206510","amp;dn":"J.R.R.+Tolkien+-+Beowulf%3A+A+Translation+and+Commentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3683cd7e29fd4005b0d0c67ba582b1103206510","infoHashBuffer":{"type":"Buffer","data":[211,104,60,215,226,159,212,0,91,13,12,103,186,88,43,17,3,32,101,16]},"announce":[],"urlList":[]}}