{"title":"Kenji Mizoguchi - Naniwa erejÃƒÂ® aka Osaka Elegy (1936)","uid":4844753,"size":733254247,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d405a34ca1af40fbcb3e0d8855e7bdbb68db6820&amp;dn=Kenji+Mizoguchi+-+Naniwa+erej%C3%83%C2%AE+aka+Osaka+Elegy+%281936%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lllTgolll","files":4,"time":1239638251,"description":"Sonosuke Asai (Benkei Shiganoya), the manager of a pharmaceutical company, begins each morning with a familiar ritual: selfishly praying for &quot;wealth and health&quot;; harshly berating the servants; complaining of his wife's (Yoko Umemura) untraditional behavior. Yet, having married into prominence and career, he is unable to censure her conduct, and is compelled to submit to her authority. Frustrated by his loveless and subservient home life, Asai has turned his attention towards a young, attractive telephone switchboard operator named Ayako (Isuzu Yamada). Ayako's father, a cowering, yet boastful office worker named Junzo Murai (Seiichi Takegawa) has embezzled money from his employer in a failed attempt at stock trading. Unable to return the missing funds, Murai has been evading company officials who have threatened legal action for the theft. Despite Ayako's developing feelings for a meek, devoted clerk named Nishimura (Kensaku Hara), she moves out of the family home, leaves her job, and reluctantly agrees to become Asai's mistress in exchange for settling her father's financial transgression. However, as Asai's wife becomes increasingly suspicious of her husband's extramarital affair, Asai is compelled to sever his relations with Ayako. Abandoned by her benefactor, unwilling to return home, and faced with incessant pleas for financial assistance for her brother, Hiroshi's (Shinpachiro Asaka) college tuition, Ayako turns to the streets.\n\nKenji Mizoguchi presents a poignant and caustic tale of obedience, duty, and the inequity of a patriarchal society in Osaka Elegy. Similar to Robert Bresson's A Gentle Woman and L'Argent, the repeated imagery of transactions reflects the devaluation of moral dignity, as money becomes a convenient surrogate for human interaction: Asai's marriage arose from economic and social gain; Mrs. Asai imposes herself on Asai's subordinate, Nishimura, by handing him theater tickets; Murai defends his parental skills by citing his payment for his children's education; Ayako accepts Asai's proposition in exchange for clearing her father's debts. Ironically, as Ayako attempts to follow cultural tradition by assuming responsibility for familial obligations, she is stigmatized as a shameless, delinquent moga (modern girl). In the end, Ayako's search for independence and happiness proves to be elusive ideals in the impersonal commerce of human emotion.\n\n\nIMDB:http://www.imdb.com/title/tt0028021/\nRELEASE:WRD\nSize: 699 MB (or 715,926 KB or 733,108,224 bytes)\nCodec: Xvid\nContainer: avi\nAudio: MP3, Monophonic, 93kb/s\nPicture: 576x432\nRunning time: 72 min.\nKbps: 1248\nFrames/s: 23.9\n\nSUBTITLES SOFTS ENGLISH ,PT-BR E SPANISH (SRT)\n\n*********************************** FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:d405a34ca1af40fbcb3e0d8855e7bdbb68db6820","amp;dn":"Kenji+Mizoguchi+-+Naniwa+erej%C3%83%C2%AE+aka+Osaka+Elegy+%281936%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d405a34ca1af40fbcb3e0d8855e7bdbb68db6820","infoHashBuffer":{"type":"Buffer","data":[212,5,163,76,161,175,64,251,203,62,13,136,85,231,189,187,104,219,104,32]},"announce":[],"urlList":[]}}