{"title":"HISTORY OF POP AND ROCK MUSIC - part 543","uid":9439185,"size":709102969,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d4416bdb0e43e920d6808e492ea74af839c14b30&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+543&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1388966425,"description":"\n\n                    PART  543\n\n\n\n            BLACK SABBATH  - Iron Man  (1970) \n            URIAH HEEP -  Easy livin'  (1972)\n            LED ZEPPELIN  -  Black Dog  (1973) \n            LED ZEPPELIN  -  Since I've Been Loving You (1973) \n\n\n              &quot;Iron Man&quot; is a song by Black Sabbath. It is taken from their second studio album &quot;Paranoid&quot; released in 1970. It was later included on their initial greatest hits compilation &quot;We Sold Our Soul for Rock 'n' Roll&quot; (1976), as well as all subsequent greatest hits compilations. The song peaked at number 52 on The Billboard Hot 100 in 1972 , but the song returned to the charts in 2008 peaking at number 5 on Billboard's Hot Ringtones chart.  The song won spot number 317 in Rolling Stone's list of the 500 Greatest Songs of All Time. In 2000, almost 30 years after the original studio version was released, a live version of the song won the Grammy Award for Best Metal Performance.The song was awarded the number 1 spot on VH1's 40 Greatest Metal Songs in 2006\n           \n              &quot;Easy Livin'&quot; is a song by Uriah Heep, released as the second single from their 1972 album &quot;Demons and Wizards&quot;.The band has also shot a basic music video for the song in 1972.It was the band's only hit in the United States, peaking at #39 on the Billboard Hot 100 in September 1972.  Easy Livin'&quot; did not reach their home country singles charts but was a big success in Germany it took place at #15, The song's greatest success came in the Netherlands, where it reached #5 on the singles chart. In Scandinavia it took place at #17, in France at #35, and disappointing #75 in Australia. The single also peaked at No. 25 in Canada .And along with &quot;The Wizard&quot; helped the band to broke to fame and gave them high popularity in many countries. The song is very dynamic and fast but in fact Mick Box uses only five chords to play it and that chords are Dm,F,G,Am and Bm.The chords Dm,F and G are always being played in the first parts and as an intro too.The song has three verses and also three choruses in the beginning there is an intro and in the finishing there is an outro. The song has been included in many of live concerts of Uriah Heep as it has been released it has been first played live in 1973. It also has been included to many of Uriah Heep live albums. The song is Uriah Heep's second most covered song behind &quot;Lady in Black&quot;.\n\n             &quot;Black Dog&quot; is a song by Led Zeppelin, the opening track on their fourth album (1971). It was released as a single in the U.S.A and in Australia with &quot;Misty Mountain Hop&quot; as the B-side, reaching #15 on Billboard and #11 in Australia. In 2010, the song was ranked #300 on Rolling Stone's list of the 500 Greatest Songs of All Time. Music sociologist Deena Weinstein calls &quot;Black Dog&quot; &quot;one of the most instantly recognisable Led Zeppelin tracks&quot;.&quot;Black Dog&quot; became a staple and fan favourite of Led Zeppelin's live concert performances.\n\n             &quot;Since I've Been Loving You&quot; is a song by Led Zeppelin, released on the 1970 album Led Zeppelin III. As an improvisational showcase for all four group members, and especially for Jimmy Page's electric blues guitar solos, &quot;Since I've Been Loving You&quot; became a staple and fan favourite of Led Zeppelin's live concert performances from 1970 until the end of their ninth American tour in summer 1973.\n","torrent":{"xt":"urn:btih:d4416bdb0e43e920d6808e492ea74af839c14b30","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+543","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4416bdb0e43e920d6808e492ea74af839c14b30","infoHashBuffer":{"type":"Buffer","data":[212,65,107,219,14,67,233,32,214,128,142,73,46,167,74,248,57,193,75,48]},"announce":[],"urlList":[]}}