{"title":"Play: How it Shapes the Brain","uid":8072915,"size":833410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4bb64dd2a1cafe8a1942f66362877cc2a5589ea&amp;dn=Play%3A+How+it+Shapes+the+Brain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1359314667,"description":"\nStuart Brown, Christopher Vaughan, &quot;Play: How it Shapes the Brain, Opens the Imagination, and Invigorates the Soul&quot;\n2010 | ISBN: 1583333789 | EPUB | 240 pages | 0,8 MB\n\nFrom a leading expert, a groundbreaking book on the science of play, and its essential role in fueling our happiness and intelligence throughout our lives\n\nWe've all seen the happiness on the face of a child while playing in the school yard. Or the blissful abandon of a golden retriever racing across a lawn. This is the joy of play. By definition, play is purposeless, all-consuming, and fun. But as Dr. Stuart Brown illustrates, play is anything but trivial. It is a biological drive as integral to our health as sleep or nutrition. We are designed by nature to flourish through play.\n\nDr. Brown has spent his career studying animal behavior and conducting more than six-thousand &quot;play histories&quot; of humans from all walks of life-from serial murderers to Nobel Prize winners. Backed by the latest research, Play (20,000 copies in print) explains why play is essential to our social skills, adaptability, intelligence, creativity, ability to problem solve and more. Particularly in tough times, we need to play more than ever, as it's the very means by which we prepare for the unexpected, search out new solutions, and remain optimistic. A fascinating blend of cutting-edge neuroscience, biology, psychology, social science, and inspiring human stories of the transformative power of play, this book proves why play just might be the most important work we can ever do. ","torrent":{"xt":"urn:btih:d4bb64dd2a1cafe8a1942f66362877cc2a5589ea","amp;dn":"Play%3A+How+it+Shapes+the+Brain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4bb64dd2a1cafe8a1942f66362877cc2a5589ea","infoHashBuffer":{"type":"Buffer","data":[212,187,100,221,42,28,175,232,161,148,47,102,54,40,119,204,42,85,137,234]},"announce":[],"urlList":[]}}