{"title":"End of the Road (VHS) [1970] Aram Avakian","uid":6554577,"size":2208083179,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4ced7361a33dc7da1dd4c5c4fe94aba10a936fb&amp;dn=End+of+the+Road+%28VHS%29+%5B1970%5D+Aram+Avakian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1311232117,"description":" &lt;a href=&quot;http://bayimg.com/lAjjIaaDD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lAjjIaaDD&lt;/a&gt;\n\nEnd of the Road (1970) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0065692/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0065692/&lt;/a&gt;\n\nDOWNLOADED FROM CINEMAGEDDON.NET\n\nEnd of the Road is a 1970 film directed by Aram Avakian. It stars Stacy Keach and Harris Yulin. It was rated X for an abortion scene. It won an award at the 1970 Locarno International Film Festival.[1] A nine-page Life Magazine article was published on Aram Avakian and End of the Road on November 7, 1969. Avakian was also interviewed at length in Playboy and Esquire. End of the Road is an early indie picture which bucked Hollywood conventions and was before its time. Many of the cast and crew went on to distinguished careers. The film gained a cult following at art movie houses across the U.S., where audiences would speak aloud the lines while they watched the midnight screenings. It will soon to be released again by Warner Brothers, on Bluray, as part of a series of re-discovered cinematic treasures.\n\n  Stacy Keach  ...  Jacob Horner  \n  Harris Yulin  ...  Joe Morgan  \n  Dorothy Tristan  ...  Rennie Morgan  \n  James Earl Jones  ...  Doctor D  \n  Grayson Hall  ...  Peggy Rankin  \n  Ray Brock  ...  Sniperman / Mrs. Dockey  \n  John Pleshette  ...  Finkle  \n  Gail Gilmore  ...  Miss Gibson (as Gail Gibson)  \n  Maeve McGuire  ...  Receptionist  \n  Norman Simpson  ...  Dr. Schott  \n  Graham Jarvis  ...  Dr. Carter  \n  June Hutchinson  ...  Miss Banning / Tea Lady  \n  Joel Oppenheimer  ...  Chicken Man  \n  James Coco  ...  School Man  \n  Oliver Clark  ...  Dog Man  \n\nIn the same year that screenwriter and novelist, Terry Southern, was putting the finishing touches on a script called Easy Rider, he was also at work on a far more personal and experimental project. Written and shot in 1968, End of The Road is a great lost film of the period. \n\nDismissed by critics during its brief New York run in January, 1970, End of The Road was burdened with an X rating due to a harrowing abortion sequence. Allied Artists, the film's distributor, didn't go to bat for it and as a result, the film never got the kind of promotion Easy Rider and Midnight Cowboy enjoyed. Perhaps it wouldn't have helped much anyway since End of The Road is an uncompromising study of alienation and political despair. Its director, Aram Avakian, came closer to emulating the Brechtian outrage of Jean Luc Godard than any other American director of the time surpassing in many respects the work of Stanley Kubrick and Arthur Penn.\n\nOne day Jake Horner gets his graduate degree, walks away from the graduation ceremony, stands on a train platform and goes into a catatonic state while watching the trains pass by, one after another. \n\nChildren try to make him smile and dogs sniff at him, but his mind is far away in a world of flashbacks. Hitler. Mussolini. Hiroshima. Nagasaki. Speeding up now, the images blurring because they come so fast: Vietnam, the assassination of the Kennedy brothers and Dr. Martin Luther King Jr. Images of war and death. Images and events, it is suggested, that have combined to paralyze Jake Horner and make him incapable of the rational scholarship he's been trained for.\n\nIt's become fashionable these days to throw in a few shots of Vietnam or something, to make your movie feel serious. But in this long and thoughtful prolog to the main events of End of the Road, Aram Avakian makes his montage work where so often they fail. Before he can tell his story of Jake Horner, he's got to establish the absolute impossibility that Jake's academic hardware could change anything. This way, he's telling us, lies intellectual impotence.\n\nThe story that follows is from the John Barth novel, loosely translated, and shows Jake being rehabilitated, or at least made capable of motion, in a crazy madhouse run by Doctor D. The doctor is black and savage and mad himself, although he passes himself off as having reached the sanity on the far shore of madness. After Jake has been reduced to a frightened silence defined as normality, he goes to teach in a small college and meets the Morgans, Joe and Rennie, your archetypal mid-30s faculty couple.\n\nJoe is a scoutmaster when he isn't doing research in English literature or drawing a gun on himself in a mirror. Rennie is one of those good, vulnerable people compelled to be kind to stray dogs and psyches. She and Jake make love with a somehow horrible tenderness, and when she gets pregnant the whole delicate triangle dissolves.\n\nAnd all of this only suggests what the movie is about. A plot summary isn't very helpful; movies like this function on a level of mood and implication. They don't depend on plots, although often enough a critic may insist on discussing them at that level, to save himself trouble.\n\nWhat's happening at the subterranean levels of End of the Road may be something you'll have to discover for yourself. The strength and horror of the film came in its merging madness with the normal world. Jake Horner is indeed insane, and yet by positioning himself at the correct angle to the Morgans, he's able to present his sane side, mostly. Doctor D is insane, and yet preaches a terrible logic. In this movie, people sip lemonade on grassy lawns during the drowsy end of an early autumn afternoon. They also roll in the mud with pigs and commit an abortion that needs to be painted by Bosch. Avakian's insistence on keeping all these events on the same plane makes the movie gut twisting. And yet, there are many scenes of quiet humor and affection.\n\nThe performances are awfully good. Harris Yulin and Dorothy Tristan, as the Morgans, have either been cast well or are actually a faculty couple at some quiet backwoods college through the looking glass. Yulin's scene in his study, as he struts before his mirror while secretly observed, is as good as anything in a long time. Miss Tristan makes her faculty wife into an accurate mixture of maternalism and victim. Stacy Keach, as Jake, cannot be said to act so much as to recede further and further into himself; without this performance, nothing in the movie would have worked. James Earl Jones makes Doctor D into a monster adequate enough to carry the abortion scene; a shred of softness here and we wouldn't have believed anything.\n\nBarth's novel was informed by the apolitical conformity of fifties college life when McCarthyism kept liberal academics in a state of paranoid silence and retreat. By contrast, Avakian and Southern underscore Horner's nervous breakdown with images of the social and political meltdown of 1968. In a brilliant opening montage of still photos and newsreel footage, the sideshow of post-war history is unveiled culminating in the assassination of Robert Kennedy and Martin Luther King, riots and protests, the resurgence of law and order Republicans like Nixon and Agnew, and of course, the Vietnam War. Horner's catatonia is a direct response to the madness of LBJ's Great Society. Whereas the Doctor's race was not significant in the novel, the film's casting of James Earl Jones is central to Avakian and Southern's adaptation. Jones' balance of outrage and insight acts as a counterpoint to the ineffectual liberalism of the white characters.\n\nSouthern and Avakian also found a corollary to Barth's arch, self-referential prose. The editing combines scenes of seamless, flowing cuts with others that are disassociative and allusive. The dialogue is simultaneously banal and charged with menace and foreboding.\n\nWe tried to give the film a full-on sixties flavor - student unrest and so on - which seemed inherent in the book . A very good book, and, I like to believe, a most faithful adaptation, with a little something extra in the form of Doctor D's theories, Southern told me.\n\nThe acting is deliberately mannered with the characters as archetypes wearing irony all too visibily on their sleeve. Harris Yulin is especially noteworthy in his definitive portrait of a jaded, manipulative career academic.\n\nThe visual and aural strategy of End of The Road adds to the film's unsettling atmosphere. Making his debut as a feature film cinematographer, Gordon Willis' chiaroscuro approach equals that of his work with Francis Coppola and Woody Allen. \n\nDespite a big advance story in Life, the film was met with either indifference or incomprehension. In a typical review, Molly Haskell wrote the apocalyptic vision is an excuse for blackwashing moral distinctions. Judith Crist dismissed it as tasteless and superficial. With no hot young stars (but fine actors) or groovy rock score (but Bach, Billie Holliday and Teo Macero), Road was a film that fell between the cracks of youth culture, the New Hollywood and the traditional art house audience. And John Barth didn't like the film to boot.\n\nEnd of The Road was a turning point for Southern and Avakian. After 1970, Southern found it increasingly difficult to get his unique brand of satire financed. A promising adaptation of A Cool Million by Nathanael West was one of the first projects to get stalled in development hell. Avakian went back to the mainstream to make the elegant but empty 11 Harrowhouse and Cops n' Robbers. He had more success as a teacher at Purchase College, where one of his students was Hal Hartley.\n\nEnd of The Road was forgotten, but it has slowly built up a, dare I say it, sub-cult reputation thanks to video. Nicholas Roeg paid homage to the film in The Man Who Fell To Earth. When Thomas Newton watches his bank of multiple TV sets, one of them shows James Earl Jones taunting Stacy Keach. Roeg probably identified with Avakian's outlaw approach to feature film storytelling.\n\nEnd of The Road is some kind of masterpiece, a tattered signpost pointing to a road not taken by American cinema. The New Hollywood of the late sixties and early seventies, like most new waves, promised more than it could deliver. As great as the work of Coppola, Scorsese and Spielberg was in the seventies, their politics was often safely couched in genre or pyrotechnical display. If Road had been even a modest success, Avakian might have joined Robert Altman or John Cassavettes in creating a more rigorous brand of new American cinema.\n\nFor Southern, Road was the closest he came to directing and reveals that there was more to his work than the cool hipster suggested by Dr. Strangelove and Easy Rider. Like all great satirists, Southern is a man of great seriousness, insight and feeling. He was no doubt attracted to Road because it highlights one of his major themes: the chaos that results when language, thought and feeling are cut off from each other. \n\nIn his memoir, Once Upon A Time, John Barth calls the film vulgar, but actually the film extends the ideas of his novel. It pushes the consequences of the book's nihilism further and stresses the links between the personal and political. End of The Road is a raw cry of anguish over the death of sixties idealism filmed in a year when hope and fear were starkly felt by millions around the world. Like Two Lane Backtop and Performance, End of The Road is an elegy for a decade that we are still coming to terms with.\n\n\n","torrent":{"xt":"urn:btih:d4ced7361a33dc7da1dd4c5c4fe94aba10a936fb","amp;dn":"End+of+the+Road+%28VHS%29+%5B1970%5D+Aram+Avakian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ced7361a33dc7da1dd4c5c4fe94aba10a936fb","infoHashBuffer":{"type":"Buffer","data":[212,206,215,54,26,51,220,125,161,221,76,92,79,233,74,186,16,169,54,251]},"announce":[],"urlList":[]}}