{"title":"Nasopharyngeal Cancer: Multidisciplinary Management","uid":6540752,"size":60934521,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d53fc2cb4ecaf545b6a46b4e3f8bf7b0fbdfbf25&amp;dn=Nasopharyngeal+Cancer%3A+Multidisciplinary+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310677783,"description":"Jiade J. Lu, Jiade J. Lu, Jay S. Cooper, Anne W. M. Lee, Luther W. Brady, Hans-Peter Heilmann, Michael Molls, Carsten Nieder, &quot;Nasopharyngeal Cancer: Multidisciplinary Management&quot; \n Publisher: Springer | ISBN: 354092809X | edition 2009 | PDF | 334 pages | 58,11 mb\n\n Nasopharyngeal Cancer - Multidisciplinary Management provides a comprehensive account of the current state of knowledge on nasopharyngeal cancer and its multidisciplinary management. The first ten chapters document contain essential background information on subjects such as epidemiology, pathogenesis, molecular biology, pathology, and the use of imaging in diagnosis and staging. Subsequently, the various treatment options and combinations in a range of settings are examined in depth. Detailed attention is given to the roles of concurrent, adjuvant, and neoadjuvant chemotherapy and advanced radiotherapy techniques. Further chapters then explore surgical treatment, follow-up, treatment of metastatic disease, treatment-related complications, and nasopharyngeal cancer in children. This is an important book that will prove essential reading for the radiation oncology community worldwide and meet the need for substantial improvements in knowledge of modern techniques.","torrent":{"xt":"urn:btih:d53fc2cb4ecaf545b6a46b4e3f8bf7b0fbdfbf25","amp;dn":"Nasopharyngeal+Cancer%3A+Multidisciplinary+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d53fc2cb4ecaf545b6a46b4e3f8bf7b0fbdfbf25","infoHashBuffer":{"type":"Buffer","data":[213,63,194,203,78,202,245,69,182,164,107,78,63,139,247,176,251,223,191,37]},"announce":[],"urlList":[]}}