{"title":"NDS Sudokumaniacs(FRA) - P0w3rp0t1","uid":4477386,"size":1920785,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:d55545005b088ae3a80a0939af1b35a4db38b700&amp;dn=NDS+Sudokumaniacs%28FRA%29+-+P0w3rp0t1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"P0w3rp0t1","files":3,"time":1225403277,"description":"The Sudoku has already swept the globe once. Now, it is possible to play Sudoku when and wherever you want with Sudokumaniacs for the Nintendo DS. \n\nIf you have not played Sudoku before, the rules are fairly straightfroward. The aim of the puzzle is to enter a number ranging from one to nine in each cell of a nine by nine grid, made up of nine three by three sub-grids. Each puzzle starts off with some numbers already provided in a few cells. These are the hints. As the puzzles increase in difficulty, players will find the number of hints given decreases. It is then up to the player to make sure that each row, column and three by three sub-grids have only one instance of each number. \n\nSudokumaniacs is one of those games deemed difficult to master. All you have to do is select what difficulty and complexity settings you want, then attempt to beat the number puzzle as quickly as you can. Another feature is the ability to customise your game to suit your mood and skill level. \n\nThe Nintendo DS touch screen really does offer ideal gamer interface for Sudoku. Using the touch screen, players have two ways of entering the numbers into the cells: they can write them in using the DS stylus pen or select the appropriate number by touching the keys on the number pad. Sudokumaniacs also offers gamers exciting multiplayer action","torrent":{"xt":"urn:btih:d55545005b088ae3a80a0939af1b35a4db38b700","amp;dn":"NDS+Sudokumaniacs%28FRA%29+-+P0w3rp0t1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d55545005b088ae3a80a0939af1b35a4db38b700","infoHashBuffer":{"type":"Buffer","data":[213,85,69,0,91,8,138,227,168,10,9,57,175,27,53,164,219,56,183,0]},"announce":[],"urlList":[]}}