{"title":"Yoga on the Edge with Sara Ivanhoe x264 aac [MP4]","uid":11821001,"size":2336904008,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d577c1da00c3873d106b0603f7d6ed46e940d988&amp;dn=Yoga+on+the+Edge+with+Sara+Ivanhoe+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":5,"time":1429260549,"description":"Shot on location in the Bahamas, Yoga on the Edge contains these soulful programs - 'Sunrise' practice moves through postures quickly to wake the body up and going. It is the longest and most physically challenging of the three programs. 'High Noon' uses the serene surroundings to inspire breath and balance. 'Sunset' is a calming sequence designed to wind the body down after a hard day.\n\nAfter years of making yoga videos in the studio, I wanted to create a series that was more spontaneous. The idea is that yoga happens in the moment and that we, as practitioners are affected by and connected to our surroundings. That way, every where we go, every time we practice, it's a little different. Yoga on the Edge was created for that purpose, to literally embody different locations around the world.\n\nThis first series was shot in Harbour Island, The Bahamas. I simply started practicing yoga inspired by my surroundings. You'll be able to see that none of the yoga was planned or rehearsed in anyway. I make mistakes, wipe my face and fall out of balancing postures, just like I do in real life when I practice, just like we all do.\n\nAs you are in the comfort of your home, I recommend that you practice on a non slip surface or yoga sticky mat, that you wear comfortable clothes you can move in and that you wait at least an hour or two after a meal before practicing yoga. Even though you are in your home, imagine you are practicing with me. Allow the music and the beauty of Harbour Island to transport you to a magical place.\n\nThis DVD consists of 3 separate workouts - Sunrise, High Noon and Sunset.\n\nSunrise Practice - Shot on the beach, this workout moves through postures more quickly to wake the body up and get going. It is the longest and most physically challenging of the three programs. Running time is 59:15\n\nHigh Noon uses the serene surroundings to inspire breath and balance. Running time is 38:00\n\nSunset is a calming sequence designed to wind the body down after a hard day. Running time is 27:52\n\nVideo; x264; 720*480 (16:9); 2180 kbps; 29.970 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:d577c1da00c3873d106b0603f7d6ed46e940d988","amp;dn":"Yoga+on+the+Edge+with+Sara+Ivanhoe+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d577c1da00c3873d106b0603f7d6ed46e940d988","infoHashBuffer":{"type":"Buffer","data":[213,119,193,218,0,195,135,61,16,107,6,3,247,214,237,70,233,64,217,136]},"announce":[],"urlList":[]}}