{"title":"Antony Flew &amp; Roy Abraham Varghese - There Is a God","uid":10840012,"size":1217618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d58d9b01c73868784eeaebd28078309ed1bf72b7&amp;dn=Antony+Flew+%26amp%3B+Roy+Abraham+Varghese+-+There+Is+a+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philosophi","files":-1,"time":1408734299,"description":"Antony Flew &amp; Roy Abraham Varghese - There Is a God\n\nIn one of the biggest religion news stories of the new millennium, the Associated Press announced that Professor Antony Flew, the world's leading atheist, now believes in God.\n\nFlew is a pioneer for modern atheism. His famous paper, Theology and Falsification, was first presented at a meeting of the Oxford Socratic Club chaired by C. S. Lewis and went on to become the most widely reprinted philosophical publication of the last five decades. Flew earned his fame by arguing that one should presuppose atheism until evidence of a God surfaces. He now believes that such evidence exists, and There Is a God chronicles his journey from staunch atheism to believer.\n\nFor the first time, this book will present a detailed and fascinating account of Flew's riveting decision to revoke his previous beliefs and argue for the existence of God. Ever since Flew's announcement, there has been great debate among atheists and believers alike about what exactly this &quot;conversion&quot; means. There Is a God will finally put this debate to rest.\n\nThis is a story of a brilliant mind and reasoned thinker, and where his lifelong intellectual pursuit eventually led him: belief in God as designer.","torrent":{"xt":"urn:btih:d58d9b01c73868784eeaebd28078309ed1bf72b7","amp;dn":"Antony+Flew+%26amp%3B+Roy+Abraham+Varghese+-+There+Is+a+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d58d9b01c73868784eeaebd28078309ed1bf72b7","infoHashBuffer":{"type":"Buffer","data":[213,141,155,1,199,56,104,120,78,234,235,210,128,120,48,158,209,191,114,183]},"announce":[],"urlList":[]}}