{"title":"Impact (2008) PAL (MINI SERIE)(MULTI) 2Lions-Team","uid":5389769,"size":7940236008,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d6a10d9c7fe192f46da986fbce93c8f634b78fbc&amp;dn=Impact+%282008%29+PAL+%28MINI+SERIE%29%28MULTI%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1267027723,"description":"Impact (2008) PAL\n\n\n\n\nTijdens een enorme meteorenregen knalt een asteroÃƒÂ¯de met enorme kracht tegen de maan aan. De fragmenten van deze asteroÃƒÂ¯de en stukjes van de maan zelf, komen op de aarde terecht. De aanvankelijke schade is minimaal en experts zeggen dat ook de beschadigingen aan de maan geen nadelige effecten zullen hebben. Maar dan beginnen zich toch afwijkende zaken voor te doen. Belangrijke wetenschappers ontdekken dat de koers van de maan definitief veranderd is en dat deze nu op de aarde afstevent.\n\n\nEnglish\n\nWhile the entire world watches the largest meteor shower in 10,000 years, a rogue asteroid, hidden by the meteor field, smashes into the moon in a tremendous explosion of rock and debris. Fragments from the asteroid, and even from the moon itself, penetrate Earth's atmosphere and make impact. Even though the initial damage is minimal, nerves are frayed throughout the planet. There is significant physical damage to the lunar surface, but experts quickly conclude there will be no lasting ramifications. Then strange anomalies begin to manifest themselves on Earth. It starts small - cell phone disruptions, unusual static charges and odd tidal behavior. The world's leading scientists, including Alex Kittner, Maddie Rhodes and Roland Emerson, begin piecing together evidence that suggests the moon's properties, and its orbit, may have been permanently altered. Their fears are realized when the anomalies increase to the point where the effect of &quot;simulated&quot; gravity is being manipulated by increased electromagnetic surges coming from the moon. People, cars and other objects are rendered momentarily weightless in random, isolated areas around the globe. Alex, Maddie, Roland and the rest of their team soon discover something far worse - the moon's new orbit has put it on a collision course with Earth! The world now has 39 days to stop it or Earth, and all of mankind, will perish. After a failed attempt by the United States to destroy the moon, our heroes bring all the countries of the world together in one last hope for humanity - an international mission to the moon itself where astronauts will attempt to reverse the magnetic effects and restore the moon to its original orbit. Alex, whose children are now missing after the latest rampage of anti-gravity, is emotionally torn as he must now join Roland and two other astronauts on the Earth saving mission into space. It is a race against time as the two celestial bodies are drawn closer and closer to impact, the world united, watching and praying, the survival of mankind in the balance.\n\n\nType disc: DVD 9 ISO/MDS\nGenre: Actie / Science-Fiction\nRegio: 0\nJaar van uitgave: 2008\nRegisseur: Mike Rohl\nUitgever: Sony Pictures\nSpeelduur: 180 minuten (miniserie, 2 delen)\nLeeftijd: 12 Jaar\nActeurs: Natasha Henstridge, David James Elliott en Benjamin Sadler\n\n\n\nSpotinformatie\nCategorie : Beeld\nFormaat : DVD9\nBron : Retail\n- Geluid sporen aanwezig: Dolby Digital 5.1 - Engels / Dolby Digital 5.1 - Frans\n- Ondertiteling: Nederlands / Engels / Frans / Deens / Fins / Noors / Portugees / Zweeds\n\nRipper : ILLUMINATI\n\nGenre : Actie\nScience Fiction\n\n\n\nWeblink : http://www.moviemeter.nl/film/56975\nWeblink : http://www.imdb.com/title/tt1227637\n\n*****************************************\n\nBrought to you by\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:d6a10d9c7fe192f46da986fbce93c8f634b78fbc","amp;dn":"Impact+%282008%29+PAL+%28MINI+SERIE%29%28MULTI%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a10d9c7fe192f46da986fbce93c8f634b78fbc","infoHashBuffer":{"type":"Buffer","data":[214,161,13,156,127,225,146,244,109,169,134,251,206,147,200,246,52,183,143,188]},"announce":[],"urlList":[]}}