{"title":"Crashers - Dana Haynes Unabridged Audio Book","uid":9340362,"size":952102442,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d6d89f60a46ddf3a1a5df1d4d60818c9d8bfbe7e&amp;dn=Crashers+-+Dana+Haynes+Unabridged+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386919877,"description":"Crashers - Dana Haynes (Big Papi) Audio Book 2010 Unabridged\n-\n-\nPlease note that there are two special settings on the MP3 files in this collection:\n\nSkip Shuffle - If you have this audio book on your music player and shuffle songs none of these audio book tracks will play.\n\nRemember Position - If you hit the stop button when the track is resumed later it will begin to play where it left off. \n\n128vbr - This collection really doesn't require the Big Papi 320cbr rip afforded to music. Most tracks sit about 160-170kbps and that is mucho good.\n\nAlbum Display - When viewing this audio book in your music player you will see one album with cover art with multiple discs inside. The view from the factory is typically one album for each disc and that makes for sloppy.\n\n- Big Papi\n-\n-\n-\nWhenever a plane goes down in the U.S., a &quot;Go Team&quot; made up of experts is assembled by the NTSB to investigate. Those people - each of them a leading expert in a specific area - are known as informally as &quot;Crashers.&quot;When a passenger plane, a Vermeer One Eleven, slams into the ground outside Portland, Oregon, a team is quickly assembled to investigate the cause. Under the leadership of the IIC (Investigator in Charge), Leonard &quot;Tommy&quot; Tomzak, a pathologist who recently quit the NTSB who also happened to be in the area when the Vermeer One Eleven went down, the team gets to work as fast as possible. Assembled by Susan Tanaka, the inter-governmental liason from the NTSB on this crash, the team includes: Kathryn &quot;Kiki&quot; Duvall (voice recorder specialist), known as a&quot;sonar witch&quot; who can hear things that others can't and can pinpoint an accent from anywhere in the world; John Roby (Mad Bomber), former cop and bomb expert, who can detect the use of an incendiary device simply by smelling the air; Walter Mulroney (Structures), looks more like a cowboy than an engineer but can rebuild just about any plane from the bolts up; along with Peter Kim (Power Plant) and Isaiah Grey (Operations). Usually the team has months to determine the cause of a crash. But this time it's different. This time, the plane was brought down deliberately, without leaving a trace, and this was only a trial run.In LA, Daria Gibron - a former Shin Bet agent, now under the protection of the FBI- spots a group of suspicious-looking men. Missing her former life of action, she attaches herself to them only to learn that, somehow, they were responsible for the plane crash and are preparing for another action. While her FBI handler tries to find her and save her, Daria risks her life to try to get close enough to learn what's going on and thwart the coming terrorist action. But time is running out and her cover story is running thin.A fresh and utterly compelling thriller, an original mix of action, investigation and a brilliant cast of characters that grabs the reader in the way few novels can and fewer do.","torrent":{"xt":"urn:btih:d6d89f60a46ddf3a1a5df1d4d60818c9d8bfbe7e","amp;dn":"Crashers+-+Dana+Haynes+Unabridged+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d89f60a46ddf3a1a5df1d4d60818c9d8bfbe7e","infoHashBuffer":{"type":"Buffer","data":[214,216,159,96,164,109,223,58,26,93,241,212,214,8,24,201,216,191,190,126]},"announce":[],"urlList":[]}}