{"title":"U2 - Under a Blood Red Sky (Edit, pre-2008 Remaster)","uid":8792783,"size":228349724,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6f26dcf95475e7c367e800dac1ded5e83ddab6a&amp;dn=U2+-+Under+a+Blood+Red+Sky+%28Edit%2C+pre-2008+Remaster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrShite","files":3,"time":1375992528,"description":"The album consists of live recordings from three shows on the band's War Tour from Colorado, Boston in the US and Germany. Album highlights include a fiery rendition of &quot;Sunday Bloody Sunday&quot; (famously introduced by Bono with the words, &quot;this song is not a rebel song&quot;) and a jaunty run-through of the B-side &quot;Party Girl&quot;.\n\nAn accompanying concert video entitled U2 Live at Red Rocks: Under a Blood Red Sky was released the following year. Unlike the album, the film was recorded entirely at the dramatic outdoor Red Rocks Amphitheatre on 5 June 1983. The band's performance of &quot;Sunday Bloody Sunday&quot; from the film has been cited as one of Rolling Stone's &quot;50 Moments that Changed the History of Rock and Roll.&quot;\n\nThe title is taken from the lyrics of the song &quot;New Year's Day&quot;, originally released on U2's War album.\n\nThe album was re-released as a remastered CD with a DVD of the complete concert on 29 September 2008.\n\n1.\t&quot;Gloria&quot;  \tRed Rocks Amphitheatre on 5 June 1983\t4:32\n2.\t&quot;11 O'Clock Tick Tock&quot;  Boston, Massachusetts on 6 May 1983\t4:34\n3.\t&quot;I Will Follow&quot;  Sankt Goarshausen, Germany on 20 August 1983\t3:36\n4.\t&quot;Party Girl&quot;  \tRed Rocks Amphitheatre on 5 June 1983\t2:52\n5.      &quot;Sunday Bloody Sunday&quot;  Sankt Goarshausen, Germany on 20 August 1983\t4:55\n6.\t&quot;The Electric Co.&quot;  \tSankt Goarshausen, Germany on 20 August 1983\t5:18\n7.\t&quot;New Year's Day&quot;  \tSankt Goarshausen, Germany on 20 August 1983\t4:29\n8.\t&quot;40&quot;  \tSankt Goarshausen, Germany on 20 August 1983\t3:36\n\nDuring the performance of &quot;The Electric Co.&quot;, Bono included a 27 second snippet of Stephen Sondheim's &quot;Send in the Clowns&quot;. When Under a Blood Red Sky was released, U2 failed to get permission and pay the appropriate licensing and royalty fees to include that piece of Sondheim's tune on the album. When Sondheim objected, U2 agreed to pay a $50,000 (US) penalty for the unauthorized use and to press all future releases with a new version that did not include the snippet.\n\nEssentially, there are now two versions of the vinyl album: the original with the full &quot;The Electric Co.&quot; running 5:18 and the edited version which runs 4:51. However, the various CDs pressed around the world all vary in the versions of the song that are included.\n\nThe trifold digipack CD pressed in the U.S. correctly lists &quot;The Electric Co.&quot; at 4:51 and contains the edited version of the song.\n\nLater U.S. CD pressings in the standard jewel box format incorrectly list &quot;The Electric Co.&quot; at 5:18, but have the edited version of the song.\n\nSome, and perhaps all, European pressings of the CD correctly list &quot;The Electric Co.&quot; at 5:18 and have the unedited version of the song (the same is likely true of other worldwide CD pressings).\n\nAn Australian pressing of the CD lists the track at 4:57, but the song actually runs the full 5:18.\n\nThe remastered editions all contain the edited version of the song.","torrent":{"xt":"urn:btih:d6f26dcf95475e7c367e800dac1ded5e83ddab6a","amp;dn":"U2+-+Under+a+Blood+Red+Sky+%28Edit%2C+pre-2008+Remaster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f26dcf95475e7c367e800dac1ded5e83ddab6a","infoHashBuffer":{"type":"Buffer","data":[214,242,109,207,149,71,94,124,54,126,128,13,172,29,237,94,131,221,171,106]},"announce":[],"urlList":[]}}