{"title":"Selling Sex in The Reich - Victoria Harris","uid":12027090,"size":3383157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6fe7f1567e8a6275724a0b26ead7066b066723d&amp;dn=Selling+Sex+in+The+Reich+-+Victoria+Harris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434502275,"description":"Selling Sex in the Reich focuses on the voices and experiences of prostitutes working in the German sex trade in the first half of the twentieth century. Victoria Harris develops a nuanced picture of the prostitutes' backgrounds, their reasons for entering the trade, and their attitudes towards their work and those who sought to control them, as well as of their clients and the wide variety of other players within the wider prostitute milieu. Public responses to the issue of prostitution are revealed through the motivations of the law enforcement agencies, social workers, and doctors who increasingly attempted to manage and contain prostitutes' movements and behaviour and to scientifically categorize them as a group.\n\nProstitution can help recast our understanding of sexuality and ethics, teaching us much about how German society defined itself through its definition of who did not belong within it. In addition, common conceptions of the relationship between the type of government in power and official attitudes towards sexuality are challenged. For, as Harris shows, the prevalent desire to control citizens' sexuality transcended traditional left-right divides throughout this period and intensified with economic and political modernization, producing surprising continuities across the Wilhelmine, Weimar, and Nazi eras.\n\n**","torrent":{"xt":"urn:btih:d6fe7f1567e8a6275724a0b26ead7066b066723d","amp;dn":"Selling+Sex+in+The+Reich+-+Victoria+Harris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6fe7f1567e8a6275724a0b26ead7066b066723d","infoHashBuffer":{"type":"Buffer","data":[214,254,127,21,103,232,166,39,87,36,160,178,110,173,112,102,176,102,114,61]},"announce":[],"urlList":[]}}