{"title":"Breaking The Silence - Truth and Lies in the War on Terror (2003","uid":3555023,"size":649542805,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d7fe5a6a9b7fbff6609e548b18bdd5700eb5725e&amp;dn=Breaking+The+Silence+-+Truth+and+Lies+in+the+War+on+Terror+%282003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PropAgenda","files":2,"time":1163191782,"description":"Breaking the Silence: Truth and Lies in the War on Terror (2003)\n\n\n\nJohn Pilger dissects the truth and lies in the &amp;#039;war on terror&amp;#039;. Award-winning journalist John Pilger investigates the discrepancies between American and British claims for the &amp;#039;war on terror&amp;#039; and the facts on the ground as he finds them in Afghanistan and Washington, DC. \n\nIn 2001, as the bombs began to drop, George W. Bush promised Afghanistan &quot;the generosity of America and its allies&quot;. Now, the familiar old warlords are regaining power, religious fundamentalism is renewing its grip and military skirmishes continue routinely. In &quot;liberated&quot; Afghanistan, America has its military base and pipeline access, while the people have the warlords who are, says one woman, &quot;in many ways worse than the Taliban&quot;. \n\nIn Washington, Pilger conducts a series of remarkable interviews with William Kristol, editor of The Weekly Standard, and leading Administration officials such as Douglas Feith, Under Secretary of Defense for Policy, and John Bolton, Under Secretary of State for Arms Control and International Security. These people, and the other architects of the Project for the New American Century, were dismissed as &amp;#039;the crazies&amp;#039; by the first Bush Administration in the early 90s when they first presented their ideas for pre-emptive strikes and world domination. \n\nPilger also interviews presidential candidate General Wesley Clark, and former intelligence officers, all the while raising searching questions about the real motives for the &amp;#039;war on terror&amp;#039;. \n\nWhile President Bush refers to the US attacks on Afghanistan and Iraq as two &amp;#039;great victories&amp;#039;, Pilger asks the question - victories over whom, and for what purpose? Pilger describes Afghanistan as a country &quot;more devastated than anything I have seen since Pol Pot&amp;#039;s Cambodia&quot;. He finds that Al-Qaida has not been defeated and that the Taliban is re-emerging. And of the &quot;victory&quot; in Iraq, he asks: &quot;Is this Bush&amp;#039;s Vietnam?&quot; \n\nBREAKING THE SILENCE is a film with enormous emotional power, bringing us the human consequences of our military attacks on Middle East countries. It also provides us with important insights into the reasons for these cruelties, exposing the emptiness and hypocrisy of the claims made by the Bush administration that it is fighting &quot;terrorism&quot; and promoting &quot;freedom&quot;. I wish this film could be shown in every classroom in the United States, to guard young people against the lies they will hear from on high, and to prepare them to be active citizens in the struggle for a peaceful world.&quot; Howard Zinn, Author, A People&amp;#039;s History of the United States: 1492-Present, Terrorism and War \n\n&quot;In 52 minutes, John Pilger succeeds brilliantly where the U.S. mass media have failed miserably -- to examine the &quot;war on terror&quot; with tough-minded humanism and uncompromising journalism. The result of Pilger&amp;#039;s efforts is a powerful expose that demolishes the pretensions of George W. Bush and Tony Blair. In 2004, we need Pilger&amp;#039;s documentary BREAKING THE SILENCE more than ever. From Afghanistan and Iraq to New York City and the insulated bastions of power in Washington, this film jolts us to consider the real human costs of flagrant lies still being told in high places. Whether you live in the United States, Britain or anywhere else on the planet, BREAKING THE SILENCE shatters some key myths that often prevent us from developing news media and political priorities to protect human life instead of destroying it.&quot; - Norman Solomon, Executive Director, Institute for Public Accuracy\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0389817/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0389817/&lt;/a&gt;\n\n\n\n\nAVI File Details\n========================================\nName.........: Breaking The Silence - Truth And Lies In The War On Terror - John Pilger.avi\nFilesize.....: 619 MB (or 634,319 KB or 649,542,758 bytes)\nRuntime......: 00:51:05 (76,630 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1561 kb/s\nAudio Codec..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s (64/ch, stereo) CBR \nFrame Size...: 720x400 (1.80:1) [=9:5]\nLanguage.....: English\n\n\n[b]ed2k:[/b] ed2k://|file|Breaking.the.Silence.-.John.Pilger.avi|649542758|8F40F0B2D8361EE4181D7CDBCA1CB2D1|/\n\n\n &lt;a href=&quot;\nhttp://video.google.com/videoplay?docid=-29761977781347669&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://video.google.com/videoplay?docid=-29761977781347669&lt;/a&gt;\n&lt;&lt; stream @ google video\n &lt;a href=&quot;\nhttp://www.freedomfiles.org/movies/35_mb_pilger_breaking_the_silence.wmv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freedomfiles.org/movies/35_mb_pilger_breaking_the_silence.wmv&lt;/a&gt; &lt;&lt; 35mb wmv download @ freedomfiles.org\n\n\n\n","torrent":{"xt":"urn:btih:d7fe5a6a9b7fbff6609e548b18bdd5700eb5725e","amp;dn":"Breaking+The+Silence+-+Truth+and+Lies+in+the+War+on+Terror+%282003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7fe5a6a9b7fbff6609e548b18bdd5700eb5725e","infoHashBuffer":{"type":"Buffer","data":[215,254,90,106,155,127,191,246,96,158,84,139,24,189,213,112,14,181,114,94]},"announce":[],"urlList":[]}}