{"title":"Don't Starve Reign of Giants rev. 100168(April 24)","uid":10049743,"size":194289231,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d95ee806f4d9d74c94e3523a23425fe20135be11&amp;dn=Don%27t+Starve+Reign+of+Giants+rev.+100168%28April+24%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ramasbmv","files":1,"time":1398596981,"description":"Feasting and Forging - April 16, 2014\nHere are the patch notes for our April 16, 2014 update. As with the previous updates, the additions we made to the game have been deliberately left vague.\n \nChanges:\nTweaked visual effects for overheating.\nChanged the placer icon of the Ice Flingomatic to better represent the effective range.\nGiants are more powerful in general.\nChanged giant loot into crafting mats instead of completed items.\nMade changes to the items that can be crafted with the giant's crafting materials.\nDragonfly Armour now doesn't provide as much protection. Enemies who hit you will be lit on fire.\nDown Thermantidote is now called the Luxury Fan. Increased number of uses to 15. Fires in the area of use will be put out.\nHibearnation Vest causes less hunger reduction.\nEyebrella is now a hat.\nAdditions:\nAdded additional craftables!\nAdded cookpot food recipes!\nBug Fixes:\nFixed a crash that happened when cookpots and drying racks burn down with food on them.\nCleaned up some Catcoon behaviours and crashes.\nCleaned up the behaviours and animations of some of the giants.\nFixed a crash that happened when using gunpowder on the g/moose egg.\nFixed improper eat prompts appearing for some characters.\nMoles aren't raised dirt anymore.\nPigs have gained a taste for foods they would previously ignore.\nFixed some bugs with Webber's eating habits.\nBuzzards no longer disappear when sleeping.\nVargs no longer use the Volt Goat hit sound.\nDragonfly SFX will now turn off on death.\nSpiders emerging from tumble weed will now properly recognize when the player is wearing a spider hat.\nWilson's &quot;Red Bird&quot; inspect has been changed.\nPoop no longer duplicates when trying to fertilize an invalid target.\nSanity eyes have learned to better hide themselves.\n \nHotfix 99777 - April 16\nItems dropped from giants now stack to 10.\nCoontail has art assets properly loaded.\nEating sanity restoring foods properly restores sanity again.\nHotfix 99845 - April 17\nAdded missing string for Cactus Flower.\nTurned off the controller debug menu.\nFixed an issue where Chester would not transform while playing a non-RoG save file.\nThe Molehat no longer functions when worn by entities other than the player.\nAdded some missing file references.\nRemoved some print spam from the Deerclops brain.\n+\nReign of Giants - April 24 Patch Notes\nHey guys. We've made some fairly big balance changes this week. We're nearing release, so we decided to put out a patch with these changes to get feedback as soon as possible.\n \nBuild 100168:\n \nChanges:\n&quot;Nerfed&quot; cooling hats.\nCooling hats now cool you less.\nCooling hats now add wetness to your character.\nIncreased the amount of sanity lost due to wetness.\nMade changes to the following recipes:\nColdfire\nColdfire Pit\nMoggles\nItems now get wet sooner (35 vs. 70)\nMuch improved the usefulness of the Ice Flingomatic.\nThe player now stays frozen for a shorter amount of time.\nElectric Milk will now only drop from charged Volt Goats.\nThe Morning Star will now charge goats when they are hit.\nEating cool or hot foods now adds temperature over time instead of all at once.\nMoles are now nocturnal\nTuned day lengths.\nUpdated the .pot files needed for translations.\nAdded No Day, No Dusk and No Night world customization options.\nMade some changes to how WX reacts to wetness/ electric damage.\nRemoved the light from the heat rock.\nMoved electrical doodad to the science tab.\nHot/ Cold animations now trigger sooner.\nHeat rock will not cool below 0 degrees while in an icebox now.\nIncreased the damage on smothering smoldering items.\nHot foods now cool off over time.\nMoggles can no longer be repaired.\n \nBug Fixes:\n \nFix for stewers spitting out rot sometimes.\nDragonfly will no longer get stuck if attacked while eating.\nAdded the &quot;animal&quot; tag to some creatures to fix some targeting issues.\nMoggles no longer allow time travel.\nFixed a crash in deciduous tree.\nFix for deciduous trees going into the wrong season state.","torrent":{"xt":"urn:btih:d95ee806f4d9d74c94e3523a23425fe20135be11","amp;dn":"Don%27t+Starve+Reign+of+Giants+rev.+100168%28April+24%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95ee806f4d9d74c94e3523a23425fe20135be11","infoHashBuffer":{"type":"Buffer","data":[217,94,232,6,244,217,215,76,148,227,82,58,35,66,95,226,1,53,190,17]},"announce":[],"urlList":[]}}