{"title":"DJ Most B present Music Pack Vol.4 August-2011","uid":6578129,"size":1294311977,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d9c1431849baa517b98f014f25b5b2555040d724&amp;dn=DJ+Most+B+present+Music+Pack+Vol.4+August-2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CJatShore","files":104,"time":1312293392,"description":"VA- Club House\\2NE1 - I Am The Best [Most Be]\nVA- Club House\\50 Cent, Dr Kucho - Beat Da Club (Andrey Zenkoff Mash Up) [Most Be]\nVA- Club House\\Above &amp; Beyond - Thing Called Love (Electro Banger Instrumental Remix) [Most Be]\nVA- Club House\\Adele - Rolling In The Deep (Flobers Brothers Remix)[Most Be]\nVA- Club House\\Adele - Set Fire To The Rain (E-Thunder BDay Remix)[Most Be]\nVA- Club House\\Adele - Set Fire to the Rain (Thomas Gold Remix) [Most Be]\nVA- Club House\\Adele - Set Fire To The Rain (Thomas Gold Remix)[Most Be]\nVA- Club House\\Adrian Lux ft. Rebecca &amp; Fiona - Boy (Hardwell Remix)[Most Be]\nVA- Club House\\Akon - Chammak Challo  [Most Be]\nVA- Club House\\Al Azif ft. Gnucci Banana &amp; Crossfire - Sick In Head (Alaa Remix) [Most Be]\t\nVA- Club House\\Alex Saidac - We Shine[Most Be]\nVA- Club House\\Alexia - Me &amp; You (Peter Walley &amp; MRG 2k11 Remix)[Most Be]\nVA- Club House\\Alvaro ft. Lil Jon - Fucking Ghetto (Dirty Version) [Most Be]\nVA- Club House\\Andreea Banica - Sexy (Speak One Reworked Extended Mix) [Most Be]\nVA- Club House\\Andu Angelo and Inna - Love 2011 (Andu Angelo Remix)[Most Be]\t\nVA- Club House\\Arcanix &amp; Beattraax &amp; Eddie Allen - Tomorrow Is Waiting For You (Arcanix vs Beattraax Club Mix)[Most Be]\nVA- Club House\\Ariez Onasis - Sound The Siren [Most Be]\nVA- Club House\\Armin van Buuren vs Sophie Ellis-Bextor - Not Giving Up On Love (Dash Berlin 4AM Mix) [Most Be]\nVA- Club House\\Avicii - Fade Into Darkness (Instrumental Club Mix)[Most Be]\nVA- Club House\\Avicii - Fade Into Darkness (Vocal Mix) (Alex Prigenzi Edit)[Most Be]\nVA- Club House\\Badboys Brothers - Dj Superstar (Sergey Smile Remix)[Most Be]\nVA- Club House\\Ball Greezy ft. Flo-Rida - Blow A Check  [Most Be]\nVA- Club House\\Beckwith ft. Ineabell - Higher (Your Love)[Most Be]\nVA- Club House\\Benny Benassi - Automatic B [Most Be]\nVA- Club House\\Benny Benassi - Good Girl [Most Be]\t\nVA- Club House\\Benny Benassi ft. Shanell - Rather Be[Most Be]\nVA- Club House\\Benny Benassi vs Marco V - Cinema vs Reaver (Hardwell MashUp)[Most Be]\nVA- Club House\\Beyonce - Best Thing I Never Had (Happy HotDog Radio Edit) [Most Be]\nVA- Club House\\Beyonce - Crazy In Love (Fare Soldi Chiapponzilla Remix) [Most Be]\nVA- Club House\\Bingo Players - Cry (Just A Little) (Kids At The Bar Bootleg Remix)[Most Be]\nVA- Club House\\Blank &amp; Jones - Watching The Waves (KyCa4Ku Remix)[Most Be]\nVA- Club House\\Bogdan - Hila [Most Be]\nVA- Club House\\Britney Spears - I Wanna Go (Edson Pride Club Mix)[Most Be]\nVA- Club House\\Britney Spears - Till The World Ends (Luis Erre Mash Up Mix)[Most Be]\nVA- Club House\\Bryce ft. CarlPrit - Dance With Me (Paramond Remix)[Most Be]\nVA- Club House\\Calvin Harris - Feels So Close (Dan Clare Remix)[Most Be]\nVA- Club House\\Carl Louis &amp; M.Danielle Vs. Soul Searcher &amp; Soul Vision - Can't Get Enough To Coming Home (Dani Veiga Boot)[Most Be]\nVA- Club House\\Cher Lloyd - Swagger Jagger[Most Be]\t\t\nVA- Club House\\Chris Brown ft. Robert Miles - Beautiful Children (LX-Tronix Remix) [Most Be]\nVA- Club House\\Chuckie vs. New Order - Let The Confusion Bass In Miami Bitch (Dani Veiga Bootleg)[Most Be]\nVA- Club House\\Clockwork - Weaver (Original Mix) [Most Be]\nVA- Club House\\Cobra Starship ft. Sabi - You Make Me Feel [Most Be]\nVA- Club House\\Connect-R - Ring The Alarm (Radio Edit)[Most Be]\nVA- Club House\\Crush &amp;  Alexandra feat Evan - I Need U More (Extended Version)[Most Be]\nVA- Club House\\David Puentez Vs Alex Gaudino -Melodrama In Love (Mark Vox &amp; Malexes Bootleg)[Most Be]\nVA- Club House\\Ekow feat. Snoop Dogg and Kylian Mash - Closer ('Original' Extended Version)[Most Be]\nVA- Club House\\Felguk Vs. Prodigy Meets Dj Eddie - Good Fergalicious (Ruslanio Tarr 2011 Bootleg)[Most Be]\nVA- Club House\\Hardwell vs Dimitri Vegas &amp; Like Mike - X World (Simon D Bootleg)[Most Be]\nVA- Club House\\Jennifer Lopez feat. Pitbull - On The Floor  (DJ Half Summer Mix)[Most Be]\nVA- Club House\\Katy Perry - Last Friday Night (Reynaldo Klawa Party Anthem Remix)[Most Be]\nVA- Club House\\Lady Gaga - Edge Of Glory (nOesis Boot Mix)[Most Be]\nVA- Club House\\Lady Gaga - The Edge Of Glory (ErekMcQueen 'Closer Than Ever' Instrumental Mix)[Most Be]\nVA- Club House\\Lady Gaga vs Flo Rida - Monsterclub (Sunday Morning Vocal Mashup)[Most Be]\nVA- Club House\\Leona Lewis - Born To Collide This Way (Steamweaver Extended Mix)[Most Be]\nVA- Club House\\Leona Lewis - Collide (Afrojack Festival Remix)[Most Be]\nVA- Club House\\Leona Lewis - Collide (Steamweaver Penguin Booty)[Most Be]\nVA- Club House\\LMFAO vs David Guetta - The World Is My Party Rock (Skiavo 2k11 Mashup)[Most Be]\nVA- Club House\\Louis Armstrong - Go Down Moses (DJ Zed Remix)[Most Be]\nVA- Club House\\Manufactured Superstars feat. Selina Albright - Serious (Extended Mix)[Most Be]\nVA- Club House\\Martin Solveig vs SHM &amp; LBL - Ready 2 Leave The World Behind (Dylan Main Room Edit)[Most Be]\nVA- Club House\\Mike Candys &amp; Jack Holiday - One More Time (Arex &amp; MikiG Bootleg Mix)[Most Be]\nVA- Club House\\Mike Candys - Together Again (Julian Milio &amp; Bastien Rebba 2011 Rework)[Most Be]\nVA- Club House\\Modjo vs. Javi Mula - Come On Lady (JosÃƒÂ© Zapata Mashup)[Most Be]\nVA- Club House\\Rihanna - Only Girl (Marcin D Mix)[Most Be]\nVA- Club House\\Robbie Rivera Feat. Laura Vane - In Too Deep (Che Jose Mix)[Most Be]\nVA- Club House\\Robbie Rivera Feat. Laura Vane - In Too Deep (Pink Fluid Mix)[Most Be]\nVA- Club House\\Sak Noel &amp; Waveshock - Loca People (What Do You Say DjPatro Mash-Up)[Most Be]\nVA- Club House\\Scotty ft. Salt &amp; Fire - Pirates of the caribbean (Pavel Mania Mashup)[Most Be]\nVA- Club House\\Steve Angello - Knas (David Mills Remix)[Most Be]\nVA- Club House\\TempleCloud - One Big Family (Digital Dog Club Mix)[Most Be]\nVA- Club House\\Tony Gomez vs. Afrojack - Tell Me Bangduck (JosÃƒÂ© Zapata Bootleg)[Most Be]\nVA- Electro House Bootlegs\\Abel Ramos Vs. R. Sansixto - Let's go 2 Harmonica song (DjZar Mash Up 2011) [Most Be]\nVA- Electro House Bootlegs\\Arcanix &amp; Beattraax &amp; Eddie Allen - Tomorrow Is Waiting For You (Arcanix vs Beattraax Club Mix) [Most Be]\t\nVA- Electro House Bootlegs\\Arti S &amp; Javi Mula - Summer Come On (Mikey Mash Up) [Most Be]\nVA- Electro House Bootlegs\\Benny Benassi &amp; Far East Movement - Like A Satisfaction (JosÃƒÂ© Zapata Bootleg) [Most Be]\nVA- Electro House Bootlegs\\BeyoncÃƒÂ©, Rihanna And Britney - Girls In Sadomasochism (Jr Matta Mash-Up) [Most Be]\nVA- Electro House Bootlegs\\Britney Spears - Till The World Ends (Luis Erre Mash Up Mix) [Most Be]\nVA- Electro House Bootlegs\\Cassey Doreen - Girls Just Want To Have Fun (DJ Newklear Mashup Mix) [Most Be]\nVA- Electro House Bootlegs\\Coldplay - Every Teardrop Is A Waterfall (Dani L. Mebius Bootleg) [Most Be]\nVA- Electro House Bootlegs\\David Guetta ft Nicky Minaj vs. Florida - Turn Dem Girls Around ( BumberSh00t Dj's MashUp Mix) [Most Be]\nVA- Electro House Bootlegs\\David Puentez Vs Alex Gaudino -Melodrama In Love (Mark Vox &amp; Malexes Bootleg) [Most Be]\nVA- Electro House Bootlegs\\David Tort vs. Dirty South feat. Rudy - One Phazing (Dirty South Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Enur - Calabria (Sean Taylor Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Hardwell vs Dimitri Vegas &amp; Like Mike - X World (Simon D Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Henrik B vs David Tort &amp; Norman Doray - Chase The Acid Rocker (Basti M &amp; Micha Moor Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Jesse Garcia, Corey Andrew Vs. Salome De Bahia - Stormy Outro Lugar (Erick Decks Private Mashup) [Most Be]\nVA- Electro House Bootlegs\\Lady Gaga - Edge Of Glory (nOesis Boot Mix) [Most Be]\nVA- Electro House Bootlegs\\Laidback Luke, Chuckie &amp; LMFAO - Hey! Im In Miami Bitch (JosÃƒÂ© Zapata Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Leona Lewis vs Avicii - Col-lide (Brian Cua's Dark Bootleg Mashup) [Most Be]\nVA- Electro House Bootlegs\\LMFAO vs David Guetta - The World Is My Party Rock (Skiavo 2k11 Mashup) [Most Be]\nVA- Electro House Bootlegs\\Lolita - Joli Garson 'Milkshake' 2011 (Artex 'Private' Mash Up) [Most Be]\nVA- Electro House Bootlegs\\Martin Solveig ft Dragonette &amp; Idoling - Big In Japan (Ziggy Stardust Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Michal Lazar &amp; Kid Rusty vs 3rd- Face Canto Della Liberta  Funk It (KaCzi Mashup) [Most Be]\nVA- Electro House Bootlegs\\Modjo vs. Javi Mula - Come On Lady (JosÃƒÂ© Zapata Mashup) [Most Be]\nVA- Electro House Bootlegs\\Mr. Basic &amp; Tony Tweaker Vs. Far East Movement - Like A G6 (Ruslanio Tarr Re-Boot) [Most Be]\nVA- Electro House Bootlegs\\Nicole Sherzinger &amp; Sidney Samson &amp; Marco V - Right There Dynamite (Mr. Gregor Mash Up 2011) [Most Be]\nVA- Electro House Bootlegs\\Sak Noel - Loca People (Dj Kalinin Mash-up) [Most Be]\nVA- Electro House Bootlegs\\Sak Noel vs Alex Lamb, Andy Harding, Filip Sjoo - No Such Thing As Loca People (Alex Sayz Mash) [Most Be]\nVA- Electro House Bootlegs\\Scotty ft. Salt &amp; Fire - Pirates of the caribbean (Pavel Mania Mashup) [Most Be]\nVA- Electro House Bootlegs\\Swedish House Mafia - Save The World (Cazzette Bootleg) [Most Be]\nVA- Electro House Bootlegs\\The Prodigy - Everybody In The Place (Bingo Players Bootleg) [Most Be]\nVA- Electro House Bootlegs\\Tony Gomez vs. Afrojack - Tell Me Bangduck (JosÃƒÂ© Zapata Bootleg) [Most Be]\n","torrent":{"xt":"urn:btih:d9c1431849baa517b98f014f25b5b2555040d724","amp;dn":"DJ+Most+B+present+Music+Pack+Vol.4+August-2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9c1431849baa517b98f014f25b5b2555040d724","infoHashBuffer":{"type":"Buffer","data":[217,193,67,24,73,186,165,23,185,143,1,79,37,181,178,85,80,64,215,36]},"announce":[],"urlList":[]}}