{"title":"Drift","uid":7854283,"size":228108171,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:db4645d8db991aeb18eaf8d2c206e24689a88b68&amp;dn=Drift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353699354,"description":"&quot;One of my favorite ideas is, never to keep an unnecessary soldier,&quot; Thomas Jefferson wrote in 1792. Neither Jefferson nor the other FoundÂ­ers could ever have envisioned the modern national security state, with its tens of thousands of &quot;privateers&quot;; its bloated Department of Homeland Security; its rustÂ­ing nuclear weapons, ill-maintained and difficult to dismantle; and its strange fascination with an unproven counterinsurgency doctrine. \n\nWritten with bracing wit and intelligence, Rachel Maddow's Drift argues that we've drifted away from America's original ideals and become a nation weirdly at peace with perpetual war, with all the financial and human costs that entails. To understand how we've arrived at such a dangerous place, Maddow takes us from the Vietnam War to today's war in Afghanistan, along the way exploring the disturbing rise of executive authority, the gradual outsourcing of our war-making capabilities to private companies, the plummeting percentage of American families whose children fight our constant wars for us, and even the changing fortunes of G.I. Joe. She offers up a fresh, unsparing appraisal of Reagan's radical presidency. Ultimately, she shows us just how much we stand to lose by allowing the priorities of the national security state to overpower our political discourse. \n\nSensible yet provocative, dead serious yet seriÂ­ously funny, Drift will reinvigorate a &quot;loud and jangly&quot; political debate about how, when, and where to apply America's strength and power--and who gets to make those decisions.","torrent":{"xt":"urn:btih:db4645d8db991aeb18eaf8d2c206e24689a88b68","amp;dn":"Drift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4645d8db991aeb18eaf8d2c206e24689a88b68","infoHashBuffer":{"type":"Buffer","data":[219,70,69,216,219,153,26,235,24,234,248,210,194,6,226,70,137,168,139,104]},"announce":[],"urlList":[]}}