{"title":"Pump User's Handbook - Life Extension 3rd ed","uid":12624337,"size":19625837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db557c4fd73d12bb1d52b9b58dd882cdb623919c&amp;dn=Pump+User%27s+Handbook+-+Life+Extension+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1445652644,"description":"Pump User's Handbook - Life Extension 3rd ed - Heinz P. Bloch, Allan R. Budris (Fairmont, 2010).pdf\r\n\r\nISBN 9781439837405\r\n\r\nNow available in its fully revised third edition, this practical guide explains how to achieve consistently superior run lengths, low maintenance expenditures, and unexcelled safety and reliability in all of your pump applications. Written by two practicing engineers whose combined 80-years of experience include all conceivable facets of pumping technology, this handbook details what facilities must do to achieve superior performance and low life-cycle cost for pumps of all types and sizes.\r\n\r\nThe Pump User’s Handbook: Life Extension, Third Edition includes updates on straight-pipe requirements upstream of pump suction nozzles, details on temporary suction strainers, control strategies, detailed explanations and fully illustrated coverage of all API seal plans in use today, and case studies in mechanical seal upgrading. The demonstrated vulnerability of traditional oil slinger rings is contrasted against the sound rationale of solid oil flinger discs widely used in Europe. Small-scale oil mist lubrication units are highlighted and new field-installed pump vibration limits are tabulated.\r\n\r\nThis new edition maintains a focus on modern canned motor pumps that now range to 700 hp and pressures in excess of 2000 psi. Recessed impeller pumps with advantageous axial-spiral discharge volutes and energy-efficient &quot;Split-Flow&quot; pumps are explained. The text also provides details on combining pump maintenance with systematic upgrading.\r\n\r\nAimed at operating technicians, maintenance professionals, project engineers, reliability engineers and managers, the book is intended for every job function that comes in contact with process pumps. Utilities, power generation facilities, pulp and paper plants, consumer product manufacturers, pharmaceutical plants, mining operations, chemical and petrochemical plants, municipal works, oil and gas pipelines, and oil refineries are among those that can significantly profit from implementing the guidelines described in this unique, experience-based text","torrent":{"xt":"urn:btih:db557c4fd73d12bb1d52b9b58dd882cdb623919c","amp;dn":"Pump+User%27s+Handbook+-+Life+Extension+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db557c4fd73d12bb1d52b9b58dd882cdb623919c","infoHashBuffer":{"type":"Buffer","data":[219,85,124,79,215,61,18,187,29,82,185,181,141,216,130,205,182,35,145,156]},"announce":[],"urlList":[]}}