{"title":"One Tree Hill 6x01[HDTV][English].avi","uid":4375761,"size":367401964,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db7a916ad69c19a08d545185a008e28a5f5ad53e&amp;dn=One+Tree+Hill+6x01%5BHDTV%5D%5BEnglish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1220397795,"description":"La historia comienza en un pequeÃƒÆ’Ã‚Â±o pueblo de Carolina del Norte llamado Tree Hill. Lucas y Nathan son dos chicos completamente diferentes, exceptuando su aficiÃƒÆ’Ã‚Â³n por el baloncesto y que son hijos de un mismo padre, Dan. Nathan es el lÃƒÆ’Ã‚Â­der del equipo de baloncesto del instituto y proviene de una familia acomodada. Por el contrario, Lucas fue criado desde su infancia por su madre soltera, dueÃƒÆ’Ã‚Â±a de un cafÃƒÆ’Ã‚Â© local, y juega al baloncesto en las canchas de su barrio.\n\nLucas, debido a sus buenas cualidades como jugador de baloncesto, consigue entrar en el equipo del instituto, los Ravens, y que es capitaneado por Nathan, que ridicualiza a su hermano por sus orÃƒÆ’Ã‚Â­genes humildes, provocando roces entre ambos. En los primeros capÃƒÆ’Ã‚Â­tulos se muestra como Lucas siente una atracciÃƒÆ’Ã‚Â³n por la novia de Nathan, Peyton, y por otro lado, el propio Nathan empieza a recibir clases particulares de Haley, la mejor amiga de Lucas, debido a su deficiente rendimiento escolar. Nathan que en un principio empieza seducir a la chica para fastidiar a su hermano, empieza a tener sentimientos hacia ella que son correspondidos, lo que provoca aÃƒÆ’Ã‚Âºn mÃƒÆ’Ã‚Â¡s roces entre ÃƒÆ’Ã‚Â©l y Lucas.\n\nEn lo que concierne a los personajes adultos hay que destacar el matrimonio que mantienen Dan y Deb, matrimonio que empieza tras quedar ÃƒÆ’Ã‚Â©sta embarazada de Nathan durante su etapa universitaria. En su etapa en el instituto, Dan tambiÃƒÆ’Ã‚Â©n habÃƒÆ’Ã‚Â­a dejado embarazada a Karen, del que nace Lucas, pero decide abandonar a Karen con el cuidado del bebÃƒÆ’Ã‚Â©, puesto que preferÃƒÆ’Ã‚Â­a seguir su carrera de baloncesto en la universidad, dadas sus cualidades deportivas. Keith, hermano de Dan, ayuda a Karen en toda la etapa de crecimiento de Lucas, llegando este a considerarlo como un padre. Keith estÃƒÆ’Ã‚Â¡ enamorado de Karen, incluso durante el instituto.\n\nEn la 4a temporada aparecen nuevos presonajes que se convierten en secundarios.","torrent":{"xt":"urn:btih:db7a916ad69c19a08d545185a008e28a5f5ad53e","amp;dn":"One+Tree+Hill+6x01%5BHDTV%5D%5BEnglish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db7a916ad69c19a08d545185a008e28a5f5ad53e","infoHashBuffer":{"type":"Buffer","data":[219,122,145,106,214,156,25,160,141,84,81,133,160,8,226,138,95,90,213,62]},"announce":[],"urlList":[]}}