{"title":"Music Maker Jam v1.0.7.3 [Free IAP].apk","uid":10082506,"size":19174031,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:dbe25144cc15754124be9ba359d8f6d6c605f14a&amp;dn=Music+Maker+Jam+v1.0.7.3+%5BFree+IAP%5D.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill420smoker","files":-1,"time":1399036810,"description":"Touch it. Mix it. Share it.\n\nMusic Maker Jam, the free new music maker app from MAGIX, makes it easy to start playing with music and mixing your own songs in no time. From the start screen chose a music style and begin mixing instrument loops to create your unique combination of sounds.\n\nChoose from thousands of professionally produced loops and live edit on an 8 track mixing board. Adjust tempo and key or apply cool sound effects in real time. Shake your smartphone or tablet to randomly choose new loops and mix up your current song or inspiration for a new music project.\n\nMusic Maker Jam offers you an intuitive user experience enabling you to take quick control of your music production. And beat matching ensures your loops are always perfectly matched. Included are four free styles: Hip Hop, Dance, Electric Jazz, and Rock Ballads with over 1000 professional loops to start you jamming and experimenting.\n\nExpand your pocket sound studio with other styles available for purchase including: Dubstep, Drum&amp;Bass, Techno, Movie Score, House, Metal, and much more. With over 1000 loops to start with, the possibilities are unlimited; define new genres of music by mixing and matching loops from different style packs.\n\nWhether you are interested in quiet instrumentals, guitar driven rock, or sweaty techno for the club - anything is possible with this free music app. You can easily store and save your jam session to pick up later or export a recording to share with friends. Music Maker Jam is free and available for Android Tablets and Smartphones running Android 4.0 or higher.\n\nHighlights:\n- 4 free musical styles including over 1000 instrument and sound loops: Hip Hop,\n  Dance, Rock &amp; Jazz\n- Purchase more styles and upgrade your loop library to include Dubstep, Drum&amp;Bass,\n  Techno, Movie Score, House, Metal and more\n- Mix loops from different styles to create your own musical genre\n- Shuffle and mix loops on an 8 channel mixer board\n- Adjust tempo and key\n- Tilt It: Real time sound effects can be applied using a tilt function sound board\n- Shake it: Loops can be randomly chosen by shaking your phone\n- Record and export a song to upload to social media channels and share with\n  friends\n- Customize your environment with background images\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.magix.android.mmjam&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.magix.android.mmjam&lt;/a&gt;\n\n\n* Free in-app purchases (see below)\n\n\nNOTE:\n\nIn-app purchases can be conducted free of charge, however purchased styles do not stay purchased upon closing the app. You must re-purchase the styles each time the app is opened, but you only need to download the style the first time. In addition, any styles used in a project must be re-purchased prior to loading the project.\n\nCurrently this is the same behavior exhibited via Freedom as well.\n\n\nCAUTION:\n\nThis app will download an additional 80MB upon first launch and each style is around 50MB.\n\n\nINSTRUCTIONS:\n\n1. Download, install, and run the apk.\n2. Select a style from New Styles and click Buy.\n3. Dismiss the error dialog.\n4. Style is now downloading in Styles section.\n5. Enjoy!","torrent":{"xt":"urn:btih:dbe25144cc15754124be9ba359d8f6d6c605f14a","amp;dn":"Music+Maker+Jam+v1.0.7.3+%5BFree+IAP%5D.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe25144cc15754124be9ba359d8f6d6c605f14a","infoHashBuffer":{"type":"Buffer","data":[219,226,81,68,204,21,117,65,36,190,155,163,89,216,246,214,198,5,241,74]},"announce":[],"urlList":[]}}