{"title":"Mental Causation and Ontology (2013) {=IMPAVIDUS=}","uid":11344851,"size":1197774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc1e69cbf6010fbd36ff6f0170bb83d1ff7da0d4&amp;dn=Mental+Causation+and+Ontology+%282013%29+%7B%3DIMPAVIDUS%3D%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sunghabib","files":-1,"time":1414847088,"description":"Book Description:\n\nAn international team of contributors presents new work on the importance of ontology for a central debate in philosophy of mind. Mental causation has been a hotly disputed topic in recent years, with reductive and non-reductive physicalists vying with each other and with dualists over how to accommodate, or else to challenge, two widely accepted metaphysical principles--the principle of the causal closure of the physical domain and the principle of causal non-overdetermination--which together appear to support reductive physicalism, despite the latter's lack of intuitive appeal. Current debate about these matters appears to have reached something of an impasse, prompting the question of why this should be so. One possibility is that, while this debate makes extensive use of ontological vocabulary--by talking, for instance, of substances, events, states, properties, powers, and relations--relatively little attempt has been made within the debate itself to achieve either clarity or agreement about what, precisely, such terms should be taken to mean. The debate has become somewhat detached from broader developments in metaphysics and ontology, which have lately been proceeding apace, providing us with an increasingly rich and refined set of ontological categories upon which to draw, as well as a much deeper understanding of how they are related to one another. In this volume, leading metaphysicians and philosophers of mind reflect afresh upon the problem of mental causation in the light of some of these recent developments, with a view to making new headway with one of the most challenging and seemingly intractable issues in contemporary philosophy.\n\nProduct Details:\n\nPDF: 281 pages\nPublisher: Oxford University Press (May 19, 2013)\nLanguage: English\nISBN-10: 0199603774\nISBN-13: 978-0199603770\nAmazon Link:\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up","torrent":{"xt":"urn:btih:dc1e69cbf6010fbd36ff6f0170bb83d1ff7da0d4","amp;dn":"Mental+Causation+and+Ontology+%282013%29+%7B%3DIMPAVIDUS%3D%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1e69cbf6010fbd36ff6f0170bb83d1ff7da0d4","infoHashBuffer":{"type":"Buffer","data":[220,30,105,203,246,1,15,189,54,255,111,1,112,187,131,209,255,125,160,212]},"announce":[],"urlList":[]}}