{"title":"Kevin Kern - Embracing the Wind [NewAge][mp3 320][h33t][schon55]","uid":4647887,"size":113346290,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc796dce33cbe424bbfdc124dc3b3f0b9d84194a&amp;dn=Kevin+Kern+-+Embracing+the+Wind+%5BNewAge%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":15,"time":1231947478,"description":"Kevin Kern - Embracing the Wind\nAudio CD: April 3, 2001 \nOriginal Release Date: April 3, 2001 \nLabel: Real Music \nBitrate: 320 kbps\n\nKevin's Kern's fifth album, Embracing the Wind, is a collection of inspired emotional themes, deftly articulated through soft piano, warm rhythms, and acoustic guitar. The opening track, &quot;Blossom on the Wind,&quot; begins with the gentle sound of a raindrop, a single note of stillness that sets the mood of this effort. For this particular work, Kern and producer Terence Yallop returned to the original source of their inspiration, the piano itself. With a tape continually running to capture each moment of expression, Kern and Yallop tapped into their own familiar wellspring of feeling, from the uplifting &quot;Bathed in Dawn's Light,&quot; to the passionate &quot;From This Day Forward,&quot; a piece that Kern composed for his fiancÃƒÂ© in honor of their wedding day. While Embracing the Wind is a reflection of Kern's self-described &quot;musical journey&quot; through a myriad of influences, it maintains a classic simplicity of sound and arrangement built around a well-balanced framework of song structures. It's plain to see that he's grown considerably out of the first wobbling steps of New Age music into his own right as a composer and a pianist. Embracing the Wind is Kern's own acknowledgement of his coming-of-age as an artist, and like most things that get better with time, &quot;Embracing the Wind&quot; is to be savored slowly, appreciated newly again with each listen. ~ Leslie R. Marini\n\nThis is the second album of Kern's that I've spent time with, the first being Beyond the Sundial done some three years previously. The years have made Kern a bit less dry and jazzy, although he doesn't quite make the leap into overheated romanticism, much to my relief. There is a thin line between new age slush and good popular piano work, and Kern manages to stay on the good side. \n\nHe will even fool you a bit. 'A Gentle Whisper' starts out with a string chorus that you know is going to go over the edge, and just when you think all is lost, Kern cuts across the theme with his piano and everything falls into place. The touches of Burt Bacharach are still that as well, especially in 'From This Day Forward.' Kern has a tendency towards pretentious song titles, but don't be fooled. \n\nAs is often the case, Kern gets help from a few of his friends, but it is guitarist Davis Ramey who runs away with the show. 'Through Your Eyes' is an outstanding, and complicated duet where both Davis and Kern manage to show off their ability to put music together. Davis also appears in 'Bathed in Dawn's Light', and 'A Secret Grove,' but neither touch the power of the first piece. \n\nThe album stands up to repeated listening well, which suits my listening style well, since albums tend to stay cued up on my iPod for some time. I intend to explore more Kern as soon as I'm able. ~ Marc Ruby\n\nKevin Kern - Embracing the Wind Tracklist:\n01 Blossom on the Wind 05:44\n02 Through Your Eyes 03:50\n03 Childhood Remembered 04:31\n04 The Silence of Knowing 04:33\n05 Above the Clouds 05:28\n06 Bathed in Dawn's Light 05:12\n07 From This Day Forward 04:52\n08 A Secret Grove 05:16\n09 Fantasia's Lullaby 03:46\n10 A Gentle Whisper 04:04","torrent":{"xt":"urn:btih:dc796dce33cbe424bbfdc124dc3b3f0b9d84194a","amp;dn":"Kevin+Kern+-+Embracing+the+Wind+%5BNewAge%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc796dce33cbe424bbfdc124dc3b3f0b9d84194a","infoHashBuffer":{"type":"Buffer","data":[220,121,109,206,51,203,228,36,187,253,193,36,220,59,63,11,157,132,25,74]},"announce":[],"urlList":[]}}