{"title":"Microsoft Windows XP Home Edition (Integrated With Service Pack","uid":6100938,"size":342163456,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dda1a8f56bf061b81d90de2433f80cfd79a605ee&amp;dn=Microsoft+Windows+XP+Home+Edition+%28Integrated+With+Service+Pack+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SanctusSecurity","files":1,"time":1294962079,"description":"Sanctus Security is proud to present this special copy of Microsoft Windows XP.\n\n\n\n\n\nMany other copies of Windows XP that you will find on the torrents are filled with viruses, loggers, etc. They may come with an incorrect product key, or with a non working activation patch. This copy of Windows XP was made from a Dell Dimension 8300 re-installation disc, and modified with nLite, so no product key is needed to install. This copy of XP Home Edition will be Pre-Activated on your first user logon using a special method of activation.\n\n\n\n\n\nFeatures Of This Copy:\n\n\n1. Integrated With SATA HDD drivers, so you should have no issues installing to a SATA hard drive.\n\n2. Activated silently during the first user logon, and no product key needed to install.\n\n3. Older and useless features removed to make a very small ISO disc image.\n\n4. Fully functional and genuine copy of Windows XP Home Edition (SP3) 32 (x86) Bit\n\n5. No worries about an update overwriting the activation patch, so you can continue to use Windows Update.\n\n6. Password protected Administrator account, since many people forget to do this, leaving their OS vulnerable.\n\n7. Administrative shares disables, reducing some risk of a hacking attack.\n\n8. Used nLite to remove only a few useless features to make a very small ISO File.\n\n9. And just in case you do need the product key, here it is...\n\n\n\n\nRCBF6-6KDMK-GD6GR-K6DP3-4C8MT\n\n\nAdministrator Password: sd09enss1\n\n\n\n\nNOTE: Leave the installation disc inside the computer until after you have logged on to your user account, and have checked to see the activation. The patch is copied from the installation disc onto the computer after you log on the first time. Once at the desktop, click the start menu, then &quot;Run&quot;, and then type &quot;oobe/msoobe /a&quot; to check the activation.\n\n\n\n\nI hope you enjoy this copy of Windows XP!\n\n\n\n\n---CyberFerret32 (Head Of Sanctus Security) (1/13/2011)\n\n\nPlease seed!","torrent":{"xt":"urn:btih:dda1a8f56bf061b81d90de2433f80cfd79a605ee","amp;dn":"Microsoft+Windows+XP+Home+Edition+%28Integrated+With+Service+Pack+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda1a8f56bf061b81d90de2433f80cfd79a605ee","infoHashBuffer":{"type":"Buffer","data":[221,161,168,245,107,240,97,184,29,144,222,36,51,248,12,253,121,166,5,238]},"announce":[],"urlList":[]}}