{"title":"NormaCS 7-12 DVD - Russian standarts","uid":4429263,"size":25592769301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddec717fe4c0aa56d509d1ed7725b4f3a76367e5&amp;dn=NormaCS+7-12+DVD+-+Russian+standarts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bill_g","files":132,"time":1223202059,"description":" &lt;a href=&quot; http://www.normacs.ru/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.normacs.ru/&lt;/a&gt;\n\nincluded:\n  &lt;a href=&quot;\nhttp://htcenter.e-stile.ru/normacs-parts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://htcenter.e-stile.ru/normacs-parts&lt;/a&gt;\n\n\n\n\n\nThe program is designed to store, search and display text and details of regulatory documents, as well as the standards applied in the territory of the Russian Federation and regulating the activity of enterprises of different industries. \n\nNormaCS provides authentic texts of legal and technical documents stored in a database program. The completeness and relevance of the database, thoughtful interface and convenient mechanism for displaying information can solve any problems connected with the search of the instrument. The high level of service provided to users of the program, offer advantages attributive and full database, the availability of image copies of the official publication of documents and breadth of coverage of various industries. Now communicate with office products and other accounting-graphic-aided design programs, developed by CSoft Development. \n\nNormaCS gives the user a wide range of tools and features: \nInformation completeness \nAuthoritative texts they were receiving from the institutions - the developers of standards. \nThe universal information space regulations and standards, regardless of the number of installed bases, cross-movement of hyperlinks. \nGraphic display signs of the status of a document (in effect, no effect, the draft). \nAmple opportunity for the various databases. \nThe completeness of coverage of rules and standards applied in different industries (in database software, including more than 27 thousand GOSTov and many other documents). \nThe total number of cards documents exceeds 55 thousand, a number of texts - 43 thousand. \nThe storage and display of amendments and changes to the text of the document. \nThe possibility of analyzing the document links with other regulations and standards. \nAccess to the norms and standards in on-line. \nTrace Simplify norms and standards (user programs do not have to deal with requests for information centers of various ministries and departments). \nThe ability to create and maintain custom folders with the support of the hierarchy. \nRegular information services (the user selects the frequency of update information contained in the database). \nSupport for current status of instruments (cancellations documents are not removed from the database and can be used as background material). \n\nAmple opportunities for searching documents \nHigh speed retrieval of attributes (name, type, index, number, name of the organization adopted the document as well as keywords, dates of entry, approval, etc.). \nSearch by title, taking into account the morphology of Russian language \nIntelligent search by ID \nSearch multiple indexes and organizations and creating teams to re-use \nFull-text search (including text). \nSearch by subject, to which a document classified in accordance with the classification. \nThe ability to create search queries. \nPreparation of samples for multiple conditions (including attachments). \nUsing conventional and expanded search options. \nThrough search all connected databases based on any, even the snatches of the document that helps you find the necessary documents for a few seconds. \nThe possibility of transition to a classifier, where before it found the document. \nStorage of previous searches. \nThe possibility of output to print. \n\nIntegration with office and design applications \nCitation of documents (text, pictures, tables) in office applications. \nThe export documents in Microsoft Word by pressing a button. \nExport documents in OpenOffice.org Writer a single click. \nCopying images of pages of graphics copy via the clipboard. \nOpening of legal documents through hyperlinks from the user&amp;#039;s documents Word, Ehsel, Autocad drawings and any other applications. \nAutomatic placement of links to legal documents in MS Word. \nChecking the validity of links. \nSearch on the basis of legal documents directly from office applications. \nWork is under way to integrate with OpenOffice. \nCreate your own database of documents / organization. \nEfforts to reconcile with the system documentation TDMS. \n\nFeatures Interface \nThe interface is set up in accordance with the wishes of the user. \nThe ability to customize the display details (card) document. \nVarious service opportunities (sorting papers on various attributes in the sections on search results, customizable user environments, different filters). \nDisplaying the document in the form of printed pages, or hypertext. \nRotation, smoothing, scaling graphics document. \nThe unique system to improve the quality of bad printed originals. \nSetting the format and type of display columns containing a list of documents in the classifier, and search results. \nWork in the single and online (in turn subdivided into line Intranet-and Internet-options). \nConservation workers settings when you exit the program. \nThe history of access and selected papers. \nA single interface for local, network and Internet-versions. \n\nFeatures online \n&quot;Floating&quot; license \nPriorities and the delineation of user access \nHistory and audit \nSafety data on the server \nThe minimum burden on the administrator","torrent":{"xt":"urn:btih:ddec717fe4c0aa56d509d1ed7725b4f3a76367e5","amp;dn":"NormaCS+7-12+DVD+-+Russian+standarts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddec717fe4c0aa56d509d1ed7725b4f3a76367e5","infoHashBuffer":{"type":"Buffer","data":[221,236,113,127,228,192,170,86,213,9,209,237,119,37,180,243,167,99,103,229]},"announce":[],"urlList":[]}}