{"title":"trisquel_5.0-i18n_amd65.iso","uid":8910034,"size":1276116992,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:de95a40cd8693409e814c37b52c3a090ad8061cb&amp;dn=trisquel_5.0-i18n_amd65.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1378998020,"description":" How can I get Trisquel? How much does it cost?\n\nIt's just a download away, free of charge. If you enjoy Trisquel GNU/Linux we hope you will support it either with a one time donation or become a Trisquel Associate Member and support the project with a recurring donation.\nI notice this website refers to Trisquel as a distribution of &quot;GNU/Linux&quot; and not &quot;Linux&quot;. Why?\n\nThere is a long-standing naming controversy. Most people who use the system today don't know that what they're actually using is the GNU system combined with the kernel Linux. For many years, the media and the user community itself has given undue weight to the contributions that come from Linus Torvalds' camp and fostered a skewed account of the operating system's history, while barely acknowledging the existence of the GNU project at all. The GNU project was started in 1984 by Richard Stallman to develop a complete free operating system, because none existed at the time. Its design closely followed that of Unix because Unix was highly machine-portable and (at that time) pervasive. Linus Torvalds did not write a whole operating system, he only wrote the last missing piece, a kernel, and he only did that in the first place because development of Hurd, the GNU project's own kernel, was lagging behind (and has not been completed to this day). Torvalds didn't write the kernel because of a belief in &quot;open source&quot;, a term that wasn't even coined until 1998 and misses the point of free software, and he originally released it in 1991 under a proprietary license until he was persuaded to relicense it under the GPL the next year. Saying &quot;GNU/Linux&quot; instead of &quot;Linux&quot; is fairer and more accurate. Without the irreplaceable software contributed by the GNU project âˆ’ and even more importantly, the founding ideas of freedom âˆ’ the system most mistakenly call &quot;Linux&quot; would not exist. It's that simple.\nWhy should I use Trisquel instead of one of the better-known distributions?\n\nThere are literally hundreds of GNU/Linux distributions designed to fill every conceivable niche. Only a handful of them are entirely free software; Trisquel is one such distribution. That's why Trisquel is endorsed by Richard Stallman and the Free Software Foundation.\n\nThe popularity of GNU/Linux has skyrocketed in recent years. The major distributions are attracting large numbers of new users, but their distributors are not taking the opportunity to effectively teach these same users to value and protect their freedom. Our software is being advocated on purely utilitarian grounds (such as portability, stability, security, customizability, and lack of cost), so the casual observer is led to believe that &quot;Linux&quot; is just another OS, albeit a useful one. While it may appear to be a reasonable compromise for big-name distros like Ubuntu and Fedora to include some nonfree firmware, drivers, and applications in their mostly-free systems for which no complete free drop-in replacements exist, time and experience demonstrates that this only perpetuates the problem. If we want free software alternatives to emerge, our community must actively reject the non-free counterparts.\n\nTrisquel is different. We naturally want to bring you an operating system that is tight, beautiful, and robust. We want your software to be feature-rich and work exactly as you expect it to. But we'll never compromise your freedom, either.\nHow can I help the project?\n\nIn many ways! Here are some:\nUsing Trisquel, and sharing it with your friends and family\nReporting issues and bugs that you find, and suggesting improvements\nHelping in the forums\nWriting and translating documentation\nMaking a donation\nBecoming an associate member\nBuying some T-shirts and other gear at our store\nTranslating applications\nIf you have experience developing software, helping in the maintenance of the system\n\nIf you would like to volunteer, write us.\nWhich languages is Trisquel available in?\n\nTrisquel was born in the Galicia region of Spain, so the primary language was Galician, and Castilian and English were also included. In version 2.0, Catalan and Basque were added, and in version 3.0 Portuguese, French, Hindi, and Chinese were added. From version 4.0 forward, only English and Spanish are installed by default to save disk space, but an international edition is available with ~50 translation sets.\n\nThe installer lets you select numerous other languages to be downloaded and configured during the installation process. Extra languages can also be installed from the Main Menu (bottom left) via System â†’ Administration â†’ Language Support.\nWhat is Trisquel?\n\nTrisquel GNU/Linux is a 100% free operating system. It comes with a complete selection of programs that can be easily extended using a graphical installer. There are several editions available, including the &quot;mini&quot; edition for netbooks and old computers and the network based installer for custom and server installations.\nHow can I get help and support?\n\nTrisquel GNU/Linux includes support and manuals. The website includes documentation and support forums that function as convenient front-ends for mailing lists.\n\nAlso, the Trisquel project has an official IRC (Internet Relay Chat) channel named #trisquel on irc.freenode.net that anyone can join. Just follow this howto\n\nIf you want to recruit support for your business or school, team Sognus (business partner of the project) can give you the help you need.\nWhat does it mean to be free software?\n\nFree software, unlike proprietary, respects its users essential rights, to ensure they can:\n\n    run the program, for any purpose\n    study how the program works, and adapt it to their needs (which requires having access to the program's source code).\n    redistribute copies so they can help others, with or without a fee\n    distribute copies of their modified versions to others, so that the whole community can benefit. Again, access to the source code is a precondition for this.\n\nFree software is a matter of freedom, not price, although free software is usually distributed at no charge. Think &quot;free&quot; as in &quot;free speech&quot;, not &quot;free beer&quot;.\n\nMany free software programs are copylefted. Copyleft is used by some free software licenses (most notably the GNU GPL) to protect the freedom to redistribute the program by requiring all modified and extended versions of the program to be free as well. It is a reversal of the typical use of copyright law (prohibiting others from reproducing, adapting, or distributing copies of a work), hence the name. Non-copyleft free software also exists. It is better to use copyleft in most cases, but if a program is non-copylefted free software, it is still basically ethical.\nDoes Trisquel include proprietary software?\n\nNo, none whatsoever. If you find any part of the system not covered by a free license, let us know and we will replace or remove it.\n\nNote in particular that no binary-only firmware for wireless cards or proprietary drivers for AMD/ATI and NVIDIA graphics cards are included.\nHow was this project born?\n\nTrisquel is an open project set in motion within the University of Vigo in Spain, of which later became independent to be maintained by a volunteer community. The project was born out of the necessity to create an educational operating system with Galician language support, but its scope rapidly grew towards offering a fully free operating system for international use. It was officially presented on April 2005 with the presence and support of Richard Stallman, founder of the Free Software Foundation.\nHow is &quot;Trisquel&quot; pronounced?\n\nTrisquel is the most usual Spanish spelling for Triskelion or Triskele, the name of the celtic symbol in the logo. In english it is pronounced Tri (like in trim) skel (like in skeleton).\nUnder what license is Trisquel distributed?\n\nTrisquel is a composed only of free software packages, under the criteria of the Free Software Foundation. To read the license of each specific package, refer to /usr/share/doc/[program name]/copyright.\n\nThe user has the right to copy, modify, and redistribute this software, as well as use it in any number of computers and for any purpose.\n\nTrisquel is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY, without even the implied warranty of MERCHANTABILITY or without ensuring FOR A PARTICULAR PURPOSE.\n","torrent":{"xt":"urn:btih:de95a40cd8693409e814c37b52c3a090ad8061cb","amp;dn":"trisquel_5.0-i18n_amd65.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de95a40cd8693409e814c37b52c3a090ad8061cb","infoHashBuffer":{"type":"Buffer","data":[222,149,164,12,216,105,52,9,232,20,195,123,82,195,160,144,173,128,97,203]},"announce":[],"urlList":[]}}