{"title":"Vreme Razdelno / Time of Violence (1987)","uid":4718538,"size":2926474597,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df639cf7ddb59388d21d9aa5530e07f95171cb29&amp;dn=Vreme+Razdelno+%2F+Time+of+Violence+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NikeBG","files":-1,"time":1234395937,"description":"English title: Time of Violence\nOriginal title: Vreme Razdelno (Vreme na Nasilie)\nGenre: History, Drama\nCountry: Bulgaria\nTotal duration: 04:30:18\nYear: 1987\nLanguage: Bulgarian\nSubtitles: English, Bulgarian\n\nNOTE: Content not suitable for minors. Contains scenes of sexual activity, brutal/graphic violence, intense horror and/or other disturbing content.\n\nSynopsis: Time of Violence focuses on the fate of one valley during a crisis. The son of the miller was taken off by the Turks years ago, while still a boy, to become a janissary. Janissaries were special troops used by the Ottomans. Recruited (involuntarily) from Christian boys, they were separated from their families at an early age, indoctrinated in Islam and turned into fiercely reliable troops with no allegiance to anyone but the sultan. The miller's son is now a highly trusted janissary with the task of converting his entire home-valley to Islam. But the people there take their religion very seriously and will not submit. The janissary becomes more and more brutal in his attempts to convert the valley, for he must slaughter them all if they don't take the turban.\nThe film is painted on a large, sweeping canvas, with many characters and subplots, all cleverly woven into a single story. And, surprisingly, this isn't a &quot;vile Turk&quot; story. Director Ludmil Staikov has much more ambitious goals, including an examination of the power of religion and of the destructiveness of violence and fanaticism. Not all of the Christians are good, nor all of the Muslims bad.\nThe Turkish governor of the valley is not loved by his subjects, yet does all he can to avert their doom. He is given a beautiful, tender moment as he leaves the valley forever, in disgrace. Crossing a bridge that leads out of his valley, he notices a stone that has worked out of place. He gets down from his horse, carefully puts the stone back into its place and then proceeds on to his exile. Even the janissary has his complexities, as he truly wants to spare his people from unnecessary pain, despite having completely transferred his loyalties to the sultan.\nThe screenplay by Staikov, Georgi Danailov, Mihail Kirkov and Radoslav Spassov provides complex shadings of characters and motivations.\nTime of Violence is a professionally made film, beautifully photographed, well edited, and with scrupulous care in costuming and set design. The period atmosphere feels perfectly authentic, at least to someone with only passing familiarity with the time and place. The technical aspects of the film are well up to the standard of moderate budget Hollywood movies. Time of Violence is a film without flaws. There are no particularly weak points in the film and there are many great virtues.","torrent":{"xt":"urn:btih:df639cf7ddb59388d21d9aa5530e07f95171cb29","amp;dn":"Vreme+Razdelno+%2F+Time+of+Violence+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df639cf7ddb59388d21d9aa5530e07f95171cb29","infoHashBuffer":{"type":"Buffer","data":[223,99,156,247,221,181,147,136,210,29,154,165,83,14,7,249,81,113,203,41]},"announce":[],"urlList":[]}}