{"title":"Ted Poley-Smile-2007","uid":4981714,"size":114275226,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df7311601ba5cdb13639160c339c3b2b9bde9d9f&amp;dn=Ted+Poley-Smile-2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PoisonI","files":12,"time":1246358164,"description":"Artist: Ted Poley\nTitle: Smile\nGenre: Melodic Rock\nType: Album\nSize: 108 MB\nTracks: 12\nQuality: 320 kbps\n\nTrack List:\n\n01. Waiting Line\n02. Going Blind\n03. Smile\n04. What If She Knew\n05. More Than Goodbye\n06. Luv On Me\n07. If You Can't Change Your Heart (Then Let Me Blow Your Mind)\n08. Why Can't We Pretend That It's Over?\n09. Life Keeps Me Spinning Round\n10. Where It Ends\n11. Will Ya\n12. Reprise (If You Can't Change Your Heart)\n\nRelease Notes:\n\nThere's nothing quite like kicking back with a good cd that conjures up pretty sonic images like a pair of fuzzy warm slippers on a cold afternoon. That kind of warm, familiar air that keeps your blood running warm and your heart beating in a soothing rhythm . That's kind of the mind/body response that comes with Ted Poley's latest, &quot;Smile&quot;. The title is quite apt because the disc makes you do just that. It lights up the loneliest night with its sheer pulsating joy of living. Poley has likely created his masterpiece here, a disc that is utterly an extension of himself. His vocals are ripe with emotion, spilling out on every melodic laced song. Juicy and rich, like the premium dew kissed fruit having fallen fresh from the tree of all things melodic rock. A passionate vision of love and relationships - gone good, bad, or uncertain - the full range of love's many faces. Vic Rivera had teamed with Poley on his previous solo outing, &quot;Collateral Damage&quot;, but that particular combining of inspirations was decided to best serve as a side project all of its own. So this time around we get to hear Jeff Northrup, who brings his own style of edgy guitar playing to the mix, and also giving Poley's solo project a fresh, unique spin.\n\n&quot;Waiting Line&quot; is a combustible rocker that blazes through in a hard rock package, and showcases decorated frills with the melodic excess extravagancy of thunder licked Danger Danger. &quot;What if She Knew&quot; slays with its layers of melodic goodness, spread on one after the other like a decadent layer cake - the main sweet tooth attraction being the chorus that is simply divine. &quot;Going Blind&quot; is purely melodic, a song that slides through the speakers with its pinky in the air. Talk about class and the merits of a sound song structure to embellish upon. All of that and more can be delighted in right here. And there's even more ballads, for example, the acoustic dominated &quot;More Than Goodbye&quot; and the big bold power ballad &quot;Where It Ends&quot;, which gets kudos points for being one of the best songs Ted has laid down in recent memory. As for the harder side of things, the title track whips it out and keeps things bouncing at a respectable pace, keeping a &quot;Smile&quot; plastered on the face of the listener. &quot;Luv On Me&quot; and &quot;Why Can't We Pretend It's Over?&quot; uses a couple of varying takes on the maze of emotions, keeping it plain and even a bit tongue and cheek at times. Also of note is the sweet track &quot;If You Can't Change Your Heart (Let Me Blow Your Mind)&quot; which has a great title, theme and chorus to match.\n\nAny disc that is capable of treading the heavy waters of the &quot;L&quot; word emotion, and do it with class, finesse and such conviction, should be applauded, and thus Poley's &quot;Smile&quot; gets a thumbs up as a great melodic rock disc for winter's cold darkened nights. It will keep you warm and cozy through the heaviest blizzard and keep you up late at night humming its addictive choruses and crackling rhythms. The musicians do a solid job setting the stage, Poley knocks you out of your seat with his vocal performances, and the songs are beautifully constructed by musical architects that know how to build a great song and keep it flowing. You couldn't ask for much more in a disc from this genre. Highly recommended for anyone that enjoys a great melodic rock album.\n\nEnjoy and please seed after you have finished download as long as you can. ","torrent":{"xt":"urn:btih:df7311601ba5cdb13639160c339c3b2b9bde9d9f","amp;dn":"Ted+Poley-Smile-2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7311601ba5cdb13639160c339c3b2b9bde9d9f","infoHashBuffer":{"type":"Buffer","data":[223,115,17,96,27,165,205,177,54,57,22,12,51,156,59,43,155,222,157,159]},"announce":[],"urlList":[]}}