{"title":"LeGuin, Ursula K - The Earthsea Cycle (volumes 1-3) UA ENGLISH 4","uid":3395792,"size":439883810,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dfe94a4193cc222613b17792ea795fca750eef81&amp;dn=LeGuin%2C+Ursula+K+-+The+Earthsea+Cycle+%28volumes+1-3%29+UA+ENGLISH+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"americantiflag","files":173,"time":1129168218,"description":"Ursula K. LeGuin - The Earthsea Cycle (volumes 1-3) UA ENGLISH\n\n48kbps\n\nThis torrent contains books 1-3 out of LeGuin's 6 book series.  I cannot seem to locate the 4th or 5th or 6th books &quot;Tehanu,&quot; &quot;Tales from Earthsea,&quot; and &quot;The Other Wind&quot; (respectively), so if anyone has any of those (or basically ANY fantasy by LeGuin)... GIMMEDAT!! :) \n\nI just finished reading (in hardcopy) the first volume and it was incredible; it kept me captivated the entire time and I was upset that it was so short. \n\nI have not listened to any of these audiofiles yet, so I'm REALLY hoping there's nothing wrong with them.  I did make sure the file sequences were unbroken and I did a random check on some of the files in each book to make sure they play, but like I said, I haven't listened to them.  That said, if there's ANY problem with the files, merely comment down below or PM me and I will do my very best to fix things.\n\nEnjoy these classic works of fantasy and thanks for helping me seed.\n\n--------------------------------\n\n[img=http://www.ursulakleguin.com/UKLbyMWK-280x347.jpg]\n\nFrom amazon.com\n\nOften compared to Tolkien's Middle-earth or Lewis's Narnia, Ursula K. Le Guin's Earthsea is a stunning fantasy world that grabs quickly at our hearts, pulling us deeply into its imaginary realms. Four books (A Wizard of Earthsea, The Tombs of Atuan, The Farthest Shore, and Tehanu) tell the whole Earthsea cycle--a tale about a reckless, awkward boy named Sparrowhawk who becomes a wizard's apprentice after the wizard reveals Sparrowhawk's true name. The boy comes to realize that his fate may be far more important than he ever dreamed possible. Le Guin challenges her readers to think about the power of language, how in the act of naming the world around us we actually create that world. Teens, especially, will be inspired by the way Le Guin allows her characters to evolve and grow into their own powers. \n\n[img]http://hem1.passagen.se/peson42/lgw/img/covers/wizard1984.jpg[/img]\n\n[b]Book 1 - A WIZARD OF EARTHSEA[/b]\nIn this first book, A Wizard of Earthsea readers will witness Sparrowhawk's moving rite of passage--when he discovers his true name and becomes a young man. Great challenges await Sparrowhawk, including an almost deadly battle with a sinister creature, a monster that may be his own shadow.\n________________________________\n\n[img]http://hem1.passagen.se/peson42/lgw/img/covers/atuan1984.jpg[/img]\n\n[b]Book 2 - THE TOMBS OF ATUAN[/b]\nWhen young Tenar is chosen as high priestess to the ancient and nameless Powers of the Earth, everything is taken away from her-home, family, possessions, even her name. She is now known only as Arha, the Eaten One, guardian of the labyrinthine Tombs of Atuan, shrouded in darkness. When a young wizard, Ged Sparrowhawk, comes to steal the Tombs' greatest hidden treasure, the Ring of Erreth-Akbe, Tenar's rightful duty is to protect the Tombs. But Ged also brings with him the light of magic and tales of a brighter world Tenar has never known. Will Tenar risk everything to escape the darkness that has become her domain?\n________________________________\n\n[img]http://hem1.passagen.se/peson42/lgw/img/covers/farthest1984.jpg[/img]\n\n[b]Book 3 - THE FARTHEST SHORE[/b]\nDarkness threatens to overtake Earthsea. As the world and its wizards are losing their magic, Ged -- powerful Archmage, wizard, and dragonlord -- embarks on a sailing journey with highborn young prince, Arren. They travel far beyond the realm of death to discover the cause of these evil disturbances and to restore magic to a land desperately thirsty for it.\n\n\n**Once again, if you have any other LeGuin FANTASY, please upload it.  Thank you.\n\n","torrent":{"xt":"urn:btih:dfe94a4193cc222613b17792ea795fca750eef81","amp;dn":"LeGuin%2C+Ursula+K+-+The+Earthsea+Cycle+%28volumes+1-3%29+UA+ENGLISH+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe94a4193cc222613b17792ea795fca750eef81","infoHashBuffer":{"type":"Buffer","data":[223,233,74,65,147,204,34,38,19,177,119,146,234,121,95,202,117,14,239,129]},"announce":[],"urlList":[]}}