{"title":"Mick Flannery - Red to Blue [2012]","uid":8032716,"size":350272203,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e0013cff3a747d6312384363aadaf6ad51da3d05&amp;dn=Mick+Flannery+-+Red+to+Blue+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":30,"time":1358455358,"description":"01 - Gone Forever\n02 - Heartless Man\n03 - Only Gettin' On\n04 - Ships in the Night\n05 - Keepin' Score\n06 - Red to Blue\n07 - Up On That Hill\n08 - No Way to Live\n09 - Get That Gold\n10 - Down the Road\n11 - Lead Me On\n12 - Boston\n\nSometimes it's difficult to comprehend just why Mick Flannery is as popular as he is in an era when a musician's persona can do as much for their career as their product can. The cantankerously quiet man from Blarney isn't widely regarded for his charisma - notoriously shy, both in interview mode and when indulging in banter (or lack thereof) between songs when performing live. But as his platinum-selling second album White Lies proved, Flannery lets his music do the talking - and it's well able to sell itself. Three and a half years on from the release of White Lies comes Red to Blue - the part-time stonemason turned troubadour once again carving and chiselling a collection of songs which are rooted in misery but triumph through the adversity.\n\nOpening track 'Gone Forever' sets the tone as the first of four amped-up tracks on this instalment of the Flannery discography - his voice in top form, bluesy rock at its finest, with a killer harmonica solo to boot. Similarly, his soaring chorus vocals against a background of brass on 'No Way To Live' impress greatly. Title-track 'Red to Blue' is probably the closest we'll ever get to an all-out anthem from Flannery - and surprisingly, it's a style which works well for him. But the real allure of Mick Flannery continually lies in the angst-laden ballads - and they're in no short supply on Red to Blue.\n\nThe flamenco-rooted intro to 'Ships in the Night' builds into a melody which can't quite make its mind up between major and minor; it's a song which encompasses all that is great about Mick Flannery - stripped back musically with just guitar and strings to accompany his dulcet tones, but by no means devoid of variety, and lyrically insightful to boot. The simplicity of the combination of acoustic guitar, strings, and rumbling percussion of 'Only Getting On' works beautifully, as the softly-sung gravelly tones of Flannery detail the romantic tribulations of a touring musician. His tendency towards bluntness when it comes to matters of the heart is alive and well - the straightforward sentiment of &quot;If you don't want me, go away&quot; on acoustic number 'Keeping Score' cuts straight to the heart of the matter. Flannery switches his allegiance to the ivory for the romantic waltz of 'Boston' - again, the impassioned vocal delivery of a wonderfully simple refrain and accompanying piano impossibly striking.\n\nNothing stands out as much as 'Wish You Well' or 'Safety Rope' did on White Lies - but this isn't detraction. In taking his time crafting Red to Blue, what Flannery has done is take the best elements of his previous offerings and merge them with new musical styles to make it a more complete body of work as opposed to an album from which to single out favourites. A certain commercial success, it can only build on the strong reputation garnered by its predecessors. Probably best to avoid it if you're in the throes of emotional trauma, though.\n &lt;a href=&quot;\nhttp://dickthespic.org/2012/05/02/mick-flannery/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2012/05/02/mick-flannery/&lt;/a&gt;","torrent":{"xt":"urn:btih:e0013cff3a747d6312384363aadaf6ad51da3d05","amp;dn":"Mick+Flannery+-+Red+to+Blue+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0013cff3a747d6312384363aadaf6ad51da3d05","infoHashBuffer":{"type":"Buffer","data":[224,1,60,255,58,116,125,99,18,56,67,99,170,218,246,173,81,218,61,5]},"announce":[],"urlList":[]}}