{"title":"BBC Horizon Life.On.Mars.DivX521.MP3","uid":4241610,"size":736931840,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e15f5f3b6aa6d2606ddc3d9b098fe15eb2326ecf&amp;dn=BBC+Horizon+Life.On.Mars.DivX521.MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":1,"time":1213570856,"description":"Horizon 2001 Life On Mars\n\n\n\nInformation\n\nBBC2 9.00pm Thursday 11th January 2001\n\n&quot;If there&amp;#039;s life on Mars, it would be one of the most important discoveries of all time. It would mean life on Earth was not some special unique event - it would mean there&amp;#039;s likely to be life throughout the Universe&quot;\n\nIn the first of two special programmes on Mars, Horizon explores how the search for Martians is now hotting up, and why many scientists are becoming more and more convinced that life may have arisen on Mars, and that there may even be something living there now.\n\nToday, Mars is a frozen desert - the average temperature is -70?C. But long ago Mars was very different. The first clues came from Mariner 9, which sent back fuzzy images of the surface of Mars, revealing volcanoes, canyons and meandering valleys that looked like ancient rivers. Rivers form from rain water run-off, rain comes from clouds, and clouds mean an atmosphere. If there had been rivers on Mars, it meant the planet had once been warm and wet, like the Earth - the perfect conditions for life to evolve. For thirty years scientists like Mike Carr have been poring over more and more detailed images of Mars, trying to piece together the planet&amp;#039;s history. When the latest probe, Mars Global Surveyor, was launched three years ago, everyone hoped its high resolution electronic cameras would settle the debate about the ancient rivers. Thousands of close up images were beamed back, revealing sections of the valleys in fantastic detail, but none of them were any use.\n\nOver the billions of years, the valleys had all been eroded and filled with sand. It was impossible to say how they had been formed. Then finally, the Mars Global Surveyor team noticed a tiny feature in one image, which convinced them that billions of years ago there were rivers and lakes on Mars.\n\nBut did these warm, wet conditions last long enough for life to evolve? An unusual lake in Turkey has convinced Scottish geologist, Mike Russell, that Martian lakes were once teeming with primitive bacteria. So if life did evolve, is it possible that something is still living on Mars now? It would have to survive millions of years deep frozen in the Martian permafrost. \n\nRussian biologist David Gilichinsky has been studying how long microscopic life on Earth can survive frozen in permafrost. Each summer he travels to Siberia to drill into the permafrost. So far he has managed to resuscitate bacteria and algae which have been frozen for three million years at temperatures below -10?C. His latest results from Antarctica suggest bacteria may be able to survive even longer at even colder temperatures - perhaps thirty million years, at -20?C. Somehow bacteria live off the tiny amounts of liquid water that exist even in permafrost this cold. So perhaps they could still be clinging on, below the surface of Mars.\n\n\n\nAstronomer Bill Hartmann, believes that there may be far more going on beneath the surface of Mars than anyone suspected. Last year, Global Surveyor sent back astonishing images of gullies running down steep slopes on Mars. Bill is convinced these were carved by water erupting from underground aquifers, heated by volcanic activity deep below. If he&amp;#039;s right, then perhaps there has been life on Mars for billions of years, surviving undergound when the surface of the planet became the freeze dried desert it is now.\n\nThe search for life on Mars is moving underground. Over the next few years a series of missions to the Red Planet are planned, but any signs of life will be hidden away - buried deep, and hard to find. When will Mars give up its greatest secret?\n\n\n\nTechnical Specs\n\nVideo Codec: Divx 5.21\nVideo Bitrate: 1805 kb/s\nVideo Resolution: 640x480\nVideo Aspect Ratio: 4:3\nAudio Codec: LAME MP3\nAudio BitRate: 192 kb/s\nAudio Channels: 2\nRunTime Per Part: 48m 47s\nNumber Of Parts: 1\nPart Size: 702mb\nRipped by jvt40","torrent":{"xt":"urn:btih:e15f5f3b6aa6d2606ddc3d9b098fe15eb2326ecf","amp;dn":"BBC+Horizon+Life.On.Mars.DivX521.MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15f5f3b6aa6d2606ddc3d9b098fe15eb2326ecf","infoHashBuffer":{"type":"Buffer","data":[225,95,95,59,106,166,210,96,109,220,61,155,9,143,225,94,178,50,110,207]},"announce":[],"urlList":[]}}