{"title":"The 21 Day Sugar Detox","uid":11060428,"size":6035824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1c1dda0c535a90d393248ffcc42058417061e92&amp;dn=The+21+Day+Sugar+Detox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ShadowRaven66669","files":1,"time":1411162891,"description":"&quot;The 21-Day Sugar Detox&quot; is a clear-cut, effective, whole-foods-based nutrition action plan that will reset your body and your habits! Tens of thousands of people have already used this groundbreaking guide to shatter the vicious sugar stronghold. Now it's your turn!\n\nUse the easy-to-follow meal plans and more than 90 simple recipes in this book to bust a lifetime of sugar and carb cravings in just three weeks. Three levels of the program make it approachable for anyone, whether you're starting from scratch or from a gluten-free, grain-free, and/or Paleo/primal lifestyle.\n\n&quot;The 21-Day Sugar Detox&quot; even includes special modifications for athletes (endurance, CrossFit, HIIT-style, and beyond), pregnant/nursing moms, pescetarians, and people with autoimmune conditions.\n\nWhat you'll experience on this program will be different from a lot of other &quot;diet&quot; programs out there that promote extremely restricted eating; encourage you to consume only shakes, juices, or smoothies; or rely heavily on supplements and very-low-calorie or very-low-fat diets to ensure success. The goal of any detox program should be to support your body in naturally cleansing itself of substances that create negative health effects--and that's exactly what The 21-Day Sugar Detox does.\n\nBy focusing on quality protein, healthy fats, and good carbs, this program will help you change not only the foods you eat, but also your habits around food, and even the way your palate reacts to sweet foods. You'll likely complete the program and continue eating this way much of the time thereafter because you'll feel so amazing. After changing your everyday eating habits, you will begin to gain a new understanding of how food works in your body--and just how much nutrition affects your entire life. There's no reason to wait!\n\nSugar is taking over our lives.\n\nBut why? And is it only those sweet, refined white crystals that are causing us problems, or could there be more to the story?\n\nLet's be honest: The problem isn't just sugar itself. It's the refined, nutrient-poor carbohydrates that carry tons of calories, but no real nutrition. In our world, these are the easiest foods to grab on the go, but they leave us fat, sick, tired, and downright unhappy.\n\nThe effect that sugar, &quot;hidden&quot; carbs, and refined, processed foods have on our bodies goes far beyond our waistlines. We can't focus, we can't sleep, we have irrational mid-afternoon cravings, and we can't even make it through the day without wanting--or needing--to prop up our energy levels with caffeine or even more sugar! What can we do to break free from this cycle? &quot;The 21-Day Sugar Detox&quot; is here to help.","torrent":{"xt":"urn:btih:e1c1dda0c535a90d393248ffcc42058417061e92","amp;dn":"The+21+Day+Sugar+Detox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1c1dda0c535a90d393248ffcc42058417061e92","infoHashBuffer":{"type":"Buffer","data":[225,193,221,160,197,53,169,13,57,50,72,255,204,66,5,132,23,6,30,146]},"announce":[],"urlList":[]}}