{"title":"China Mieville - Iron Council (TTS)","uid":6340298,"size":508099054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e27e9a12017614cd2aac9f7fc8dfafc369454735&amp;dn=China+Mieville+-+Iron+Council+%28TTS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LoLong","files":39,"time":1303634077,"description":"About This Audiobook\n====================\nThis text-to-speech audiobook was created using the excellent new Neospeech voice Bridget. It is imho better than many human narrators. I suggest sampling the first file before downloading the complete collection. There are some quirks, such as heteronyms using the same pronunciation, or the spelling out of sounds, but the correct interpretation will be obvious from the context.\n\nGeneral Information\n===================\n Title............: Iron Council\n Author...........: China Mieville\n Read By..........: Neospeech Bridget\n Genre............: Fantasy\n Year.............: 2004\n Unabridged.......: Yes\n Language.........: English\n\nFile Information\n================\n Number of MP3s...: 36 (30 minutes per file)\n Total Duration...: 17 hours 36 minutes\n Total MP3 Size...: 484 MB\n Created by.......: deandominic                                           \n Encoder..........: LAME 3.98         \n Encoder Settings.: CBR 64 kbit/s 44100 Hz Mono          \n ID3 Tags.........: v1.1, v2.3 (includes embedded album art)\n\nBook Description\n================\n\nIn this stunning new novel set mainly in the decadent and magical city of New Crobuzon, British author MiÃƒÂ©ville (The Scar) charts the course of a proletarian revolution like no other. The capitalists of New Crobuzon are pushing hard. More and more people are being arrested on petty charges and &quot;Remade&quot; into monstrous slaves, some half animal, others half machine. Uniformed militia are patrolling the streets and watching the city from their dirigibles. They turn a blind eye when racists stage pogroms in neighborhoods inhabited by non-humans. An overseas war is going badly, and horrific, seemingly meaningless terrorist acts occur with increasing frequency. Radical groups are springing up across the city. The spark that will ignite the revolution, however, is the Perpetual Train. Workers building the first transcontinental railroad, badly mistreated by their overseers, have literally stolen a train, laying track into the wild back-country west of the great city, tearing up track behind them, fighting off the militia sent to arrest them, even daring to enter the catotopic zone, that transdimensional continental scar where anything is possible. Full of warped and memorable characters, this violent and intensely political novel smoothly combines elements of fantasy, science fiction, horror, even the western. MiÃƒÂ©ville represents much of what is new and good in contemporary dark fantasy, and his work is must reading for devotees of that genre.","torrent":{"xt":"urn:btih:e27e9a12017614cd2aac9f7fc8dfafc369454735","amp;dn":"China+Mieville+-+Iron+Council+%28TTS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27e9a12017614cd2aac9f7fc8dfafc369454735","infoHashBuffer":{"type":"Buffer","data":[226,126,154,18,1,118,20,205,42,172,159,127,200,223,175,195,105,69,71,53]},"announce":[],"urlList":[]}}