{"title":"Titans v2 01-38 (2008-2011)","uid":9576142,"size":663126026,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e28964c9b1512d24249f0ee90e621943fc6653e5&amp;dn=Titans+v2+01-38+%282008-2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1391704424,"description":"For more info about this series, check out the link here: &lt;a href=&quot;\nhttp://dc.wikia.com/wiki/Titans_Vol_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dc.wikia.com/wiki/Titans_Vol_2&lt;/a&gt;\n\nThis is the complete run of Judd Winnick's Titans series, which ran from 2008 till the New 52 relaunch. The storylines mostly feature the Titans coming together as a family early, and then slowly falling apart for various reasons - Dick Grayson leaves for Gotham to become Batman in Bruce Wayne's absence, Wally West is busy with the Justice League, etc. - and the book examines how this affects these now older heroes who have been defined by their tight interpersonal relationships for so long. The title has heavy crossover with Teen Titans v3 as well as Vigilante, and is affected by major and minor DC story arcs including Final Crisis, Blackest Night, Brightest Day, Justice League: Cry For Justice, and more. However, it is still a compelling read by itself if you have any familiarity with the Titans at all, in any incarnation (but especially the most famous New Teen Titans team from the 80's). Judd Winnick writes the majority of the material and there are various artists, of differing quality. All credit to the original uploaders and scanners, your work is very much appreciated. Please seed and enjoy! :-)\n","torrent":{"xt":"urn:btih:e28964c9b1512d24249f0ee90e621943fc6653e5","amp;dn":"Titans+v2+01-38+%282008-2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e28964c9b1512d24249f0ee90e621943fc6653e5","infoHashBuffer":{"type":"Buffer","data":[226,137,100,201,177,81,45,36,36,159,14,233,14,98,25,67,252,102,83,229]},"announce":[],"urlList":[]}}