{"title":"Wakeboard educational movie HigherEducation1and2","uid":3962825,"size":4234838016,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e39ab7aca076effeda7e88480da134325534190f&amp;dn=Wakeboard+educational+movie+HigherEducation1and2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"winet12","files":1,"time":1199555619,"description":"Higher Education Volumes 1 &amp; 2\n \nFrom the makers of Class In Session, Bump Films brings you the newest DVD to help you improve your wakeboarding way! Higher Education teaches you every aspect of wakeboarding. The best pro riders and instructors in the sport give you the skills you need to be up and ripping in no time. Instructors break down each trick for you and you get to see slow motion footage of top pros from different angles performing the tricks. This DVD takes you step by step through the series and with this extended DVD you get both Volumes 1 &amp; 2.\n\nVol I covers: Equipment Set Up, Boat Set Up, Riding Position, Deep Water Starts, Dock Starts, Turning And Carving, Butterslides, One Wake Jumps, Two Wake Jumps, Half Cab, Grabs, 180s, 360s, Back Rolls, Tantrum, and much more..\n\nVol II covers: Advanced Equipment, Front Rolls, Front Flips, Scarecrow, 540s, 720s, 900s, Off Axis Spins, Double Ups, Raley, OHH, Krypt, Hoochie Glide, Batwing, Whirlybird, Fruit Loop, Tootsie Roll, Dum Dum, Crow Mobe, KGB, Pete Rose, Moby Dick, 911, Slim Chance, Osmosis 5, Double Back Roll, Speed Ball, Orbital 5, and much more\n\nFEATURED RIDERS: Parks Bonifay, Darin Shapiro, Sane Bonifay, Shawn Watson, Rob Struharik, Kyle Schmidt, Charley Patterson, PJ Marks, Zane Schwenk\n\nSPONSORS: Mastercraft, Liquid Force, Blindside, CWB, Wakeboarding Magazine\n\n*please seed*\n ","torrent":{"xt":"urn:btih:e39ab7aca076effeda7e88480da134325534190f","amp;dn":"Wakeboard+educational+movie+HigherEducation1and2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39ab7aca076effeda7e88480da134325534190f","infoHashBuffer":{"type":"Buffer","data":[227,154,183,172,160,118,239,254,218,126,136,72,13,161,52,50,85,52,25,15]},"announce":[],"urlList":[]}}