{"title":"New Warriors v1","uid":7318985,"size":879662989,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e3b5e316cc5e59f4e4cc32aed4175e1d0cec1bfb&amp;dn=New+Warriors+v1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"SmokeBogey","files":-1,"time":1338569368,"description":"The New Warriors first appeared in issues 411 and 412 of the Marvel Comics title The Mighty Thor. The team was compiled by writer/editor Tom DeFalco, consisting of the young superheroes Nova, Speedball, Namorita, Marvel Boy, and Firestar, all of whom were once featured in solo series or were supporting characters in more established series. To this mix DeFalco added Night Thrasher, an original character to serve as the team's founder and leader. The New Warriors were not sidekicks, as some prior teen superhero teams had been.\n\nThe New Warriors were featured in an eponymous series from 1990 until 1996, written by Fabian Nicieza with art by Mark Bagley. Nicieza wrote the series for the first 53 issues. The series lasted for 75 issues and four annuals.\n\nDwayne Taylor, the vigilante known as Night Thrasher meticulously researches a group of young heroes to help him wage a war on crime. They are Richard Rider AKA &quot;(Kid) Nova&quot;, Angelica Jones AKA Firestar and Vance Astrovik AKA Marvel Boy. During their first battle, they are joined by Namorita and Robbie Baldwin AKA Speedball. The team decides to stay together and Speedball dubs them the New Warriors after a news report he had seen on the battle.","torrent":{"xt":"urn:btih:e3b5e316cc5e59f4e4cc32aed4175e1d0cec1bfb","amp;dn":"New+Warriors+v1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3b5e316cc5e59f4e4cc32aed4175e1d0cec1bfb","infoHashBuffer":{"type":"Buffer","data":[227,181,227,22,204,94,89,244,228,204,50,174,212,23,94,29,12,236,27,251]},"announce":[],"urlList":[]}}