{"title":"Faster Harder by Colleen Masters (Take Me _1).epub","uid":9165778,"size":216962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4f6e9b2e371f10b636407715d4b8351cdc20e42&amp;dn=Faster+Harder+by+Colleen+Masters+%28Take+Me+_1%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383977272,"description":" Siena Lazio is a lot of things...but reckless isn't one of them.\nShe's only in her mid-twenties and already Team Ferrelli's Director of Public Relations and heiress to the top Formula One racing team. The esteemed daughter of Alfonso Lazio, the greatest driver F1 has ever seen, Siena seems to have it all figured out. All she has to do is uphold her family's honor and ensure her brother Enzo's public image is pristine while he rises to fame and clenches the title as Formula One's new champion.\nEverything is perfect...\n...Until she's swept mercilessly off her feet by the one man she can never be with. The one man who can fuck it all up.\nHarrison Davies is Team McClain's secret weapon and he's the only driver who threatens to steal the championship from Enzo. The tattooed British bad boy knows how to get what he wants. And always gets what he wants.\nHarrison and Siena fall deeper and deeper with each secret tryst. Passion flares, reality fades, and the lines between right and wrong begin to blur. Driven by lust and ambition the couple delves into a world of treachery, deceit, lies, and ultimate betrayal. Is Siena ready to place her fragile heart into the hands of a speed demon and will the thrill of falling for him be worth it when they wreck?\n\nGenre: Romance","torrent":{"xt":"urn:btih:e4f6e9b2e371f10b636407715d4b8351cdc20e42","amp;dn":"Faster+Harder+by+Colleen+Masters+%28Take+Me+_1%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f6e9b2e371f10b636407715d4b8351cdc20e42","infoHashBuffer":{"type":"Buffer","data":[228,246,233,178,227,113,241,11,99,100,7,113,93,75,131,81,205,194,14,66]},"announce":[],"urlList":[]}}