{"title":"Phil Alvin Un -Sung Stories  (1986)","uid":9077198,"size":14378181,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5130578f2758feb51a935d53cd527f1712b04fe&amp;dn=Phil+Alvin+Un+-Sung+Stories++%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":10,"time":1382309873,"description":"Artist: Various\tCD#: 9226EB\nAlbum: Un &quot;Sung Stories&quot;\n\n\nSomeone Stole Gabriel's Horn                         03:19  33.63 Mb\nPhil Alvin  with the Dirty Dozen Brass Band  \n\nNext Week Sometime                                   02:32  25.67 Mb\nPhil Alvin      \n\nBallad of Smokey Joe                                 04:43  47.66 Mb\nPhil Alvin with Sun Ra &amp; The Arkestra \n\nDeath in the Morning\t                             02:55  29.46 Mb\nPhil Alvin with the Jubilee Train Singers \n\nOld Man of the Mountain\t                             02:29  25.19 Mb     \tPhil Alvin with Sun Ra &amp; The Arkestra    \n\nDaddy Rollin' Stone                                  03:36  36.37 Mb      Phil Alvin               \n \nTitanic Blues                                        03:10  32.07 Mb      Phil Alvin                                                                                    \nBrother, Can You Spare a Dime                        04:14  42.73 Mb\t\nPhil Alvin with Sun Ra &amp; The Arkestra  \n\nCollins Cave                                         03:52  39.05 Mb\t\nPhil Alvin       \n\nGangster's Blues                                     03:30  35.36 Mb\nPhil Alvin                                                                               \n\nFrom Allmusic:\n\n     \t Review by Mark Deming \n\n   Songwriter and guitarist Dave Alvin was the heart of the Blasters, one of America's greatest roots rock bands, but his brother, vocalist Phil Alvin, was the soul of the group, and anyone who wants a crash course on the importance of Phil's contribution to that fine band ought to check out his first solo album, Un &quot;Sung Stories&quot;. Here, Phil tackles ten vintage blues, jazz, and gospel tunes, sometimes accompanied a small combo (or just Phil's rudimentary guitar), while on other cuts Alvin is joined by Sun Ra and his Arkestra and the Dirty Dozen Brass Band, each of whom swing up a storm in their own truly individual ways. While the sound and approach of this set is a far cry from the Blasters potent take on America's musical history, Alvin's vocals ring out with a palpable joy, and he makes these musical museum pieces live and breathe like they were written last week; this album truly carries the spirit of the Blasters' wide-spectrum approach to American music into a very different direction. And while Phil may not have his brother's songwriting chops, you can't say that a man who would ask Sun Ra to arrange &quot;The Old Man of the Mountain&quot; and &quot;Brother, Can You Spare a Dime&quot; and then have the courage to take the lead vocal on the same is lacking in the way of a unique personal vision. Short and sweet, Un &quot;Sung Stories&quot; is a true gem that's richly felt in a way a collection of &quot;old standards&quot; is not expected to be.\n\n  Thanks Mark Deming\n\n\n   My notes.\n   \n  has free open source feature films, many of them vintage.  The other night I was watching &quot;Hi De Ho&quot;  - a film featuring Cab CAlloway and his orchestra.  In that small film Minnie The Moocher and Smokey Joe are real characters: one played by Jeni Le Gon and Smokey Joe done in pantomime by Calloway.\n\n   This put me in mind to finish a torrent of something I have had and loved for many years both on disc and cd.  It is very rare.  Share it to the sites that feature a lot of historical music.  It is as Mark says,\n &quot;a gem&quot; and most always out of print.\n\n\n   Notes written October 19, 2013","torrent":{"xt":"urn:btih:e5130578f2758feb51a935d53cd527f1712b04fe","amp;dn":"Phil+Alvin+Un+-Sung+Stories++%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5130578f2758feb51a935d53cd527f1712b04fe","infoHashBuffer":{"type":"Buffer","data":[229,19,5,120,242,117,143,235,81,169,53,213,60,213,39,241,113,43,4,254]},"announce":[],"urlList":[]}}