{"title":"Blackadder (Series 1-4)","uid":7638986,"size":8807140518,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e5b38abdbd8253b7543d93137f541cb36f16a4c8&amp;dn=Blackadder+%28Series+1-4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n17n3uq","files":24,"time":1347727804,"description":"Blackadder is the name that encompassed four series of a BBC One period British sitcom, along with several one-off instalments. All television programme episodes starred Rowan Atkinson as anti-hero Edmund Blackadder and Tony Robinson as Blackadder's dogsbody, Baldrick. Each series was set in a different historical period with the two protagonists accompanied by different characters, though several reappear in one series or another, for example Melchett and Lord Flashheart.\n\nThe first series titled The Black Adder was written by Richard Curtis and Rowan Atkinson, while subsequent episodes were written by Curtis and Ben Elton. The shows were produced by John Lloyd. In 2000 the fourth series, Blackadder Goes Forth, ranked at 16 in the &quot;100 Greatest British Television Programmes&quot;, a list created by the British Film Institute. Also in the 2004 TV poll to find &quot;Britain's Best Sitcom&quot;, Blackadder was voted the second-best British sitcom of all time, topped by Only Fools and Horses. It was also ranked as the 20th-best TV show of all time by Empire magazine.[1]\n\nAlthough each series is set in a different era, all follow the &quot;misfortunes&quot; of Edmund Blackadder (played by Atkinson), who in each is a member of a British family dynasty present at many significant periods and places in British history. It is implied in each series that the Blackadder character is a descendant of the previous one, although it is never mentioned how any of the Blackadders manage to father children.[2]\n\nAs the generations progress, Blackadder becomes increasingly clever and perceptive, while his social status steadily erodes; however, each Blackadder remains a cynical, cowardly opportunist, maintaining and increasing his own status and fortunes, regardless of his surroundings.\n\nThe life of each of the Blackadders is also entwined with their servant, all from the Baldrick family line (played by Tony Robinson). Each generation acts as the dogsbody to his respective Blackadder. They decrease in intelligence (and in personal hygiene standards) just as their masters' intellect increases. Each Blackadder and Baldrick is also saddled with the company of a dim-witted aristocrat whose presence Blackadder must somehow tolerate. This role was taken in the first two series by Lord Percy Percy, played by Tim McInnerny, with Hugh Laurie playing the role in the third and fourth series, as Prince George, Prince Regent, and Lieutenant George, respectively.\n\nEach series was set in a different period of British history, beginning in 1485 and ending in 1917, and comprised six half-hour episodes. The first series, made in 1983, was called The Black Adder (set in the fictional reign of &quot;Richard IV&quot;). This was followed by a second series, Blackadder II (1986) set during the reign of Elizabeth I, a third series Blackadder the Third (1987) set during the late 18th and early 19th centuries in the reign of George III, and finally Blackadder Goes Forth (1989) in 1917, set in the trenches of the Great War.","torrent":{"xt":"urn:btih:e5b38abdbd8253b7543d93137f541cb36f16a4c8","amp;dn":"Blackadder+%28Series+1-4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b38abdbd8253b7543d93137f541cb36f16a4c8","infoHashBuffer":{"type":"Buffer","data":[229,179,138,189,189,130,83,183,84,61,147,19,127,84,28,179,111,22,164,200]},"announce":[],"urlList":[]}}