{"title":"Wargames of 1939 v1.1.2","uid":8934864,"size":2885072,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:e63e129290ccb25c1fa38eaef15a226cbd7fb5f2&amp;dn=Wargames+of+1939+v1.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1379540735,"description":"\nDid you grow up playing Panzer General, Fantasy General and History Line / Battle Isle series during the 90s? Or perhaps you liked the Avalon Hill board wargames? We did. This game is a retro style modern tribute to the spirit of those wonderful hex &amp; dice unit shufflers. If you like turn based military strategy, this game is for you!\n\nThe game features initially 7 scenarios, set in the early days of the second world war, when the Nazi Germany launched a full-scale attack against Poland. The Polish army, fighting without allies upheld against the invasion for 2 months but was eventually defeated by the third reich. In this game, the scenarios depict various key battles of the war, ranging from the initial border warfare to the siege of Warsaw.\n\nFans of hardcore hex strategy games might enjoy the fact that the game has actual World War II era German and Polish combat vehicles and armament, supply line mechanics, artillery counter attacks, maps based on the actual historical battles, and so forth. (Some liberties have been taken in interpreting few of the details, to make the game more entertaining. But we've tried to be as close to the course of events as possible.)\n\nYou can play either solo against the AI, or play multiplayer by passing the device between players after each turn. Network multiplayer is not currently supported. The single player game is played from the axis perspective; multiplayer has one player playing the German side and the other Polish side.\n\nIn case you'd like to play a quite similar type of a game set in ancient times, you might want to try out our Populus Romanus series also. It has a somewhat similar kind of tactics but in a Roman setting instead of modern times.\n\nWhat's New: (Updated: September 17, 2013)\n\n1.1.2:\n- Minor fix for scenario 7 (one AI bunker tried to move)\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.ww2strategy.wg1939&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.ww2strategy.wg1939&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e63e129290ccb25c1fa38eaef15a226cbd7fb5f2","amp;dn":"Wargames+of+1939+v1.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63e129290ccb25c1fa38eaef15a226cbd7fb5f2","infoHashBuffer":{"type":"Buffer","data":[230,62,18,146,144,204,178,92,31,163,142,174,241,90,34,108,189,127,181,242]},"announce":[],"urlList":[]}}