{"title":"ESET NOD32 Anti-Virus 4.0 + keys","uid":5438157,"size":38155488,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e6a1ebb04b40e6328464157561bfc49d629166c8&amp;dn=ESET+NOD32+Anti-Virus+4.0+%2B+keys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eldiego90","files":-1,"time":1268797005,"description":"Eset Nod32 4.0 + Working Keys included!!!\n\n\nEnjoy!\n\n\n\n\nESET NOD32 Antivirus Overview\n\nYou didn't buy your computer to run antivirus. That's why ESET NOD32 Antivirus gives you fast, effective and easy-to-use protection without getting in your way. Smart proactive detection blocks most known and emerging threats hours or days faster than other antivirus technologies. Fast, light and unobtrusive software protects your Internet experience without annoying system slowdowns.\nKey Benefits\n\n    * Keeps you safe from viruses, spyware, trojans, password stealers and other malware threats\n    * Stops most new threats proactively, well before other vendors have issued a signature, maximizing your defense against new and unknown threats\n    * Scans and cleans Internet traffic and email, even when it's SSL-encrypted, so your email is always safe\n    * Stops threats from entering through removable devices so you can share files with confidence\n    * Integrated SysInspector and SysRescue simplify system diagnosis and recovery\n    * Self defense prevents malware from degrading your level of protection\n    * Tiny signature updates happen discretely as needed and won't bog down your system\n    * Free technical support via the Web, email or phone\n\n\nKey Features\n\nSmarter Scanner ÃƒÂ» Threats don't always enter your network in ways you expect. ESET NOD32 Antivirus inspects SSL-encrypted communication channels like HTTPS and POP3S and intelligently scans compressed files to find hidden threats other products miss. Proactive protection begins at the earliest point in system startup to ensure your computer is always secure.\n\nClean and Safe Email ÃƒÂ» Email scanning for Microsoft Outlook, Outlook Express, Mozilla Thunderbird, Windows Live Mail, Windows Mail, and other POP3/IMAP mail clients, ensuring your email is free of viruses and other threats.\n\nRemovable Media Security ÃƒÂ» Threats can enter your PC from removable media such as USB thumb drives. For self-running media, ESET NOD32 Antivirus scans autorun.inf and associated files when the medium is inserted, in addition to scanning any file on any removable device when it is accessed, or during a full-scan of the media. Power users can adjust ESET NOD32 Antivirus to perform additional levels of scanning on removable media.\n\nSystem Tools ÃƒÂ» ESET SysInspector and ESET SysRescue simplify diagnosing and cleaning of infected systems by allowing deep scans of system processes to find hidden threats, and creating bootable rescue CD/DVD or USB drives to help you repair an infected computer.\n\nSelf Defense ÃƒÂ» ESET NOD32 Antivirus has built-in technology to prevent malicious software from corrupting or disabling it, so you can rest assured your system is always protected.\nESET NOD32 Antivirus Screen Shots\n\nMany Usability Improvements ÃƒÂ» ESET NOD32 Antivirus has numerous speed, security and usability upgrades.\n\n    * Energy-sipping battery mode extends laptop battery life without compromising security\n    * Advanced Protection Status screen informs you of threat detections\n    * Information pop-ups are hidden when running full screen applications like games, video players or presentations\n    * Password protection prevents ESET NOD32 Antivirus from being uninstalled by strangers\n    * New interface and keyboard shortcuts simplify use for visually impaired users\n\n\n\n\nSystem Requirements\nProcessors supported: Intel or AMD x86-x64\nOperating Systems: Microsoft Windows 7 (32- and 64-bit editions), Microsoft Windows Vista (32- and 64-bit editions), Microsoft Windows XP (32- and 64-bit editions), Microsoft Windows 2000\nMemory: 48 MB\nDisk Space (download): 32 MB\nDisk Space (installation): 46 MB\n\n","torrent":{"xt":"urn:btih:e6a1ebb04b40e6328464157561bfc49d629166c8","amp;dn":"ESET+NOD32+Anti-Virus+4.0+%2B+keys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a1ebb04b40e6328464157561bfc49d629166c8","infoHashBuffer":{"type":"Buffer","data":[230,161,235,176,75,64,230,50,132,100,21,117,97,191,196,157,98,145,102,200]},"announce":[],"urlList":[]}}