{"title":"The.Berlin.File.2013.BluRay.720p.DTS.x264-CHD","uid":8743374,"size":5899056677,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e7a2725069747f88ce73d0375aa4542f511abf8a&amp;dn=The.Berlin.File.2013.BluRay.720p.DTS.x264-CHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":1,"time":1374853635,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nCountry: North Korean \nGenres: Action, Thriller, Spy \nDirector: Ryoo Seung-wan \nCast: Ha Jung-woo, Han Suk-kyu, Ryoo Seung-beum, Jeon Ji-hyun \n\nPlot: South Korean NIS agent Jung Jin-Soo (Han Suk-Kyu) and his team stake out the Grand Westin Hotel in Berlin, Germany. They watch as an illegal weapons deal is about to take place between a Middle Eastern buyer, an unidentified North Korean seller and a Russian broker. At the moment the transaction is about to be consummated, the South Korean NIS team set out to raid the hotel room. Before they are able to enter the hotel room, something unexpected occurs and the North Korean man is able to flee up to the hotel rooftop. NIS agent Jung Jin-Soo and the North Korean man have a physical struggle on the rooftop, with the North Korean man able to escape. They will cross paths again.\n\nMeanwhile, the North Korean man is Pyo Jong-Sung (Ha Jung-Woo), a North Korean agent who is known as &quot;the Hero of the Republic&quot; back home. Pyo Jong-Sung then learns from the North Korean ambassador (Lee Kyoung-Young), that Dong Myung-Soo (Ryoo Seung-Bum) is on his way to Berlin. Dong Myung-Soo is the son of a powerful North Korean official and also a lethal killer. The North Korean ambassador knows that with Dong Myung-Soo's appearance in Berlin something ominous will happen.\n\nDong Myung-Soo arrives in Berlin with the intent to take out Pyo Jong-Sung, his wife (Gianna Jun) and the North Korean ambassador. Dong Myung-Soo will replace the ambassador with himself and have his father's men take over the Berlin operation. His plan begins with the revelation that Pyo Jong-Sung's wife, who works as a translator at the North Korean embassy, is a traitor. Soon, Pyo Jong-Sung and his wife find themselves the targets of several powerful organizations as they desperately try to get out Berlin alive. ","torrent":{"xt":"urn:btih:e7a2725069747f88ce73d0375aa4542f511abf8a","amp;dn":"The.Berlin.File.2013.BluRay.720p.DTS.x264-CHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7a2725069747f88ce73d0375aa4542f511abf8a","infoHashBuffer":{"type":"Buffer","data":[231,162,114,80,105,116,127,136,206,115,208,55,90,164,84,47,81,26,191,138]},"announce":[],"urlList":[]}}