{"title":"[UNINETTUNO[ FONDAMENTI INFORMATICA 1 [COMPLETO]","uid":4427724,"size":7847613673,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e909f163292a0e169a34285e948991bb479f5c83&amp;dn=%5BUNINETTUNO%5B+FONDAMENTI+INFORMATICA+1+%5BCOMPLETO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Huops","files":42,"time":1223081186,"description":"Il corso di Fondamenti di Informatica I, congiuntamente a quello di Fondamenti di Informatica II, intende fornire i concetti fondamentali della scienza degli elaboratori elettronici, descriverne i principi di funzionamento, illustrare le componenti principali sia hardware sia software ed introdurre le nozioni fondamentali per la loro programmazione. Relativamente a quest&amp;#039;ultimo tema il corso vuole mostrare come affrontare e risolvere problemi via via piÃƒÂ¹ complessi, passando da una definizione iniziale poco precisa ad una specifica il piÃƒÂ¹ possibile completa e progettando soluzioni che richiedono tecniche per padroneggiare la complessitÃƒÂ  dei problemi. Il linguaggio di riferimento sarÃƒÂ  il C++.\n\nContenuti\n\n- Concetti generali. Hardware. Software \n\n- Struttura dell&amp;#039;elaboratore \n\n- Rappresentazione dell&amp;#039;informazione negli elaboratori \n\n- Algebra di Boole\n\n- Aritmetica degli elaboratori \n\n- Linguaggio di programmazione e traduttori \n\n- Fondamenti di problem solving: dal problema al programma \n\n- Il linguaggio C:\n- Tipi di dato fondamentali\n- Struttura dei programmi\n- Operatori di base \n- Strutture di controllo\n- Vettori, matrici, array\n- Funzioni\n\nTitoli delle Lezioni :\n\nLez.  1   La storia dell&amp;#039;informatica e lo schema a blocchi del calcolatore   Angelo Raffaele Meo\nLez.  2   Le componenti fondamentali dell&amp;#039;elaboratore (I) Hardware e software. La societÃƒÂ  dell&amp;#039;informazione. Bit e Byte. I blocchi fondamentali dell&amp;#039;elaboratore   Marco Mezzalama\nLez.  3   Le componenti fondamentali dell&amp;#039;elaboratore (II) UnitÃƒÂ  centrale di elaborazione (CPU) Il microprocessore. I linguaggi dell&amp;#039;elaboratore. Sistemi operativi (file e direttori)   Marco Mezzalama\nLez.  4   Codifica dell&amp;#039;informazione numerica (I) Codici binari. La rappresentazione dei numeri. Sistemi posizionali. Sistema binario   Marco Mezzalama\nLez.  5   Codifica dell&amp;#039;informazione numerica (II) Aritmetica binaria. Scalamenti (SHIFT). Rappresentazione dei numeri relativi. Rappresentazione in modulo e segno   Marco Mezzalama\nLez.  6   Codifica dell&amp;#039;informazione numerica (III) Rappresentazione dei numeri relativi. Rappresentazione in complemento a due. Intervalli di rappresentazione. Overflow   Marco Mezzalama\nLez.  7   Codifica dell&amp;#039;informazione numerica (IV) Rappresentazione dei numeri reali. Rappresentazione in virgola mobile. Codifica esadecimale   Marco Mezzalama\nLez.  8   Codifica dell&amp;#039;informazione non numerica. Codifica testi. Codifica immagini. Codifica suoni   Marco Mezzalama\nLez.  9   Algebra di Boole e circuiti logici (I) Operazioni logiche: AND, OR, NOT. Le porte logiche elementari   Angelo Raffaele Meo\nLez. 10   Algebra di Boole e circuiti logici (II) Operazioni logiche. Circuiti logici combinatori. Porte logiche elementari   Angelo Raffaele Meo\nLez. 11   (Prof. Meo) Algebra di Boole e circuiti logici (parte III). Circuiti logici di memoria. Il Flip Flop (FF)\nLez. 12   (Prof. Meo) Algebra di Boole e circuiti logici (parte IV). Addizionatore binomio. I circuiti per la gestione della memoria\nLez. 13   (Prof. Meo) Linguaggi e traduttori (parte I). Linguaggio macchina. Linguaggio assembler. Linguaggi evoluti\nLez. 14   (Prof. Meo) Linguaggi e traduttori (parte II). Linguaggi evoluti. Linguaggi ed oggetti. Traduttori e Compilatori \nLez. 15   (Prof. Meo) La programmazione: i linguaggi ad alto livello; il linguaggio C; l&amp;#039;ambiente di programmazione; il QUICK C; procedura di caricamento dell&amp;#039;ambiente di sviluppo (QUICK C ver. 2.50); produzione di un nuovo programma\nLez. 16   (Prof. Meo) Il linguaggio C: le variabili; dichiarazione delle variabili; Istruzione di assegnazione; le fasi di un programma: fase 1: Introduzione dei dati; fase 2: elaborazione dei dati; fase 3: uscita dati (OUT PUT); introduzione dati: la funzione &quot;scanf&quot;; alcune regole della sintassi delle espressioni aritmetiche \nLez. 17   (Prof. Meo) Il linguaggio C: i campi di commento; l&amp;#039;istruzione &quot;go to&quot; e le etichette o &quot;label&quot;; l&amp;#039;istruzione if (...) then ...; l&amp;#039;istruzione if (...) then ... else ...; i diagrammi di flusso o &quot;flowchart&quot;; istruzioni composte \nLez. 18   (Prof. Meo) Il linguaggio C: un esempio di programma con istruzioni composte; tipi di dati; le costanti \nLez. 19   (Prof. Meo) Il linguaggio C: variabili ed espressioni aritmetiche; l&amp;#039;istruzione &quot;while&quot;; le costanti simboliche: #define; il preprocessore; i vettori\nLez. 20   (Prof. Meo) Il linguaggio C: i vettori o &quot;array&quot;\nLez. 21   (Prof. Meo) Il linguaggio C: vettori e sequenze di caratteri; il costrutto if...else if...; le funzioni &quot;getchar&quot; e &quot;putchar&quot;\nLez. 22   (Prof. Meo) Il linguaggio C: nuovo esempio di programma: il conteggio di parole; ancora un esempio sui vettori e sui conteggi di caratteri; il concetto di funzione\nLez. 23   (Prof. Meo) Il linguaggio C: il concetto di funzione o sottoprogramma; primo esempio: il programma non usa le funzioni; il funzionamento a livello hardware e software integrato della funzione; definizione di funzione; le variabili locali; argomenti di una funzione\nLez. 24   (Prof. Meo) Il linguaggio C: concetto di funzione o sottoprogramma; la funzione di libreria &quot;printf&quot;; definizione di funzione; esempi di programma con funzione; differenza tra funzione e sottoprogramma; passaggio dei parametri; le chiamate per valore e le chiamate per indirizzo\nLez. 25   (Prof. Meo) Il linguaggio C: le funzioni: la chiamata per indirizzo; un esempio di utilizzo degli array di caratteri; definizione di stringa di caratteri; le variabili esterne \nLez. 26   (Prof. Meo) Il linguaggio C: ANSI C; nome di una variabile; tipi di dati e dimensioni fondamentali; le costanti; le funzioni di libreria  \nLez. 27   (Prof. Meo) Il linguaggio C: la funzione &quot;strlen&quot;; le dichiarazioni; gli operatori aritmetici; gli operatori relazionali e gli operatori logici; conversioni di tipo; gli operatori di incremento e decremento \nLez. 28   (Prof. Meo) Il linguaggio C: gli operatori binari bit-a-bit; l&amp;#039;operatore unario bit-a-bit; la funzione getbits (x, p, n); le espressioni condizionali \nLez. 29   (Prof. Meo) Il linguaggio C: la tabella delle precedenze e l&amp;#039;ordine di valutazione; struttura di controllo &quot;if...else&quot;; la ricerca lineare; la ricerca binaria (o logaritmica); algoritmo di ordinamento \nLez. 30   (Prof. Meo) Il linguaggio C: il costrutto &quot;switch&quot;; i costrutti &quot;while&quot; e &quot;for&quot;; il costrutto &quot;do...while&quot;; fondamenti sulle funzioni\nLez. 31   Il linguaggio C: Funzioni che ritornano valori non interi; Le varianili esterne; &quot;stack&quot; o pila; La notazione polacca postfissa; La filosofia della progettazione &quot;top down&quot;   Angelo Raffaele Meo\nLez. 32   Il linguaggio C: Esempi di programma per valutare una scrittura in notazione polacca   Angelo Raffaele Meo\nLez. 33   Il linguaggio C: Esame del listato del programma &quot;calcolatrice&quot;; Regole di &quot;scope&quot;; Realizzazione del programma &quot;calcolatrice&quot; su piu&amp;#039; file; &quot;header file&quot;; Le variabili &quot;static&quot;; Le variabili &quot;register&quot;   Angelo Raffaele Meo\nLez. 34   Il linguaggio C: La struttura a blocchi; Inizializzazioni; Ricorsione   Angelo Raffaele Meo\nLez. 35   Il preprocessore C. Puntatori e indirizzi: il preprocessore C; Inclusione di file; Sostituzione delle macro; Inclusione condizionale   Angelo Raffaele Meo\nLez. 36   Il linguaggio C: Definizione del puntatore; Uso di puntatori; Come e&amp;#039; fatto un puntatore; Puntatori e argomenti di funzione - La funzione SWAP   Angelo Raffaele Meo\nLez. 37   Il linguaggio C: La funzione GET INT; Puntatori e vettori; Il nome di un vettore e&amp;#039; un puntatore; La funzione STRLEN   Angelo Raffaele Meo\nLez. 38   Aritmetica dei puntatori. Un allocatore di memoria: L&amp;#039;aritmetica dei puntatori; Un allocatore di memoria; Sottrazione dei puntatori; Una versione di STRLEN   Angelo Raffaele Meo\nLez. 39   Sottoprogrammi per stringhe. Puntatori a caratteri e funzioni: Una versione di STRLEN; Inizializzazione di puntatori a stringhe; Copia di stringhe; Confronto lessicografico di stringhe   Angelo Raffaele Meo\nLez. 40   Il linguaggio C: Progettazione top-down; Vettori di puntatori a carattere   Angelo Raffaele Meo","torrent":{"xt":"urn:btih:e909f163292a0e169a34285e948991bb479f5c83","amp;dn":"%5BUNINETTUNO%5B+FONDAMENTI+INFORMATICA+1+%5BCOMPLETO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e909f163292a0e169a34285e948991bb479f5c83","infoHashBuffer":{"type":"Buffer","data":[233,9,241,99,41,42,14,22,154,52,40,94,148,137,145,187,71,159,92,131]},"announce":[],"urlList":[]}}