{"title":"The Story of Christianity, by Justo L. Gonzalez [ePub]","uid":13296588,"size":15698166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9dc5074b3f6e3cad43b331bee9b1f6a9df8ac0c&amp;dn=The+Story+of+Christianity%2C+by+Justo+L.+Gonzalez+%5BePub%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bey0nd","files":2,"time":1453641922,"description":"The Story of Christianity, Vol. 1\r\n\r\n=== The Early Church to the Dawn of the Reformation ===\r\n\r\nIn this fully revised and updated edition, the lauded church historian Justo González tells the story of Christianity from its fragile infancy to its pervasive dominance at the dawn of the Protestant Reformation. The Story of Christianity, volume 1, relates the dramatic events, the colorful characters, and the revolutionary ideas that shaped the first fifteen centuries of the church's life and thought.\r\n\r\nFrom Jesus's faithful apostles to the early reformist John Wycliffe, González skillfully weaves details from the lives of prominent figures tracing core theological issues and developments within the various traditions of the church. The Story of Christianity demonstrates at each point what new challenges and opportunities faced the church and how Christians struggled with the various options open to them, thereby shaping the future direction of the church.\r\n\r\nThis new edition of The Story of Christianity incorporates recent archaeological discoveries to give us a better view of the early Christian communities. Among these are advances in the recovery of Gnostic texts that have revealed a richer diversity of &quot;Christianities&quot; in the first century. González also includes important research done in the past twenty-five years revealing the significant role of women throughout the history of the church.\r\n\r\nWith lively storytelling incorporating the latest research, The Story of Christianity provides a fascinating introduction to the panoramic history of Christianity.\r\n\r\nPaperback: 528 pages\r\nPublisher: HarperOne; 2nd edition (August 10, 2010)\r\nLanguage: English\r\nISBN-10: 006185588X\r\nISBN-13: 978-0061855887\r\n\r\n------------------------------------------\r\n\r\nThe Story of Christianity, Vol. 2\r\n\r\n=== The Reformation to the Present Day ===\r\n\r\nBeginning with the Protestant Reformation of the sixteenth century, this fully revised and updated second volume of The Story of Christianity continues the marvelous history of the world's largest religion. Award-winning historian Justo Gonzalez bring to life the people, dramatic events, and theological debates that have shaped Protestantism, Catholicism, and Orthodoxy. From the monk Martin Luther, who dared to stand up to a corrupt pope, to the surprising spread and growing vitality of today's church in Africa, Asia, and South America, The Story of Christianity offers a complete and up-to-date retelling of this amazing history.\r\n\r\nWith new information on the important contributions of women to church history as well as the latest information on Christianity in developing countries, Gonzalez's richly textured study discusses the changes and directions of the church up to the twenty-first century. The Story of Christianity covers such recent occurrences as the fall of the Soviet Union and the return of the Russian Orthodox Church; feminist, Africa-American, and Third-World theologies; the scandals and controversies facing the reign of Pope Benedict XVI; interfaith dialogue; and the movement toward unity of all Christian churches. This revised and updated edition of The Story of Christianity concludes with a thoughtful look at the major issues and debates facing Christianity today.\r\n\r\nPaperback: 560 pages\r\nPublisher: HarperOne; 2nd edition (December 7, 2010)\r\nLanguage: English\r\nISBN-10: 0061855898\r\nISBN-13: 978-0061855894","torrent":{"xt":"urn:btih:e9dc5074b3f6e3cad43b331bee9b1f6a9df8ac0c","amp;dn":"The+Story+of+Christianity%2C+by+Justo+L.+Gonzalez+%5BePub%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9dc5074b3f6e3cad43b331bee9b1f6a9df8ac0c","infoHashBuffer":{"type":"Buffer","data":[233,220,80,116,179,246,227,202,212,59,51,27,238,155,31,106,157,248,172,12]},"announce":[],"urlList":[]}}