{"title":"What's in Your Genes? a Revealing Look at Your Genetic Traits","uid":10535626,"size":1692298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9fdb87d536d2296662ffadd9dcf1664cb1132fc&amp;dn=What%27s+in+Your+Genes%3F+a+Revealing+Look+at+Your+Genetic+Traits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1405164301,"description":"What's in Your Genes?: From the Color of Your Eyes to the Length of Your Life, a Revealing Look at Your Genetic Traits\n\n2014 epub\n\n\nA crash course in genetics!\n Everyone knows that if you come from a family of brunettes, you're likely to be born with brown hair. But did you know your hair color may also affect how often you get sunburned? Or how often you need to take vitamin supplements?\n\n What's in Your Genes? goes beyond Gregor Mendel and dominant/recessive genes to show you all the ins and outs of what determines your DNA. Each entry provides you with a sneak peek into your DNA sequence and teaches you exactly how your body is able to create that wonderful you-ness that no one else has. From your tastebuds to your eye color to your obsession with clinical-strength deodorants, this book not only guides you through the history and study of genetics, but also shows you how those four little letters in your DNA make you who you are.\n\n Complete with imaginative illustrations, What's in Your Genes? reveals all there is to know about heredity--like the science behind vibrant red hair, perfect teeth, and your ability to see in color.\n","torrent":{"xt":"urn:btih:e9fdb87d536d2296662ffadd9dcf1664cb1132fc","amp;dn":"What%27s+in+Your+Genes%3F+a+Revealing+Look+at+Your+Genetic+Traits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9fdb87d536d2296662ffadd9dcf1664cb1132fc","infoHashBuffer":{"type":"Buffer","data":[233,253,184,125,83,109,34,150,102,47,250,221,157,207,22,100,203,17,50,252]},"announce":[],"urlList":[]}}