{"title":"Priscila s Initiation 2006 DVDRip","uid":12870865,"size":1825866699,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ea4466f266d6f26081850e0c4febc503cab67c59&amp;dn=Priscila+s+Initiation+2006+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"EndYou","files":1,"time":1448881175,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/vG\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2006\r\nRussian language\r\nTranslation: SP Company odnogolosyj\r\nExtras. Languages: English, French\r\nCountry: France\r\nGenre: Feature, European, Anal, DP\r\nDuration: 1:39:32\r\nDirected by: Marc Dorcel\r\nStudio: Marc Dorcel\r\n\r\nPriscilla Sol, Ramona, Liliane Tiger, Alexa Weix as Linda Shane, Judith Fox, Sylvia Laurent, Sharka Blue, Alex Forte, Frank Major, Ian Scott, Lauro Giotto, JPX, Thomas Stone\r\n\r\nPriscila is a young &amp; pretty woman who is a little bit shy but curious enough to go with Pierre to special parties. This time around, the party is bound to be much crazier than usual though. Indeed, Priscila will learn new ways of making her body speak and experience some quite extreme sexual pleasures. Introduced to the underworld by Patricia, Prisicila will slowly lose herself in all sorts of games, intimate caresses, eager fellatios, threesome and domination. To her own surprise, she will even have a devastating orgasm whilst playing with girls. But the cherry on the cake will come later in the night when our beautiful Priscila ends up having sex with four hungry young hunks ... all at once!\r\nAn explosive new Marc Dorcel production that pushes the boundaries of sensuality and eroticism. Fellatios and cunnilingus, penetrations and deep sodomy succeed one another whilst our very hot and shameless girls surrender to the most extreme of excesses.\r\n\r\nPriscilla - young attractive woman, which is a little shy but curious enough to go with his friend, Pierre, at a special party. At this time, the party will be much crazier than usual. Indeed, Priscilla discovers new possibilities of his body and experience some pretty risky sexual pleasure. Invited Patricia Priscilla is gradually lost in all sorts of games, the intimate caresses, eager blowjob sex and domination. To her own surprise, she experienced an orgasm, playing with the other girls. But the climax of the night will be a time when our beautiful Priscilla will have sex with four hungry young males ... both!\r\nThe new explosive film from Marc Dorcel, transcending the boundaries of sensuality and eroticism. Fellatio and cunnilingus, deep penetration and sodomy follow one another at a time when our hot girls and shameless surrender to the most extreme pleasures.\r\n\r\n\r\nSwitching to a different audio track is performed on the player by pressing the &quot;Audio&quot; or &quot;Language&quot;.\r\n\r\nQuality: DVDRip 480p\r\nFormat: MKV\r\nVideo codec: H.264 / AVC\r\nAudio codec: AC-3\r\nVideo: MPEG4 Video (H264) 720x480 29.97 fps\r\n1 Audio: Dolby AC3 48000Hz stereo 192 kbps (RUS)\r\n2 Audio: Dolby AC3 48000Hz stereo 160 kbps (ENG)\r\n3 Audio: Dolby AC3 48000Hz stereo 160 kbps (FRE)","torrent":{"xt":"urn:btih:ea4466f266d6f26081850e0c4febc503cab67c59","amp;dn":"Priscila+s+Initiation+2006+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea4466f266d6f26081850e0c4febc503cab67c59","infoHashBuffer":{"type":"Buffer","data":[234,68,102,242,102,214,242,96,129,133,14,12,79,235,197,3,202,182,124,89]},"announce":[],"urlList":[]}}