{"title":"4Videosoft.Screen.Capture.1.0.16","uid":14719954,"size":19544873,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea4cc34a11c9a7ecfef27d4ae57d8421e11787a3&amp;dn=4Videosoft.Screen.Capture.1.0.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"roflcopter2110","files":4,"time":1464493217,"description":"https://extraimago.com/images/2016/05/29/4VideosoftScreenCapture.md.jpg\r\n\r\n4Videosoft.Screen.Capture.1.0.16\r\n\r\n4Videosoft Screen Capture – As the professional screen capture program, it enables you to record and save video and audio in your Windows7/8/10.\r\n\r\nFeatures\r\nCapture digital/streaming/network/webcam video\r\n• 4Videosoft Screen Capture qualifies in capturing screen videos. Whether you want to capture streaming YouTube videos, or want to record live games videos, you are able to use this video capture program to record videos from YouTube, Twitch, Netflix,etc. Also if you attend an online meeting, or make a Skype call, you can also record the video from webcam for future use. Moreover, this video capture software enables you to capture screen for tutorials for sharing in an online course.\r\n\r\nRecord audio for replaying on your PC\r\n• Working as a streaming audio recorder, 4Videosoft Screen Capture, makes it easy for you to record audio from computer and microphone. Instead of purchasing music from online store, you can capture free online music from Pandora for playback in your PC. Free from internet connection, you are capable of listening offline music from Spofify, SoundCloud, etc. when driving. You can also record microphone audio and system audio to save the conversation in a business talk in case.\r\n\r\nCustomize video and audio setting before capturing\r\n• This Windows screen capture utility facilitates you to make setting for video and audio before capturing screen. You can choose full screen or customized screen for your recording area. In this way, you can get rid of letter box to capture YouTube video freely. The optional audio settings enable you to capture system audio losslessly for getting massive free music online. Also you can record microphone audio and system audio to save the Skype video conversation from your families or friends in the front of computer.\r\n\r\nOperate easily with simple interface\r\n• The simple interface of 4Videosoft Screen Capture enables you to capture screen video and audio in Windows. The user-friendly hotkeys give you a quick operation. You are allowed to follow or change the hotkeys to stop/start or pause/resume capture according to your preference. If you are busy in other things, you could set the duration time to stop capturing screen automatically. Also you can highlight the mouse cursor to show it in your recording for convenient operation","torrent":{"xt":"urn:btih:ea4cc34a11c9a7ecfef27d4ae57d8421e11787a3","amp;dn":"4Videosoft.Screen.Capture.1.0.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea4cc34a11c9a7ecfef27d4ae57d8421e11787a3","infoHashBuffer":{"type":"Buffer","data":[234,76,195,74,17,201,167,236,254,242,125,74,229,125,132,33,225,23,135,163]},"announce":[],"urlList":[]}}