{"title":"Numerical Methods for Chemical Engineering Using Excel, VBA, and","uid":12401871,"size":5794250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec301944d7428d8704d3396f1d7c91493a8ab5a7&amp;dn=Numerical+Methods+for+Chemical+Engineering+Using+Excel%2C+VBA%2C+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442037845,"description":"Numerical Methods for Chemical Engineering Using ExcelÂ®, VBA, and MATLABÂ® - Victor J. Law (CRC, 2013).pdf\n\nISBN: 978-1-4665-7535-6\n\nWhile teaching the Numerical Methods for Engineers course over the last 15 years, the author found a need for a new textbook, one that was less elementary, provided applications and problems better suited for chemical engineers, and contained instruction in Visual BasicÂ® for Applications (VBA). This led to six years of developing teaching notes that have been enhanced to create this textbook.\n\nFocusing on Excel gives the advantage of it being generally available, since it is present on every computer, PC and Mac, that has Microsoft Office installed. The VBA programming environment comes with Excel and greatly enhances the capabilities of Excel spreadsheets. While there is no perfect programming system, teaching this combination offers knowledge in a widely available program that is commonly used (Excel) as well as a popular academic software package (MATLAB). Chapters cover nonlinear equations, Visual Basic, linear algebra, ordinary differential equations, regression analysis, partial differential equations, and mathematical programming methods.\nEach chapter contains examples that show in detail how a particular numerical method or programming methodology can be implemented in Excel and/or VBA (or MATLAB in chapter 10). Most of the examples and problems presented in the text are related to chemical and biomolecular engineering and cover a broad range of application areas including thermodynamics, fluid flow, heat transfer, mass transfer, reaction kinetics, reactor design, process design, and process control. The chapters feature &quot;Did You Know&quot; boxes, used to remind readers of Excel features. They also contain end-of-chapter exercises, with solutions provided","torrent":{"xt":"urn:btih:ec301944d7428d8704d3396f1d7c91493a8ab5a7","amp;dn":"Numerical+Methods+for+Chemical+Engineering+Using+Excel%2C+VBA%2C+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec301944d7428d8704d3396f1d7c91493a8ab5a7","infoHashBuffer":{"type":"Buffer","data":[236,48,25,68,215,66,141,135,4,211,57,111,29,124,145,73,58,138,181,167]},"announce":[],"urlList":[]}}