{"title":"Burnout 3: Takedown","uid":11890386,"size":2867822592,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ec55ee50e0385d193b8abe007d9a3af0b63f531f&amp;dn=Burnout+3%3A+Takedown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mas6545","files":1,"time":1430981727,"description":"Download and play. Not the Xbox version. For NTSC PS2 only.\n\n[Wikipedia]\nGameplay carries on the high speed gameplay of previous entries in the series, in which players race through various courses, earning boost by driving in oncoming traffic lanes, narrowly avoiding other vehicles, and drifting. The main new addition to the series gameplay is a focus on 'Takedowns', in which players are encouraged to try and take down their opponents by knocking into them and causing them to crash, upon which they are granted an extension to their boost meter. If the player themselves crashes (upon which they will lose some of their boost meter) they can activate Impact Time, which allows them to steer their vehicle in mid-crash towards other vehicles, triggering 'Aftertouch Takedowns'.\n\nThere are four main styles of events; Races, which are general races to the finish line against other racers; Time Attack, which tasks players with beating a course within a time limit; Road Rage, in which players must perform as many takedowns as possible against computer opponents without being taken down themselves; and Crash, a unique mode that makes use of the game's new crash mechanics. In Crash mode, players drive their vehicle straight into an intersection with the goal of causing as many vehicles as possible to become involved the wreckage, with the player accumulating 'Crash dollars' for the damage caused. These events are featured in the Burnout World Tour mode, where players progress through numerous events to unlock hidden tracks and vehicles","torrent":{"xt":"urn:btih:ec55ee50e0385d193b8abe007d9a3af0b63f531f","amp;dn":"Burnout+3%3A+Takedown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec55ee50e0385d193b8abe007d9a3af0b63f531f","infoHashBuffer":{"type":"Buffer","data":[236,85,238,80,224,56,93,25,59,138,190,0,125,154,58,240,182,63,83,31]},"announce":[],"urlList":[]}}