{"title":"The Language of Mathematics: Telling Mathematical Tales","uid":4727506,"size":825878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec648b28309ef0db81533a17520176a50740a863&amp;dn=The+Language+of+Mathematics%3A+Telling+Mathematical+Tales&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":1,"time":1234825150,"description":"The Language of Mathematics: Telling Mathematical Tales emerges from several contemporary concerns in mathematics, language, and mathematics education, but takes a different stance with respect to language. Rather than investigating the way language or culture impacts mathematics and how it is learned, this book begins by examining different languages and how they express mathematical ideas. The picture of mathematics that emerges is of a subject that is much more contingent, relative, and subject to human experience than is usually accepted. Bartons thesis takes the idea of mathematics as a human creation, and, using the evidence from language, comes to more radical conclusions than usual. \nEveryday mathematical ideas are expressed quite differently in different languages. Variety occurs in the way languages express numbers, describe position, categorise patterns, as well as in the grammar of mathematical discourse. The first part of The Language of Mathematics: Telling Mathematical Tales explores these differences and thus illustrates the possibility of different mathematical worlds. This section both provides evidence of language difference with respect to mathematic talk and also demonstrates the congruence between mathematics as we know it and the English language. Other languages are not so congruent. \nPart II discusses what this means for mathematics and argues for alternative answers to conventional questions about mathematics: where it comes from, how it develops, what it does and what it means. The notion that mathematics is the same for everyone, that it is an expression of universal human thought, is challenged. In addition, the relationship between language and mathematical thought is used to argue that the mathematical creativity embedded in minority languages should continue to be explored \nThe final section explores implications for mathematics education, discussing the consequences for the ways in which we learn and teach mathematics. \nThe Language of Mathematics: Telling Mathematical Tales will appeal to those interested in exploring the nature of mathematics, mathematics educators, researchers and graduate students of mathematics education. ","torrent":{"xt":"urn:btih:ec648b28309ef0db81533a17520176a50740a863","amp;dn":"The+Language+of+Mathematics%3A+Telling+Mathematical+Tales","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec648b28309ef0db81533a17520176a50740a863","infoHashBuffer":{"type":"Buffer","data":[236,100,139,40,48,158,240,219,129,83,58,23,82,1,118,165,7,64,168,99]},"announce":[],"urlList":[]}}