{"title":"OrangeCD v5 2 0 Build 7523 English Plus Serial","uid":3318475,"size":1958061,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ed3c68f414e28da4471a1e4d8946b3adc75ff18f&amp;dn=OrangeCD+v5+2+0+Build+7523+English+Plus+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"j4gg3r","files":2,"time":1113831494,"description":"OrangeCD Catalog is the comprehensive music database program for cataloging your music in any format: CDs, DVDs, records, MP3 files or tapes. To add a new CD to the database, you just need to insert the CD in your computer, and OrangeCD will download all information from Internet. You don't have to type a single word. Filling your music CD database becomes quick and easy.\n\nThe resulting database can be used for browsing, searching, printing or exporting to any of the supported formats. Now you can quickly check if you own a specific album or song, find its exact location on CD shelf, print CD changer index sheet or calculate your total collection value for insurance purposes. You can create web pages with the list of all your albums and upload them to your website. The feel and look of the web pages is defined by templates and can be customized even if you know nothing about HTML language.\n\nUsing OrangeCD Catalog, you can:\n\n    * Add your CD albums to the database without typing.\n    * Add your MP3 albums by scanning disk folders.\n    * Sort your albums alphabetically or chronologically, by any field, with one click.\n    * Display albums in folders grouped by any field.\n    * Search your albums for a text string or by any combination of fields.\n    * Print the list of your albums.\n    * Create detailed and customizable web pages with your albums, including index page.\n    * Create plain text reports.\n    * Display statistics by any field.\n    * Backup your data automatically or by request. \n\nOther benefits are:\n\n    * Friendly, intuitive and customizable user interface.\n    * Comprehensive set of fields, including lyrics, covers, recording credits and custom fields.\n    * Tight integration with our freeware CD player.\n    * Free lifetime upgrades.","torrent":{"xt":"urn:btih:ed3c68f414e28da4471a1e4d8946b3adc75ff18f","amp;dn":"OrangeCD+v5+2+0+Build+7523+English+Plus+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed3c68f414e28da4471a1e4d8946b3adc75ff18f","infoHashBuffer":{"type":"Buffer","data":[237,60,104,244,20,226,141,164,71,26,30,77,137,70,179,173,199,95,241,143]},"announce":[],"urlList":[]}}