{"title":"Academic's Support Kit","uid":7924687,"size":3245582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed4617d9898c0641f6e04008c9e17b6bc198fcf8&amp;dn=Academic%27s+Support+Kit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jenson100","files":-1,"time":1355554893,"description":"Publication Date: January 5, 2005 | ISBN-10: 0761942327 | ISBN-13: 978-0761942320 | Edition: 1\n\n'Thanks for the brilliance, wisdom and humour of Boden, Epstein and Kenway. I will buy this KIT for all of my students, as they leave graduate school and venture into university life on their own. The Academic's Support Kit provides a virtual support group for young academics groping to find their way in the rapidly changing terrain of higher education. And there are some tips for those of us who have been around too long, as well'\n\n-Michelle Fine, The City University of New York\n\n`Comprehensive and comprehendible information, alongside sensible, practical strategies and exercises, that I will be able to employ when developing my own academic career and to facilitate my staff development and peer mentoring work' - Sandra Sinfield, London Metropolitan University\n\n`The Kit is excellent. And it is not just for academic starters either. This is a collection of books which every academic could refer to confident that she or he will benefit from the experiences shared, the perspectives offered and the advice given' - Robert Morrell, University of KwaZulu-Natal\n\n`This is an eminently practical guide to getting ahead as a university academic employee' - Clive Seale, Brunel University\n\nThe Academic's Support Kit is a unique resource that provides all the information, skills and guidance to support academic professional development.\n\nWritten by a team of experienced and international authors, the Kit offers a wealth of references, techniques and practical advice in the following 6 books:\n\n- Building Your Academic Career\n\nThis volume encourages you to take a proactive approach to getting what you want out of academic work whilst being a good colleague\n\n- Getting Started On Research\n\nIn contrast to the many books available on techniques of data collection and analysis, this volume deals with the many other practical considerations around actually doing research\n\n- Writing for Publication\n\nThis book deals with a number of generic issues around academic writing and considers writing refereed journal articles, books and book chapters in detail as well as other, less common, forms of publication for academics\n\n- Teaching and Supervision\n\nThis volume is on presents explanations and possible strategies designed to make your teaching and supervision work less burdensome, more rewarding (for you and your students) and manageable.\n\n- Winning and Managing Research Funding\n\nThe pressure to win funding to do research is felt by nearly all academics worldwide. This book details strategies that you might adopt to get your research projects funded, and manage your research projects once they are funded.\n\n- Building Networks\n\nHaving good networks is key to achieving what you want in academia. This book describes the kinds of networks that you might build across a range of settings, talks about the pros and cons involved and gives practical guidance on networking activities.\n\nThis Kit will be an indispensable guide, for those starting out on an academic career, and those needing to make the next step up the ladder. It will also be welcomed as the complete resource for managers and staff development teams.\n","torrent":{"xt":"urn:btih:ed4617d9898c0641f6e04008c9e17b6bc198fcf8","amp;dn":"Academic%27s+Support+Kit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed4617d9898c0641f6e04008c9e17b6bc198fcf8","infoHashBuffer":{"type":"Buffer","data":[237,70,23,217,137,140,6,65,246,224,64,8,201,225,123,107,193,152,252,248]},"announce":[],"urlList":[]}}