{"title":"The Beatles - You've  Hide Your Love Away [Help! soundtrack prom","uid":9693644,"size":141051904,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ed4c94c8658e94aae207e4e765982b063dac1fbc&amp;dn=The+Beatles+-+You%27ve++Hide+Your+Love+Away+%5BHelp%21+soundtrack+prom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1393904605,"description":"The Beatles - You've Got to Hide Your Love Away [Help! soundtrack promo].VOB\n\n\nHQ rare promo music video from the Help! film soundtrack. &quot;You've Got to Hide Your Love Away&quot; is a song by English rock band the Beatles. It was written and sung by John Lennon (credited to Lennon &amp; McCartney) and released on the album Help! in August 1965.\n\nLennon's vocal style was inspired by the American singer Bob Dylan. Lennon wrote the song at home during what he called his &quot;Dylan period&quot;, wanting another song for the film Help!. The song &quot;is just basically John doing Dylan&quot;, Paul McCartney confirmed.\n\nIn the film Help!, at the opening of the song, the head of the cult, Clang (Leo McKern), appears from underneath a manhole cover in the middle of Ailsa Avenue, London, where parts of the film were shot. He stays there for the whole song, which the Beatles play in Lennon's quarter of the Beatles' shared flat. The flute part of the song is performed by George's in-house gardener (who also trims his grass carpet with chattery teeth). They are watched by Ahme (Eleanor Bron), and at the end of the song, Harrison passes out after Ahme produces a giant needle for Starr, who is wearing the ring the cult is seeking.\n\nWhen Lennon made a mistake during the recording, singing &quot;two foot small&quot; instead of &quot;two foot tall&quot;, he is reported to have said: &quot;Let's leave that in, actually. All those pseuds will really love it.&quot;\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/You've_Got_to_Hide_Your_Love_Away&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/You've_Got_to_Hide_Your_Love_Away&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/iaKJdAafl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iaKJdAafl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (16:9) 25fps 9800kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:02:10\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:ed4c94c8658e94aae207e4e765982b063dac1fbc","amp;dn":"The+Beatles+-+You%27ve++Hide+Your+Love+Away+%5BHelp%21+soundtrack+prom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed4c94c8658e94aae207e4e765982b063dac1fbc","infoHashBuffer":{"type":"Buffer","data":[237,76,148,200,101,142,148,170,226,7,228,231,101,152,43,6,61,172,31,188]},"announce":[],"urlList":[]}}