{"title":"The Best of Mike Oldfield - Elements","uid":6493389,"size":60694988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee2fd3b3eac0ea26e917b8b7c28e6daf4ad6b900&amp;dn=The+Best+of+Mike+Oldfield+-+Elements&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zaankanter","files":16,"time":1308973391,"description":"Mike Oldfield was born in England in 1953, the multi instrumentalist laid down a landmark in music with his 1973 album, Tubular Bells.\n\n Oldfield began his musical career playing folk music and with his sister Sally formed The Sallyangie, after which he teamed up with his brother Terry in the rock band Barefoot before going on to join Kevin Ayers in The Whole World. His two years with the band produced the albums whatevershebringswesing and Shooting at the Moon after which he left to work on his own ideas.\n\n In 1973 Oldfield released Tubular Bells, a two part instrumental piece which introduced themes and developed them in a classical style. Oldfield played most of the instruments himself, multi-tracking them, which was something of a rarity at the time. He convinced Richard Branson to make Tubular Bells, not regarded as traditional pop fare, the debut album of Branson's new record label Virgin Records. The album was a huge commercial success, establishing Mike Oldfield and securing the future for Virgin Records. The album spent 279 weeks on the charts and is amongst the best selling albums in the UK.\n\n The music was later used in the 1974 film The Exorcist for which he received the Grammy Award for Best Instrumental Composition. The follow up Hergest Ridge went to No.1 in the UK, but was dislodged from the top spot by a re-emergent Tubular Bells.\n\n Subsequent releases failed to match the commercial success of Tubular Bells although his music proved to be successful for other artists; the Hall &amp; Oates cover of &quot;Family Man&quot; was a top ten hit in the UK and US, while Bonnie Tyler charted with &quot;Islands&quot;. In 1983 Maggie Reilly and Oldfield had a hit with &quot;Moonlight Shadow&quot;.\n\n Oldfield turned his writing skills to other media providing music for the 1984 film The Killing Fields and in 2002 he released a computer game,Tr3s Lunas which allowed the player to interact with music from the album of the same name.\n\n In 2003, on the thirtieth anniversary of its release, he returned to Tubular Bells, re-recording the album with the benefits of modern technology.\n\n Track Listings\n 1. Tubular Bells (Opening Theme) \n2. Family Man \n3. Moonlight Shadow \n4. Heaven's Open \n5. Five Miles Out \n6. To France \n7. Foreign Affair \n8. In Dulci Jubilo \n9. Shadow On The Wall \n10. Islands \n11. Etude \n12. Sentinel \n13. Ommadawn (Exerpt) \n14. Incantations Part Four Excerpt) \n15. Amarok (Excerpt) \n16. Portsmouth \n\n\n\nPlease keep seeding after download! Big Thanks!\n Cheers","torrent":{"xt":"urn:btih:ee2fd3b3eac0ea26e917b8b7c28e6daf4ad6b900","amp;dn":"The+Best+of+Mike+Oldfield+-+Elements","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2fd3b3eac0ea26e917b8b7c28e6daf4ad6b900","infoHashBuffer":{"type":"Buffer","data":[238,47,211,179,234,192,234,38,233,23,184,183,194,142,109,175,74,214,185,0]},"announce":[],"urlList":[]}}