{"title":"Plasmonics - Fundamentals and Applications - Stefan A. Maier","uid":15522255,"size":13728172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee4e1d64c55aa28753c5f19d1d370add6af5ce80&amp;dn=Plasmonics+-+Fundamentals+and+Applications+-+Stefan+A.+Maier&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470760464,"description":"Plasmonics - Fundamentals and Applications - Stefan A. Maier (Springer, 2007).pdf\r\n\r\nConsidered one of the major fields of photonics of the beginning 21st century, plasmonics offers the potential to confine and guide light below the diffraction limit and promises a new generation of highly miniaturized photonic devices. Offering both a comprehensive introduction to the field and an extensive overview of the current state of the art, &quot;Plasmonics: Fundamentals and Applications&quot; should be of great value to the newcomer and to the experienced researcher.\r\n\r\nThe first part of the book describes the fundamentals of this research area, starting with a review of Maxwell’s equations in a form suited to the description of metals. Subsequent chapters introduce the two major ingredients of plasmonics, surface plasmon polaritons at metallic interfaces and localized plasmons in nanostructures. The mathematics of their description, excitation and imaging of the modes are discussed. This part closes with a presentation of electromagnetic surface waves at lower frequencies in the THz and microwave regime, comprising both spoof or designer plasmons and surface phonon polaritons.\r\n\r\nBuilding on the fundamentals, the second part discusses some of the most prominent applications of plasmons: Plasmon waveguides, extraordinary transmission through aperture arrays, sensing and surface enhanced Raman scattering, spectroscopy as well as metamaterials. Exemplary studies in each of these fields taken from the original literature are presented","torrent":{"xt":"urn:btih:ee4e1d64c55aa28753c5f19d1d370add6af5ce80","amp;dn":"Plasmonics+-+Fundamentals+and+Applications+-+Stefan+A.+Maier","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee4e1d64c55aa28753c5f19d1d370add6af5ce80","infoHashBuffer":{"type":"Buffer","data":[238,78,29,100,197,90,162,135,83,197,241,157,29,55,10,221,106,245,206,128]},"announce":[],"urlList":[]}}