{"title":"B is for Bauhaus, Y is for YouTube: Designing the Modern World","uid":11718604,"size":4153126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eeb9623938b9cb3db3f685f3e94f44634f41949a&amp;dn=B+is+for+Bauhaus%2C+Y+is+for+YouTube%3A+Designing+the+Modern+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1424707246,"description":"B is for Bauhaus, Y is for YouTube: Designing the Modern World from A to Z by Deyan Sudjic\nRequirements: ePUB reader, 3.8 MB\nOverview: A tool kit, done in A--Z form, for understanding the world around us through the way we design and use things. Covering subjects that range from authenticity to Grand Theft Auto to Dieter Rams, Deyan Sudjic's latest book has been called &quot;a master class in musing on modern design.&quot; Though it is organized in A--Z format, it is not a dictionary or an encyclopedia in the strictest sense. Rather, it is an essential tool kit for understanding the world through emblematic examples, both historic and contemporary, from the field of design. In stand-alone chapters, Sudjic explores concepts as a whole, specific movements, or specific objects and people. The result is a kaleidoscopic view of the profound way in which design--both good and bad--has colored the modern world and influenced our interactions with popular culture. Woven throughout are surprisingly nostalgic remembrances and intensely personal perspectives on a life in design by someone who clearly lives and breathes it. Sudjic demonstrates not only a passion for the subject, but also an ability to illuminate what is most inspiring and intriguing about the way we create","torrent":{"xt":"urn:btih:eeb9623938b9cb3db3f685f3e94f44634f41949a","amp;dn":"B+is+for+Bauhaus%2C+Y+is+for+YouTube%3A+Designing+the+Modern+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb9623938b9cb3db3f685f3e94f44634f41949a","infoHashBuffer":{"type":"Buffer","data":[238,185,98,57,56,185,203,61,179,246,133,243,233,79,68,99,79,65,148,154]},"announce":[],"urlList":[]}}