{"title":"Led Zeppelin IV 24 Bit Vinyl Pack","uid":9418194,"size":4885352422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eedc189d9ed3bb43a86fb7f9f50e92812c108c1e&amp;dn=Led+Zeppelin+IV+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1388500732,"description":"\n  Led Zeppelin IV 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Hard Rock, Album Rock, Arena Rock, Heavy Metal\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  4 Versions\n\n  24/96\n\n  Special (Reel to Reel)\n  Special Reissue (1982)\n  45 RPM Classic Records\n   \n  24/192\n\n  Rare 1971 UK 1st Sampler \n\n  Encompassing heavy metal, folk, pure rock &amp; roll, and blues, Led Zeppelin's untitled fourth album is a monolithic record, defining not only Led Zeppelin but the sound and style of '70s hard rock. Expanding on the breakthroughs of III, Zeppelin fuse their majestic hard rock with a mystical, rural English folk that gives the record an epic scope. Even at its most basic -- the muscular, traditionalist &quot;Rock and Roll&quot; -- the album has a grand sense of drama, which is only deepened by Robert Plant's burgeoning obsession with mythology, religion, and the occult. Plant's mysticism comes to a head on the eerie folk ballad &quot;The Battle of Evermore,&quot; a mandolin-driven song with haunting vocals from Sandy Denny, and on the epic &quot;Stairway to Heaven.&quot; Of all of Zeppelin's songs, &quot;Stairway to Heaven&quot; is the most famous, and not unjustly. Building from a simple fingerpicked acoustic guitar to a storming torrent of guitar riffs and solos, it encapsulates the entire album in one song. Which, of course, isn't discounting the rest of the album. &quot;Going to California&quot; is the group's best folk song, and the rockers are endlessly inventive, whether it's the complex, multi-layered &quot;Black Dog,&quot; the pounding hippie satire &quot;Misty Mountain Hop,&quot; or the funky riffs of &quot;Four Sticks.&quot; But the closer, &quot;When the Levee Breaks,&quot; is the one song truly equal to &quot;Stairway,&quot; helping give IV the feeling of an epic. An apocalyptic slice of urban blues, &quot;When the Levee Breaks&quot; is as forceful and frightening as Zeppelin ever got, and its seismic rhythms and layered dynamics illustrate why none of their imitators could ever equal them.","torrent":{"xt":"urn:btih:eedc189d9ed3bb43a86fb7f9f50e92812c108c1e","amp;dn":"Led+Zeppelin+IV+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eedc189d9ed3bb43a86fb7f9f50e92812c108c1e","infoHashBuffer":{"type":"Buffer","data":[238,220,24,157,158,211,187,67,168,111,183,249,245,14,146,129,44,16,140,30]},"announce":[],"urlList":[]}}