{"title":"The Dessert Book- Duncan Hines [PDF] [StormRG]","uid":11102157,"size":3870473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef4e31ad5e242b6b05c03b462b9344173362b2dc&amp;dn=The+Dessert+Book-+Duncan+Hines+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1411682035,"description":"The Dessert Book\nAuthor: Duncan Hines\nPublished: 2014\nPublisher: University Press of Kentucky\nISBN: 9780813144658\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nKentucky native and national tastemaker Duncan Hines (1880--1959) published his first cookbook, Adventures in Good Cooking, in 1939 at the age of 59. This best-selling collection featured recipes from select restaurants across the country as well as crowd-pleasing family favorites, and it helped to raise the standard for home cooking in America. Following the success of this debut, Hines penned The Dessert Book in 1955. Filled with decadent treats, from homemade ice cream royale to fried apple pie to praline fudge frosting, this book inspired the recipes for the earliest boxed cake mixes and baked goods that carried the Duncan Hines name.\n\nFeaturing a new introduction by Hines biographer Louis Hatchett, this classic cookbook serves up a satisfying slice of twentieth-century Americana, direct from the kitchen of one of the nation's most trusted names in food. Now a new generation of cooks can enjoy and share these delectable dishes with family and friends.","torrent":{"xt":"urn:btih:ef4e31ad5e242b6b05c03b462b9344173362b2dc","amp;dn":"The+Dessert+Book-+Duncan+Hines+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef4e31ad5e242b6b05c03b462b9344173362b2dc","infoHashBuffer":{"type":"Buffer","data":[239,78,49,173,94,36,43,107,5,192,59,70,43,147,68,23,51,98,178,220]},"announce":[],"urlList":[]}}