{"title":"Endless Legend v1.0.7 - Cracked","uid":11237321,"size":1897667496,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f00aa011185caf9992513c6ccbd4f4fe2924002e&amp;dn=Endless+Legend+v1.0.7+-+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1413611027,"description":"Endless Legend v1.0.7 - Cracked\n\nExtract 7zip &amp; play!\n\n\nRELEASE NOTES [1.0.7]\n\nCHANGES AND ADDITIONS\n\n    Added the Italian version of Endless Legend.\n    Reduced the arrival of roaming faction armies in Newbie and Easy difficulties.\n    Updated the strategic resources costs on city improvements.\n    Reduced Subterranean Gardens Food bonus in Winter from 15 to 10 (per exploitation tile).\n    Changed &quot;Scientific Envoy&quot; strategic cost from 20 Glassteel to 20 Titanium (since that improvement gives more science on trade routes and Science improvements require Titanium, not Glassteel like Dust improvements)\n    Changed &quot;Army Manual&quot; strategic cost from 5 Mithrite to 5 Hyperium (XP bonuses are linked to Hyperium)\n    Changed XP gains:\n        Doubled Hero XP gains for Search, Bribe, Conversion, Siege and when defending against a Siege.\n        Slightly increased Hero XP gain as governor when an element in the city construction queue is built/recruited.\n        Removed Hero XP gain when colonizing.\n    Rework the Broken Lord formula: now the cost increases way slower depending on the empire scale.\n    Lowered effect of regeneration: 5 /10 / 15 =&gt; 2 /4 / 6 per level\n    Removed additional +1 vision on city center gained in Roving Clans' &quot;Tower defense&quot; improvement\n    Tweaked the values and prerequisites of two Necrophages quest city improvements.\n    Tweaked prerequisite of side quests asking to reach 40 of science or industry during 10 turns.\n    Tweaked Conversion trait to make sure additional cities pay 5 times less than the main city per converted village within the empire.\n    Changed the whole formula for the military power AI evaluation: the AI makes a better evaluation before attacking an army.\n    Reduced the heuristic for weapon technologies: the more the AI has weapon/armor technologies, the less it wants more of them.\n    Allowed multiple attacks for AI empires.\n    Improved the opportunistic AI behavior when near a ruin.\n    Increased the diversity of units used by the AI empires.\n    Added a new influence trend rule: the influence points gained per turn from an alliance now increase in time.\n    Removed invalid term when a contract is counter proposed. \n\n\nIMPORTANT FIXES\n\n    Added more information to the logs provided by the World Generator.\n    Changed the way the World Generator is compiled in order to fix issues with some configurations.\n    Fixed an issue where a NullReferenceException assert is displayed when teleport is used on sieged city with battle.\n    Fixed an issue where the Besieger tag on an army are not properly removed.\n    Fixed an issue where AI garrison does not keep more than one unit.\n    Fixed an issue where Auto battle takes place instead of Manual battle if there is an fleet nearby that could come as reinforcements.\n    Fixed an issue where Trade Routes cause a desync. \n\n\nOTHER FIXES\n\n    Fixed an issue with the AI when the pacified village are too far.\n    Fixed an issue where AI conversion does not work when the village is pacified.\n    Fixed an issue where AI does not convert enemy villages.\n    Fixed an issue where AI does not complete quests.\n    Fixed an issue where a level up notification is displayed even if the unit has reached the max level.\n    Fixed an issue with side quests asking to build an &quot;Only One Per Empire&quot; city improvement in a specific city.\n    Fixed an issue with the prerequisite of the &quot;Master of Luxury&quot; quest.\n    Fixed an issue where the Ardent Mages Era 6 &quot;Sacrificial amplifiers&quot; technology is counted for Scientific Victory.\n    Fixed an issue with the Cultists Faction color.\n    Fixed an issue where building a settler for the Broken Lords cost 2 populations.\n    Fixed an issue where the &quot;Food efficient&quot; and &quot;Agriculturally Challenged&quot; traits can be added to the same custom faction.\n    Fixed an issue where Villages pacified by force do not grant vision when converted by the cultists major faction.\n    Fixed an issue where the bonus displayed for Necrophages &quot;Roadside picnic&quot; and &quot;Iron constitution&quot; skills was wrong.\n    Fixed an issue where a city is created without settler.\n    Fixed an issue where units cannot be transferred onto city tiles.\n    Fixed an issue where the army names are not properly displayed for some languages.\n    Fixed an issue where the retrofit cost does not take care of speed and empire bonuses.\n    Fixed an issue where shared vision treaties grant vision to allies from Privateer armies.\n    Fixed an issue where the Diplomatic relation state chaos now doesn't applied at the beginning of the game and at the first encounter.\n    Fixed an issue where it is not possible to change the technology selection state of a previously canceled technology after a save/load process.\n    Fixed an issue where the movement path changes color when drawn across hostile armies hidden in fog of war.\n    Fixed several localization issues with the Polish version","torrent":{"xt":"urn:btih:f00aa011185caf9992513c6ccbd4f4fe2924002e","amp;dn":"Endless+Legend+v1.0.7+-+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f00aa011185caf9992513c6ccbd4f4fe2924002e","infoHashBuffer":{"type":"Buffer","data":[240,10,160,17,24,92,175,153,146,81,60,108,203,212,244,254,41,36,0,46]},"announce":[],"urlList":[]}}