{"title":"Keith Jarrett The Koln Concert for Piano[Pdf][Piano Score][TNT]","uid":13316557,"size":4258427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f05551c5051c0d022307b953c4030e2bdecd39d1&amp;dn=Keith+Jarrett+The+Koln+Concert+for+Piano%5BPdf%5D%5BPiano+Score%5D%5BTNT%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"k12578","files":1,"time":1453832976,"description":"\n\r\nKeith Jarrett                   : The Köln Concert for Piano\r\n-------------------------------------------------------------------------------\r\nTranscription                   : Yukiko Kishinami e Kunikico Yamashita\r\nEditor                          : Kunikico Yamashita\r\nYear                            : 1991\r\nISBN                            : ISBN4-89066-150-6\r\nFile size                       : 4,5MB\r\nFormat                          : PDF\r\nGenre                           : Piano Score (transcription)\r\nPages                           : 87\r\n-------------------------------------------------------------------------------\r\nINFO\r\n-------------------------------------------------------------------------------\r\nTranscription from performance recorded live at the Opera in Koln, Jan 24, 1975  \nhttps://en.wikipedia.org/wiki/The_K%C3%B6ln_Concert \r\n«Ever since the release of THE KÖLN CONCERT recording on ECM in 1975, I have been asked by pianists, students, musicologists, and others, to publish this music so others can play it. I have steadfastly resisted for at least two reasons: (1) this was a totally improvised concert on a certain night and should go as quickly as it comes; and (2) it is almost impossible to transcribe many sections as they are on record. However, since this improvisation already exists in one permanent format (recording), and the transcription only represents the music (although it is incredibly close sometimes), I finally decided to publish this authorized edition.\r\nBy authorized I mean that I have personally overseen every step (and almost every note) of the final transcription process. While this edition is as close as possible to the music on the record, there are many places where notes are correct, but time is not, because on the recording I am playing completely out of metronomic time. There are also places where we had to choose between alternate inaccuracies. Also, we decided that notation would actually work against accuracy, since none of the notation methods of which we were aware were correct for much of the piece. It would almost need notation on every note to be accurate. For instance, on pages 50 and 51 of Part IIa there is no way to obtain, on paper, the real rhythmic sense of this section.\r\nThere is much more going on on the recording, but this ``going on'' does not always translate into notes on paper. Many notes are inferred by the rhythmic sense; others depend on the harmonics or attack of the previous note (or notes). So writing down all the notes would give more of a false view of the sense of this section than selecting some notes. And yet, even this selection cannot reveal the real sense of this section as an improvisation, where listening is what determines the music's strength.\r\nSo -- we are looking at, let us say, a picture of an improvisation (sort of like a print of a painting). You cannot see the depth in it, only the surface. As a result of all this, I am recommending that every pianist who intends to play THE KÖLN CONCERT use the recording as the final-word reference. Good luck!»  - Keith Jarrett\r\n-------------------------------------------------------------------------------\r\nMore info on original release (italian language): \r\nforum.tntvillage.scambioetico.org/index.php?showtopic=489673","torrent":{"xt":"urn:btih:f05551c5051c0d022307b953c4030e2bdecd39d1","amp;dn":"Keith+Jarrett+The+Koln+Concert+for+Piano%5BPdf%5D%5BPiano+Score%5D%5BTNT%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f05551c5051c0d022307b953c4030e2bdecd39d1","infoHashBuffer":{"type":"Buffer","data":[240,85,81,197,5,28,13,2,35,7,185,83,196,3,14,43,222,205,57,209]},"announce":[],"urlList":[]}}