{"title":"New Trolls - Searching For A Land (1972) [Flac] Progressive Rock","uid":5790156,"size":454457609,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0c920313f69ee7b002780d99ee501dee6fb2c1f&amp;dn=New+Trolls+-+Searching+For+A+Land+%281972%29+%5BFlac%5D+Progressive+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RJ65ITA","files":6,"time":1282821446,"description":"Artist: New Trolls\nAlbum title: Searching For A Land\n\nTracklist:\n\n01. Searching (4:45)\n02. Percival (5:22)\n03. In St. Peter's Day (5:00)\n04. Once That I Prayed (4:00)\n05. A Land To Live A Land To Die (8:25)\n06. Giga (2:05)\n07. To Edith (8:40)\n08. Intro (7:20)\n09. Bright Lights (6:45)\n10. Muddy Madalein (2:25)\n11. Lying Here (17:25)\n\nBand:\n\nNico Di Palo - guitar, lead vocals\nGianni Belleno - drums, vocals\nFrank Laugelli - Rhodes bass\nMaurizio Salvi - piano, organ, synthesizer\nVittorio De Scalzi - guitar \n\nGenre: Progressive Rock\nYear: 1972\nFormat: Lossless - FLAC\nScans: Included\n\nITALIANO\nPur se non conflittualmente memorabile, il terzo lavoro dei New Trolls passerÃƒÂ  alla storia per essere stato il primo album doppio di rock Italiano. Lungo, ambizioso e palesemente orientato al mercato estero, &quot;Searching for a land&quot; presenta due situazioni molto diverse tra loro, quasi a voler presagire l'imminente sbandamento del gruppo che giÃƒÂ  con quest'album soffre delle prime defezioni. Giorgio D'Adamo infatti non c'ÃƒÂ¨ giÃƒÂ  piÃƒÂ¹, sostituito degnamente dal nuovo bassista Italo-Canadese Frank Laugelli. Dicotomico al punto di sembrare tagliato con la scure, l'ellepÃƒÂ¬ si apre con 4 composizioni di stampo acustico-orchestrale cantate da De Scalzi e basate principalmente su raffinati arpeggi di chitarra, in cui si innestano con grande discrezione preziosismi vocali ed orchestrali. In questo contesto, veramente encomiabili sono la malinconica &quot;St. Peter's Day&quot;, nobilitata da una azzeccata linea di basso e la raffinata &quot;Once that I prayed&quot;. Trascorsi i 20 minuti della prima facciata, si gira il disco e si cominciano a percepire i primi segnali di cambiamento. Di fatto, in &quot;A land to live, a land to die&quot; le atmosfere si fanno piÃƒÂ¹ blues-rock: sparisce la chitarra acustica e svetta una lunga improvvisazione d'organo in stile tardo psichedelico. Trascorso un breve break a mezza via tra il medioevo e i Beatles (intitolato &quot;Giga&quot; e riferito a uno strumento a corde del trecento), arriva la &quot;summa&quot; dei sei brani precedenti nella spendida &quot;To Edith&quot;, il cui testo ÃƒÂ¨ tratto da una poesia di Bertrand Russell che ben sintetizza il concetto dell'album: &quot;l'amore, se valido e consapevole, ÃƒÂ¨ un approdo nella ricerca del senso della propria esistenza&quot;. Fin qui, per quanto ne dicano molti critici, il lavoro scorre fluido e ben strutturato e le presunte divergenze artistiche tra Scalzi e Di Palo (nella vita comunque sempre amicissimi) non sembrano minarne piÃƒÂ¹ di tanto la coerenza, anzi, le prime due facciate di &quot;Searching for a land&quot; ritengo restituiscano un'ottima prova di omogeneitÃƒÂ  compositiva e strutturale. La dicotomia  di cui abbiamo parlato prima perÃƒÂ², si fa sentire prepotentemente con l'accesso al secondo disco: a partire dal terzo lato infatti, sembra di trovarsi davanti ad un altro gruppo. Cessano di colpo le atmosfere suggestive e poetiche dei primi due lati per lasciare spazio ad un rock selvaggio di pura matrice elettrica (quasi &quot;punk&quot;, oserei dire) che richiama le prime fulminanti esibizioni live del gruppo Genovese. Questo secondo disco, si dice sia stato inciso dal vivo, ma non sono in pochi a sostenere che gli applausi furono sovraincisi su un lavoro di studio. Comunque sia, tra un fraseggio hard rock-blues di chiara matrice Zeppeliniana (&quot;Muddy Madalein&quot;) e una mostruositÃƒÂ  energetica come &quot;Bright Lights&quot;, l'album si chiude con &quot;Lying here&quot; che pare sospesa tra un brano dei Black Sabbath, un trip di Hendrix e i migliori Deep Purple. Va da se che questa coniugazione tra generi tanto diversi non giovÃƒÂ² molto alla coerenza dell'album che rimase in una sorta di &quot;limbo&quot; artistico e commerciale: diversi critici dell'epoca lo videro come un'encomiabile manifestazione di potenza e di completezza dei New Trolls. La maggioranza dei recensori e del pubblico fu perÃƒÂ² piÃƒÂ¹ realista biasimandone l'inoppugnabile frammentazione. Meglio sarebbe stato se le due anime del disco fossero state pubblicate separatamente, ma nel 1972 era evidente che un &quot;qualcosa&quot; nella macchina dei New Trolls stava cessando di funzionare. Ancora un disco insieme (&quot;UT&quot;, dello stesso anno) e poi le strade si sarebbero separate. CiÃƒÂ² nonostante nessuno mai potrÃƒÂ  appigliarsi a certi dissidi interni per svilire l'autoritÃƒÂ  musicale ed innovativa di uno dei piÃƒÂ¹ importanti gruppi di rock Italiani.\n\nENGLISH\nOriginally released as a double album (now on a single CD), &quot;Searching for a land&quot; is perhaps too heterogeneous and not always convincing but it has some very good moments. It was released for the international market and completely sung in English. In the line up the Italian-Canadian bass player Frank Laugelli replaced Giorgio D'Adamo and wrote most of the lyrics signing as Rhodes. In this album New Trolls deliberately took inspiration from foreign bands like Colosseum, Deep Purple, Led Zeppelin, though trying to keep an original touch and blending hard rock with classical influences. &quot;Travelling, wish I knew where I was going / Every place now looks the same / Nothing new seems to come my way / All my life I've been searching for something. / But I'm happy to be free and to be able to weep / And I'm happy to be me.&quot; The lyrics of the good opener &quot;Searching&quot; in my opinion seem to catch the mood of the album that sometimes lacks a definite and more personal musical direction. The second track &quot;Percival&quot; is introduced by a nice acoustic guitar arpeggio and features a distant and filtered vocal part that I don't like at all. Good the acoustic guitar solo.. &quot;In St. Peter's Day&quot; is a beautiful acoustic ballad. &quot;All the tears of the world have now been cried / I don't want to hear the screamin' of the crowd. For three times I heard the day bird cry / For three times your love I have denied now / I hear the beating of the hammers crucifying the soul off all summers.&quot; Lyrics have religious references and the guitar and keyboards parts here are quite good. &quot;Once That I Prayed&quot;, introduced by piano and vocals, is another good track that develops following classical music patterns. The sound of the organ then introduces to the rarefied and dilated &quot;A Land To Live, A Land To Die&quot;, that reminds slightly of &quot;Concerto Grosso&quot; with great keyboards organ work. &quot;Giga&quot; is just a short and nice acoustic guitar performance while &quot;To Edith&quot; is another dilated track with an excellent keyboards work that close the first part of the album. The second part of &quot;Searching For A Land&quot; was recorded live and I think that is less interesting, with more hard rock and less progressive influences. &quot;Intro&quot; is a long instrumental where the members of the band show their great musicianship: good but not outstanding. The following &quot;Bright Lights&quot; is an uninspired hard rock track and in my opinion is the weakest point of the whole album. &quot;Muddy Madalein&quot; is a hard bluesy track with a flute solo in &quot;Jethro Tull style&quot;. Interesting lyrics about a man that, while walking in the street with his child, is puzzled by the meeting with the prostitute who was his &quot;first one&quot;. The long final track &quot;Lying Here&quot; begins with classical reminiscences (Gregorian chant intro, then parts of flute and organ) and after six minutes melts into hard rock with clear references to Deep Purple. In the whole &quot;Searching For A Land&quot; is not a masterpiece. Nevertheless it is worth listen to and I think that it could be an excellent addition to any prog collection.\n(progarchives.com)\n","torrent":{"xt":"urn:btih:f0c920313f69ee7b002780d99ee501dee6fb2c1f","amp;dn":"New+Trolls+-+Searching+For+A+Land+%281972%29+%5BFlac%5D+Progressive+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c920313f69ee7b002780d99ee501dee6fb2c1f","infoHashBuffer":{"type":"Buffer","data":[240,201,32,49,63,105,238,123,0,39,128,217,158,229,1,222,230,251,44,31]},"announce":[],"urlList":[]}}