{"title":"The Book of Tells - How to Read People's Minds from Their","uid":4088523,"size":3081053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0e8fbf851dee89507bd51eceb82117d8c6d7d11&amp;dn=The+Book+of+Tells+-+How+to+Read+People%5C%27s+Minds+from+Their&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ovum","files":1,"time":1205949031,"description":"The Book of Tells (Peter Collett) - How to Read People&amp;#039;s Minds from Their Actions\n\n\n&quot;Tells&quot; are actions which reveal valuable information about what people are really thinking or feeling. They are used regularly when playing poker, but Peter Collett takes it a step farther and applies the usefulness of &quot;Tells&quot; to everyday life. He talks about tells used to show dominance, submissiveness, sexual signals, tells used while smoking, political tells, international tells, etc.\n\nI picked up this book at a Waterstones in the UK; It&amp;#039;s a shame that it&amp;#039;s not readily available on the US version of amazon.com because I found it to be a really interesting read. At times, the author became repetitive or stated the obvious, but this book was packed with tons of little interesting facts. It was a fairly quick read, and quite rewarding and entertaining as well because each time I would pick it up, I could find people around me who were using postures or other &quot;Tells&quot; that had just been described in the book. I&amp;#039;m now much more aware of the signals that I send out as well as those that others send out. Recognizing and deciphering these tells adds a whole new dimension to every social interaction/observation I have. Of course, this book won&amp;#039;t teach you to read minds, but when accompanied with good sense and intuition it can make your life a little bit more fun.\n\n---\nThis eBook is printable &amp; text-selectable.\n\nALSO all the advertisement links (to some poker site) have been REMOVED!\n---","torrent":{"xt":"urn:btih:f0e8fbf851dee89507bd51eceb82117d8c6d7d11","amp;dn":"The+Book+of+Tells+-+How+to+Read+People%5C%27s+Minds+from+Their","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e8fbf851dee89507bd51eceb82117d8c6d7d11","infoHashBuffer":{"type":"Buffer","data":[240,232,251,248,81,222,232,149,7,189,81,236,235,130,17,125,140,109,125,17]},"announce":[],"urlList":[]}}