{"title":"Paragliding_Ground_Handling_Techniques.mkv","uid":4253901,"size":452559085,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1b29553a3fc645c51a636b20517ac23a2187ada&amp;dn=Paragliding_Ground_Handling_Techniques.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"faceless_bel","files":1,"time":1214149842,"description":"Paragliding : Ground Handling Techniques\nFormat: video H264 720x480, audio Nero AAC 128kb stereo\nLanguages: English, French\n\nPracticing your ground-handling is a great way to improve your take-off technique as well as your safety in flight.\n\nThis advice is indispensable for all pilots! Whether you are a novice or a more experienced pilot, regular practice of these exercises and ground-games will allow you to refine and nurture your perceptions.\n\nAnd with improved handling of your wing, you will be more composed and more confident when you arrive at take-off.\nThe ground-handling techniques as well as the exercises presented in this DVD are carried out by highly skilled professional pilots. Watch their actions and be inspired to practice them yourself. Several 3D animations illustrate theoretical aspects, helping you to better understand the wing&amp;#039;s behaviour, positions to adopt by the pilot, and the like. \n\nChapter: Theory and Techniques of Inflation.\nAnimated sequences illustrate theoretical aspects of the inflation of the wing: the idea of the wind window, recentring, reducing the power of the wing, etc. Other sequences detail inflation techniques. These manoeuvres are carried out by different pilots and in varying contexts ( of weather conditions, equipment and environment): lots of examples and advice for adapting the technique of inflation to each situation.\n\nChapter: &quot;Edge of the Window&quot;\nA progressive series of exercises for learning how to manipulate the wing and displace yourself, including: exploring the wind window, learning to maintain the wing in a particular configuration, learning to move yourself with it. You will also see how to re-climb a slope by using these techniques and how to effect a &amp;#039;barefoot&amp;#039;\n\nChapter: &quot;Various Exercises&quot;\nRefine your perceptions and mastery of the wing thanks to this series of exercises: Learn to feel and handle the power in the wing as it climbs from the ground. You will also see how to develop very precise handling of your wing (using each half of the wing in turn), and using this technique to re-climb the hill. And for practicing inflation in safety, a sequence for learning how to effectively collapse the wing.\n\nSpecial Features:\nGet some great advice from professional pilots:\n- Interview with David Dagault (Designer and test pilot for Ozone Gliders)\n-Interview with Timothy and Anthony Green (Acro pilots), discussing ground handling, how to achieve the techniques and how they help you, how to effect certain exercises, etc.\n-Discover also some simple but very useful tips to help you in the handling of your wing.","torrent":{"xt":"urn:btih:f1b29553a3fc645c51a636b20517ac23a2187ada","amp;dn":"Paragliding_Ground_Handling_Techniques.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b29553a3fc645c51a636b20517ac23a2187ada","infoHashBuffer":{"type":"Buffer","data":[241,178,149,83,163,252,100,92,81,166,54,178,5,23,172,35,162,24,122,218]},"announce":[],"urlList":[]}}