{"title":"[NubileFilms.] Henessy","uid":8138697,"size":321793948,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f1d1732b3fe0ce45133a8ce49890b9eec770246f&amp;dn=%5BNubileFilms.%5D+Henessy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exmnova","files":1,"time":1360767242,"description":"[NubileFilms.] Henessy (Love Song / 13.11.12)\n\n\nDressed in a flowing white dress, stunning brunette Hennessy wanders outside and finds her lover Totti sleeping in a chaise in the shade. She dips her fingers in the warm pool as she approaches him, and then wakes him by dripping water over his chest and rubbing it in.\nWhen Totti opens his eyes and sees the lust written across Hennessy's face, he is instantly hard and ready for action. She stands long enough to slip the top of her dress down to her waist, exposing her perky full breasts that her man finds irresistible.\nAfter several minutes of worshipping Hennessy's tits with his hands and mouth, Totti urges her down onto her hands and knees so that he can pleasure her more intimately. Massaging her lush ass, he uses his tongue to lave along her silky shaved crevasse and up to tease the edges of her anus until Hennessy cannot stop from moaning loud and long.\nEager to return the oral favor, Hennessy climbs atop her man as he lays back against the chaise to enjoy her ministrations. Using her tongue and hands, the busty brunette laves her beau's hard cock and jacks him towards completion.\nAs Totti nears the limit of his endurance he pulls Hennessy up to straddle his hips and impale herself upon his pulsing erection. The two enjoy the intimacy of the long, slow thrusts of cowgirl position for a while before switching to doggy style.\nThe intensity of their lovemaking ratchets up another notch as they both rise to their feet and Hennessy wraps her arms around her beau's neck to anchor them together while he enters her from behind and squeezes her sensitive tits with his hands.\nWhen Hennessy's orgasm is finally within reach, they return to the chaise so that her guy can push her over the edge of pleasure in the missionary position.\nAs she basks in the afterglow, Totti withdraws from her welcoming pussy and uses his hand to jerk himself off to completion all over her smooth breasts. With a tender smile, Hennessy trails her fingers through her man's love juices before drawing him in for a final searing kiss.\n\n\nScreens:\n\n &lt;a href=&quot;\nhttp://www.pizzzoimg.info/?v=pbyOW.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pizzzoimg.info/?v=pbyOW.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.pizzzoimg.info/?v=SOYy6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pizzzoimg.info/?v=SOYy6.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f1d1732b3fe0ce45133a8ce49890b9eec770246f","amp;dn":"%5BNubileFilms.%5D+Henessy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d1732b3fe0ce45133a8ce49890b9eec770246f","infoHashBuffer":{"type":"Buffer","data":[241,209,115,43,63,224,206,69,19,58,140,228,152,144,185,238,199,112,36,111]},"announce":[],"urlList":[]}}