{"title":"Stress Test - Timothy F. Geithner - Audiobook MP3 CBR 64K","uid":10247626,"size":530329041,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f20e03b6f333b0ab25483592e5662ae3d1dca129&amp;dn=Stress+Test+-+Timothy+F.+Geithner+-+Audiobook+MP3+CBR+64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1401311886,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\nStress Test: Reflections on Financial Crises\n\nWritten by: Timothy F. Geithner\nNarrated by: Timothy F. Geithner\nLength: 18 hrs and 23 mins \nFormat: Unabridged\nRelease Date:05-12-14\nProgram Type: Audiobook\n\nFrom the former Treasury Secretary, the definitive account of the unprecedented effort to save the U.S. economy from collapse in the wake of the worst global financial crisis since the Great Depression.\n\nOn January 26, 2009, during the depth of the financial crisis and having just completed five years as President of the Federal Reserve Bank of New York, Timothy F. Geithner was sworn in by President Barack Obama as the 75th Secretary of the Treasury of the United States. Now, in a strikingly candid, riveting, and historically illuminating memoir, Geithner takes listeners behind the scenes during the darkest moments of the crisis. Swift, decisive, and creative action was required to avert a second Great Depression, but policy makers faced a fog of uncertainty, with no good options and the risk of catastrophic outcomes.\n\nStress Test: Reflections on Financial Crises takes us inside the room, explaining in accessible and forthright terms the hard choices and politically unpalatable decisions that Geithner and others in the Obama administration made during the crisis and recovery. He discusses the most controversial moments of his tenures at the Federal Reserve Bank of New York and at the Treasury, including the harrowing weekend Lehman Brothers went bankrupt; the searing crucible of the AIG bonuses controversy; the development of his widely criticized but ultimately successful plan in early 2009 to end the crisis; the bracing fight for the most sweeping financial reforms in 70 years; and the lingering aftershocks of the crisis, including high unemployment, the fiscal battles, and Europe's repeated flirtations with the economic abyss.\n\nGeithner also shares his personal and professional recollections of key players such as President Obama, Ben Bernanke, Hank Paulson, and Larry Summers, among others, and examines the tensions between politics and policy that have come to dominate discussions of the U.S. economy. An insider's account of how the Obama administration saved the economy but lost the American people, Stress Test reveals a side of Timothy Geithner that only few have seen.","torrent":{"xt":"urn:btih:f20e03b6f333b0ab25483592e5662ae3d1dca129","amp;dn":"Stress+Test+-+Timothy+F.+Geithner+-+Audiobook+MP3+CBR+64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20e03b6f333b0ab25483592e5662ae3d1dca129","infoHashBuffer":{"type":"Buffer","data":[242,14,3,182,243,51,176,171,37,72,53,146,229,102,42,227,209,220,161,41]},"announce":[],"urlList":[]}}