{"title":"Bootsy Collins - Stretchin' Out In Bootsy's Rubber Band (1976) [","uid":10744528,"size":245585989,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f2396bbe7f6d070e6dca8cf4922f5ef5113dc44c&amp;dn=Bootsy+Collins+-+Stretchin%27+Out+In+Bootsy%27s+Rubber+Band+%281976%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eugene_Debs","files":-1,"time":1407804195,"description":"Bootsy's Rubber Band - Stretchin' Out In Bootsy's Rubber Band (1976)\n\n\nStretchin' Out (In A Rubber Band) \t6:52\nPsychoticbumpschool \t5:20\nAnother Point Of View \t7:02\nI'd Rather Be With You \t5:03\nLove Vibes \t4:51\nPhysical Love \t4:49\nVanish In Our Sleep \t5:46\n\n\n\nWilliam &quot;Bootsy&quot; Collins' (bass/vocals/guitar/percussion) short but highly influential tenure with James Brown in the '70s proved to have a lasting impact -- not only on the artist, but anyone who heard the audacious funk that Bootsy, his brother Phelps &quot;Catfish&quot; Collins (guitar), and Frankie &quot;Kash&quot; Waddy (drums) brought to Brown's self-proclaimed &quot;New Breed Band&quot; -- who were soon rechristened the J.B.'s. After growing weary of the unstable monetary circumstances that seemed to surround the Godfather of Soul, the primary constituents of the J.B.'s quit. Not too much time had passed when Parliament/Funkadelic mastermind George Clinton incorporated the whole lot into his perpetually growing P-Funk family. Ever the entrepreneur, Clinton had the foresight, marketing genius, and available talent to utilize various members of the P-Funk posse in numerous side projects, the most successful of which was headed up by Bootsy and thus dubbed Bootsy's Rubber Band. Granted, at the time of their debut, Stretchin' Out in Bootsy's Rubber Band (1976), the combo consisted of a hard-working and harder-funkin' bunch of virtually unknown instrumentalists. Their status would quickly change as the Rubber Band are -- by modern standards -- nothing short of an ensemble of A-list P-Funk all-stars featuring Gary &quot;Mudbone&quot; Cooper (vocals), Robert &quot;P-Nut&quot; Johnson (vocals), Phelps &quot;Catfish&quot; Collins (guitar), Gary Shider (guitar), Michael Hampton (guitar), Frankie &quot;Kash&quot; Waddy (drums), Mudbone Cooper (drums), Bernie Worrell (keyboards), and other former James Brown bandmates Maceo Parker (sax) and Fred Wesley (trombone). When you tie the whole thing up with none other than George Clinton as producer, the remarkable potential of Bootsy's Rubber Band soon becomes clear. As early as this initial offering, Collins' output served up one side of upbeat numbers perfect for getting jiggy. Then the mood of the music begins to turn incrementally more intimate, so that by the conclusion of the second side, if circumstances warranted, you could end up with an appropriately sexy ballad as a sonic night cap of sorts. That certainly is the case on Stretchin' Out as the title track is thrust forward &quot;on the one&quot; by Collins' pulsating bass. Listeners are also introduced to the various inhabitants of the Rubber Band, such as Bootsy's &quot;Casper&quot; character -- who alternates between being the &quot;holy&quot; and the &quot;funky&quot; ghost. The concept of P-Funk babies [read: think Muppet Babies concept applied to the world of the P-Funk mob] comes to life on the bouncy &quot;Psychoticbumpschool&quot; before getting mellow with Leslyn Bailey (vocals) lending her voice to the down and funky &quot;Love Vibes&quot; and the slinky soulful &quot;Physical Love.&quot; Hardcore Funkadelic fans should ready themselves for some stunningly tasteful fretwork from an uncredited Eddie Hazel on the languid closer &quot;Vanish in Our Sleep&quot; and the previously mentioned &quot;Physical Love.&quot; Kudos go to audio engineer Bob Fisher, whose work on Collectors' Choice Music's 2007 CD reissue easily bests the sound on the comparatively pricey import version.\n &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Stretchin%27_Out_in_Bootsy%27s_Rubber_Band&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Stretchin%27_Out_in_Bootsy%27s_Rubber_Band&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.discogs.com/Bootsys-Rubber-Band-Stretchin-Out-In-Bootsys-Rubber-Band/master/14671&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Bootsys-Rubber-Band-Stretchin-Out-In-Bootsys-Rubber-Band/master/14671&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/stretchin-out-in-bootsys-rubber-band-mw0000527776&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/stretchin-out-in-bootsys-rubber-band-mw0000527776&lt;/a&gt;","torrent":{"xt":"urn:btih:f2396bbe7f6d070e6dca8cf4922f5ef5113dc44c","amp;dn":"Bootsy+Collins+-+Stretchin%27+Out+In+Bootsy%27s+Rubber+Band+%281976%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2396bbe7f6d070e6dca8cf4922f5ef5113dc44c","infoHashBuffer":{"type":"Buffer","data":[242,57,107,190,127,109,7,14,109,202,140,244,146,47,94,245,17,61,196,76]},"announce":[],"urlList":[]}}