{"title":"Hawkman v1 (1964-1968)","uid":4142290,"size":318535571,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f28a83d4d7b1136d39a1d05a871552c2033960ef&amp;dn=Hawkman+v1+%281964-1968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":29,"time":1208551973,"description":"By request from a forum. This is the first part of what amounts to pretty close to every Hawkman series \npublished. The larger body of this collection is too big to upload at once (IMHO) so I am upping it in smaller bit-sized portions. \n\nThis Torrent contains Hawkman v1 from DC Comics.\n\nHawkman is a fictional character, a superhero in the DC Comics universe. Created by writer Gardner Fox and artist Dennis Neville, the original Hawkman first appeared in Flash Comics #1 (1940)\n\nSeveral incarnations of Hawkman have appeared in DC Comics, all of them characterized by the use of archaic weaponry and by large, artificial wings, attached to a harness made from the special Nth metal that allows flight. Most incarnations of Hawkman work closely with a partner/romantic interest named Hawkgirl or Hawkwoman.\n\nThe Golden Age Hawkman was Carter Hall, an archeologist who was the reincarnation of an ancient Egyptian prince, Khufu. He and Hawkgirl used the same tools displayed in his museum to fight crime.\n\nLike most Golden Age heroes, Hawkman disappeared from print after World War II. In the Silver Age, DC introduced new versions of several characters. The new Hawkman and Hawkgirl were police officers from the planet Thanagar who stayed on Earth to help human police forces, and the Justice League, deal with supervillains.\n\nSince DC?s continuity was rewritten in the 1985 series Crisis on Infinite Earths, Hawkman?s history has become muddled with several new versions of the character appearing throughout the years, some associated with ancient Egypt and some with Thanagar. These versions of the character have starred in several series of various durations.\n\nThanks to the scanners and the original sources\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:f28a83d4d7b1136d39a1d05a871552c2033960ef","amp;dn":"Hawkman+v1+%281964-1968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f28a83d4d7b1136d39a1d05a871552c2033960ef","infoHashBuffer":{"type":"Buffer","data":[242,138,131,212,215,177,19,109,57,161,208,90,135,21,82,194,3,57,96,239]},"announce":[],"urlList":[]}}