{"title":"A Better Finder Rename 10.00 beta 2","uid":12456656,"size":8125263,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f29ffa7f9a60082a84075acbc5b5cc5fc638cc50&amp;dn=A+Better+Finder+Rename+10.00+beta+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1442756253,"description":"From MacTake.com\n\nA Better Finder Rename is the most complete renaming solution available on the market today. That's why, since 1996, tens of thousands of hobbyists, professionals and businesses depend on A Better Finder Rename to organize and maintain files. \n\nA Better Finder Rename's user interface supports complex renaming tasks without sacrificing ease and speed of use. Simply drag the files you want to rename straight from the Finder into the large preview table or the application icon.. or use our Finder context menu and hot key. \n\nThe Instant Preview feature eliminates guesswork and costly errors and helps you find the right settings quickly and accurately by providing as-you-type feedback. \n\nA Better Finder Rename offers a complete set of renaming options that are organized into 15 categories covering all the text, character, position, conversion and truncation features that you would expect from a file renamer, but it does not stop there. \n\nPhotographers use the advanced sequence number and date &amp; time features to clean up their portfolios or prepare photos for delivery to their client. A Better Finder Rename knows how to extract EXIF shooting date and time information from digital camera images and exploit them in creating sequence numbers or adding time and date information to the file name. Support for all major RAW formats (including JPEG, CRW, CR2, THM, NEF, TIFF, RAJ, ORF , MRW, DNG, PEF, SRF, etc.) extends this to professional photographers. A Better Finder Rename also deals gracefully with multiple shots captured in the same second. \n\nVersion 9 adds support for extracting camera, lens, photo and color meta-data tags and using them in the new tag rename feature. You can now also re-order sequence numbers, alphabetical sequences or roman numeral series directly through dragging and dropping items in the preview list. \n\nSystem administrators, Web masters and other power users will appreciate the presence of advanced features, such as regular expression support, conversion to Windows NTFS/SMB compatible names, the ability to import file names from a database, a spreadsheet or any other source that can produce plain or tab-delimited text files. Last but not least, the ability to save a record of the current and new file names greatly facilitates tracking your files. \n\nMusic lovers can use the built-in MP3/AAC support to exploit the id3 meta-data tags embedded in your most music files to create their own naming schemes for their music collection. Meta-data information from MP3, AAC, FLAC, OGG, APE, M4V and iTunes music store files are supported. \n\nThe multi-step renaming feature allows multiple renaming steps to be combined to deal with complex renaming jobs in a single operation. Unlike other tools, A Better Finder Rename allows any number of renaming actions to be combined, re-ordered, copied and deleted. \n\n\nWHAT'S NEW \nVersion 10.00b2: \n\nNote: You can run version 10 side-by-side with version 9. You will not be auto-updated to version 10, so you need to download the beta from this page. Version 10 is a paid upgrade ($12.95 for a version-10 license, $19.95 for a Forever license), but is free for customers who purchased the product after 1 January 2015 or who own a Forever license. The fastest way to find out whether you qualify is to download and run the beta. It will detect your code and do the right thing. \n\n- This beta introduces the &quot;This Action&quot; preview column that appears when more than one renaming action is active and displays the intermediate results of just that action. This makes it much easier to see the effect of a single action in a multi-step rename. The column shows the file name as processed by the previous action and the result of the currently selected action and highlights changes between them. \n- The second beta also contains some bug fixes and aesthetic refinements","torrent":{"xt":"urn:btih:f29ffa7f9a60082a84075acbc5b5cc5fc638cc50","amp;dn":"A+Better+Finder+Rename+10.00+beta+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f29ffa7f9a60082a84075acbc5b5cc5fc638cc50","infoHashBuffer":{"type":"Buffer","data":[242,159,250,127,154,96,8,42,132,7,90,203,197,181,204,95,198,56,204,80]},"announce":[],"urlList":[]}}