{"title":"Aeon Flux [NTSC], PS2","uid":7210189,"size":1663183613,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:f2fff86e47b5fd8d88374f0107de972d97d90959&amp;dn=Aeon+Flux+%5BNTSC%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1335213852,"description":"Aeon Flux for the Ps2                                   Rel. 11/15/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRating:        Teen\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nGame Description:\n\nAeon Flux is a 3rd person action game inspired by the 2005 movie of the same name. The story takes place 400 years in the future after the majority of Earth's population has been wiped out by industrial disease. Only one city, Bregna, remains. The city is run by the group of scientists who had discovered the vaccine to prevent the disease, but a group of rebels known as the Monicans oppose their rule. \n\nYou control the main character of the story, Aeon Flux. Aeon is a skilled fighter, and can perform light and heavy strikes, combo attacks, and a variety of acrobatic attacks. When an enemy has only a small amount of health left, you also have the ability to perform a takedown attack; when successful this will award you a bonus, such as extra health. Aeon has a health meter and a style meter; when the health meter is depleted, the game is over. The style meter is filled by attacking or killing enemies; when you have earned enough style, you can charge up your combo attacks for extra damage. Aeon is also equipped with a gun called the FUG (Flux Universal Gun) as well as various gadgets. To use the gun you will need ammo which can be picked up at various locations on each level. The various gadgets and gizmos available need to be used to get past certain areas and solve some puzzles; intel capsules provide you with important data, small orbs can be controlled to disable alarms and activate doors, Aeon can hide in rollers to navigate through areas undetected, and more. \n\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:f2fff86e47b5fd8d88374f0107de972d97d90959","amp;dn":"Aeon+Flux+%5BNTSC%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2fff86e47b5fd8d88374f0107de972d97d90959","infoHashBuffer":{"type":"Buffer","data":[242,255,248,110,71,181,253,141,136,55,79,1,7,222,151,45,151,217,9,89]},"announce":[],"urlList":[]}}