{"title":"PCs For Dummies - 12 Edition, 2013","uid":9412810,"size":42610877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f32d3fc476ec2f82b1b7baa372b2da1f838449f5&amp;dn=PCs+For+Dummies+-+12+Edition%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"svdinesh","files":4,"time":1388347480,"description":"The all-time bestselling PC reference, fully updated for the newest technologies!\n\nPrevious editions of this fun and friendly PC guide have sold more than three million copies, making it the bestselling PC reference in the world. Dan Gookin, the author whose straightforward and entertaining style is the foundation of the For Dummies series, gives you the same easy-to-follow guidance in this edition, fully updated for Windows 8, using the cloud, and all the newest PC bells and whistles. It's perfect for the absolute beginner as well as for anyone switching to the latest hardware and software.\n\n*Updated with information on all the latest upgrades, this edition of a worldwide bestseller covers all the essentials of using a PC, and presents them in a fun, non-intimidating style\n\n*Popular technology author Dan Gookin starts at the beginning with all the basics that other books assume everyone knows\n\n*Covers setting up your PC, exploring the Windows 8 interface, using network hardware and software, getting online and browsing with the newest version of Internet Explorer, setting up an e-mail account, connecting to the cloud, and using cloud-based services\n\n*Shows you how to install and upgrade programs and manage files and folders\n\n*Explores working with digital photos, downloading music, watching movies, and participating in social media\n\nPCs For Dummies, 12th Edition is the jargon-free, easy-to-use guide to everything you need to know about your PC.\n\nPCs For Dummies - 12 Edition February 11, 2013\nBook Language: English \nPages: 360\nFile Type: Pdf\nFile Size: 40.64 MB\n\nISBN-10: 1118197348\nISBN-13: 978-1118197349\n &lt;a href=&quot;\nhttp://i.imgur.com/k2YhfL6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/k2YhfL6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f32d3fc476ec2f82b1b7baa372b2da1f838449f5","amp;dn":"PCs+For+Dummies+-+12+Edition%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32d3fc476ec2f82b1b7baa372b2da1f838449f5","infoHashBuffer":{"type":"Buffer","data":[243,45,63,196,118,236,47,130,177,183,186,163,114,178,218,31,131,132,73,245]},"announce":[],"urlList":[]}}