{"title":"Railworks TS2016 DTG BR Blue Pack Loco Add-On","uid":12663501,"size":480681461,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f361364710042bd5ab7ecf3b19e5849eaf1c7e2f&amp;dn=Railworks+TS2016+DTG+BR+Blue+Pack+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TS2015","files":1,"time":1446334876,"description":"The classic Rail Blue livery of British Rail from the 1960s typified the heyday of diesel traction across the UK’s railway network, as depicted in this collection of diesel locomotives for the Weardale &amp; Teesdale Network. \r\n\r\nThe BR Class 03 was one of the most successful small shunters that British Rail ever produced, built between 1957 and 1961. With a very short 0-6-0 wheelbase, the Class 03 had a top speed of 28.5mph (46km/h) and found itself working at places like Ipswich Docks where heavier Class 08s were unable to operate, and as station pilots across the UK network. Today, a total of 56 in the Class have survived into preservation, with one remaining in active service until 2008 for Govia Thameslink Railway as a yard shunter. \r\n\r\nWith a demand for faster, less restrictive diesel locomotives in the early 1960s, the BR Class 25, with its 1,250bhp engine and 90mph (145km/h) top speed, could be seen across the UK network, earning their affectionate nickname of ‘Rat’. Initially designed for freight work, some ‘Rats’ were fitted with boilers so they could heat passenger trains, in particular on the Crewe to Cardiff services in the 1980s. In March 1987, the final Class 25 was withdrawn from service with 20 examples surviving the cutter’s torch and today can be found in various states of operation at heritage railways across the UK. \r\n\r\nThe diesel-electric BR Class 31 was built by Brush Traction between 1957 and 1962 with Mirrlees engines and a top operational speed of 80mph (129km/h). Their original 1,250bhp or 1,365bhp engines proved to be unsuccessful, and the fleet was subsequently fitted with English Electric engines instead – the same motive power as fitted to Class 37s but with a lower 1,470bhp. The Class 31 is probably best known for its numerous variants, the /0 variant easily recognisable for its lack of headcode box above the cab, earning the nickname ‘Skinhead’. \r\n\r\nThe sound of ‘Tractors’ is synonymous to the 1960s, the BR Class 37 being a frequent sight across the UK, in particular in East Anglia and Scotland hauling InterCity services. Built between 1960 and 1965 by English Electric at their Vulcan Foundry and Robert Stephenson and Hawthorns, 309 of the Class were produced. British Rail initially placed an order of 42 locomotives in January 1959, with the remainder of the Class being built between 1960 and 1965, very much as a mixed traffic locomotive, easily pulling coaches or hauling freight. \r\n\r\nBuilt by Cravens between 1956 and 1959, the BR Class 105 had the same side design profile as Mk1 coaches, utilising the same doors and windows for efficiency and cost saving. A total of 302 cars were built with 150bhp per engine and a top speed of 70mph (112km/h), initially made up as three-car (19 units) and two-car configurations. The Class 105 was used throughout the UK on rural and branch line services in East Anglia, North East and North West England and parts of Southern Scotland, and also running in and out of London Kings Cross on suburban services before electrification. \r\n\r\nThe BR Blue Pack for Train Simulator recreates these popular diesel locomotives as they worked over the Weardale &amp; Teesdale Network in the 1960s. Also included are PCA, PCAV and YGH ‘Sealion’ freight wagons, plus BR Mk1 passenger coaches in blue/grey livery. \r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:f361364710042bd5ab7ecf3b19e5849eaf1c7e2f","amp;dn":"Railworks+TS2016+DTG+BR+Blue+Pack+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f361364710042bd5ab7ecf3b19e5849eaf1c7e2f","infoHashBuffer":{"type":"Buffer","data":[243,97,54,71,16,4,43,213,171,126,207,59,25,229,132,158,175,28,126,47]},"announce":[],"urlList":[]}}