{"title":"SimPark - Maxis - 1996","uid":10694091,"size":37251755,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f3779c30ef15ece4dd918b2984dd0c4ce7296e17&amp;dn=SimPark+-+Maxis+-+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"astrial","files":-1,"time":1407152996,"description":"Noticed this wasn't uploaded, this is still a fun game for children and adults, even after being released 18 years ago.\n\n--------------------------------------SimPark----------------------------------------\n\nDeveloper(s)\tMaxis Software\nPublisher(s)\tMaxis Software\nPlatform(s)\tWindows, Windows 3.x, Mac OS\nRelease date(s)\t1996\nGenre(s)\tSimulation, Education\nMode(s)\tSingle\nDistribution\tCD/Haxx\n\n\nSimPark is a 1996 video game by Maxis. The object of the game is to cultivate and manage a successful park. Similar to SimTown, it is targeted more towards children than the average player. SimPark attempts to show the importance of ecological balance. It could well be considered a 'lite' version of SimIsle.\nPlayers have to quickly learn how doing (or not doing) various things will affect how their park grows. For instance, if certain flower types aren't planted, the park won't attract bees. If the bees aren't flying around the park, then pollination won't occur, which is an important aspect of keeping the park growing. On top of properly managing the plant and animal population, players are also required to identify the park's plants and animals.\n\nPlayers often receive in-game email, such as their boss telling them to make the park more diverse, or their virtual mother telling about life back at home (e.g.: &quot;I baked you a cake...&quot; etc.) Occasionally, the Boss's pet frog Rizzo will make an appearance on the screen to give the player advice, or nag about the way they're handling things.\n\nThe park can experience disasters, including:\n\nGarbage Dump: The Garbage Dump is just a big pile of rubbish. As soon as it is made, rats start to produce from it and inhabit your park. The only way to get rid of the garbage dump is to put water on it or place lots of garbage-eating animals such as rats and black bears, around the garbage dump.\nFire\nKudzu\nAlien invasion: The Alien Invasion consists of flat, pink-and-blue creatures that litter the park grounds and sometimes float on the water. If the map is clicked to get a zoomed-out map view, the pattern the Aliens form may be in the shape of letters. One example of this is a message which reads: &quot;Surrender, Dorothy&quot;. This is a parody of the movie The Wizard of Oz. The only way to get rid of aliens, aside from using cheat codes, is to bulldoze them with the &quot;Bulldozer&quot; tool.\nThe option of using a microphone feature allows you to click on park-goers and listen to what they have to say. Some of the more memorable quotes include, &quot;My socks don't match,&quot; &quot;I didn't brush my teeth this morning,&quot; &quot;Eddie! Oh Eddie! Where are you?&quot; and &quot;My favourite book is Wind in the Willows.&quot;\n\n\nPlease comment &amp; seed! :]","torrent":{"xt":"urn:btih:f3779c30ef15ece4dd918b2984dd0c4ce7296e17","amp;dn":"SimPark+-+Maxis+-+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3779c30ef15ece4dd918b2984dd0c4ce7296e17","infoHashBuffer":{"type":"Buffer","data":[243,119,156,48,239,21,236,228,221,145,139,41,132,221,12,76,231,41,110,23]},"announce":[],"urlList":[]}}