{"title":"Rudy's Rare Records - S01 to 04 - MP3 - Slimoo","uid":10108110,"size":537656151,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f38a8373623a687eaf24a1571d90afa9144962ee&amp;dn=Rudy%27s+Rare+Records+-+S01+to+04+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":20,"time":1399484977,"description":"Rudy's Rare Records - S01 to 04 - Audio Comedy - BBC Radio 4 \n20 x 30 minutes - 128k - MP3 - Slimoo \n\n\n\nRudy's Rare Records is a tiny, down-at-heel reggae and ska record shop in Birmingham. It is one of a dying breed, a place with real soul and stacked with piles of vinyl where the slogan is &quot;If we don't have it - them don't mek it.&quot; It's owned by the charismatic, irrepressible Rudy Sharpe (Larrington Walker), who is reluctantly helped out by his long-suffering neurotic son Adam (Lenny Henry). \n\nAdam has been forced to move home after a divorce and a nervous breakdown. Having left behind his life in London, he finds himself trapped in the confines of his father's dusty old record shop, sharing the miniscule flat upstairs with his dad and his 17-year-old son Richie, who is a constant source of worry for Adam. \n\nWhile Rudy and Richie get on like a house on fire, bonding over music and chasing the ladies, Adam is the odd one out - a classical music fan trapped in a world of funk and soul. With Rudy's approach to filing - &quot;If it ain't on the shelf, it's on the floor&quot; - clashing with Adam's post-breakdown need for calm and order, the shop is a constant battleground as both men want to run things the way they think it should be done, leaving Richie and work-shy shop assistant Tasha to keep the peace. \n\nA tale of three people forced into finding a way to survive each other's company on a day-to-day basis, Rudy's Rare Records celebrates an old man, one in the midst of a mid-life crisis and a young man, bickering, snickering, breaking up and making up - all day, every day. \n\n\nEpisode details &gt; http://www.comedy.org.uk/guide/radio/rudys_rare_records/episodes/ \n\n\nCast: \nAdam ...... Lenny Henry \nRudy ...... Larrington Walker \nRichie ...... Joe Jacobs \nTasha ...... Natasha Godfrey \nClifton ...... Jeffery Kissoon \nDoreen ...... Claire Benedict \nDJ Karel ...... Andrew Brooke \nTunde ...... Femi Elufowoju \nShop Customer.............Colin Hoult \nTrev The Hoodie/Rapper/Customer........Doc Brown \nDiabolicus.........................Adam De Ville \nAlison.........................Tracy-Ann Oberman \nDexter The Landlord..................Gresby Nash \n\n\nWriters: Danny Robins, Dan Tetsell, Lenny Henry \n\n\nRudy's Rare Records - S01 - E01 - Take Me Home, Country Roads \nRudy's Rare Records - S01 - E02 - Roots Manoeuvres \nRudy's Rare Records - S01 - E03 - Get Up, Stand Up \nRudy's Rare Records - S01 - E04 - The Heart Of Saturday Night \n\nRudy's Rare Records - S02 - E01 - Ill Communication \nRudy's Rare Records - S02 - E02 - Oh Carolina \nRudy's Rare Records - S02 - E03 - Daddy Cool \nRudy's Rare Records - S02 - E04 - Ride With Me \n\nRudy's Rare Records - S03 - E01 - No Richie, No Cry\nRudy's Rare Records - S03 - E02 - It's A Family Affair\nRudy's Rare Records - S03 - E03 - Redemption Song\nRudy's Rare Records - S03 - E04 - Rudy's Rare Record\nRudy's Rare Records - S03 - E05 - Lights Out\nRudy's Rare Records - S03 - E06 - Girls And Boys\n\nRudy's Rare Records - S04 - E01 - Three's A Crowd\nRudy's Rare Records - S04 - E02 - Best Local Business\nRudy's Rare Records - S04 - E03 - Let It Grow\nRudy's Rare Records - S04 - E04 - It's Grim Up North\nRudy's Rare Records - S04 - E05 - Miss Reenie Comes to Stay \nRudy's Rare Records - S04 - E06 - Sound Of Da Police \n\n\n\nAudio Format : MP3 \nDuration Approx : 25mn 54s \nBit rate mode : Constant \nBit rate : 128 Kbps \nChannel(s) : 2 channels \nSampling rate : 44.1 KHz \nResolution : 16 bits\n\n[\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:f38a8373623a687eaf24a1571d90afa9144962ee","amp;dn":"Rudy%27s+Rare+Records+-+S01+to+04+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f38a8373623a687eaf24a1571d90afa9144962ee","infoHashBuffer":{"type":"Buffer","data":[243,138,131,115,98,58,104,126,175,36,161,87,29,144,175,169,20,73,98,238]},"announce":[],"urlList":[]}}