{"title":"Rudolph Shiny New Year (Ultimate Christmas Classics)","uid":9201873,"size":365350405,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f3d971061a8b2694e4a498c4f8de7145ed0ccce5&amp;dn=Rudolph+Shiny+New+Year+%28Ultimate+Christmas+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":3,"time":1384608804,"description":"Rudolph Shiny New Year (Ultimate Christmas Classics)\n\n\nRudolph is legendary for saving Christmas, but did you know he saved the New Year as well? While Santa Claus is recuperating from his December sleigh ride, he receives a letter from an old friend, Father Time. Seems that Baby New Year is missing, and if the little tyke isn't found, Old Year will continue on forever--a catastrophe for Father Time, whose job it is to keep things moving forward. A search party is essential, yet with such thick fog, there's only one reindeer fit for the job. &quot;Rudolph with your nose so bright, you've six days left to set things right,&quot; says Santa. Trouble hits immediately when Rudolph discovers that Aeon the Terrible, a big-beaked monster bird, is also searching for the missing baby. Rudolph gets help from a giant whale and a good-natured caveman, who dish up plenty of song and dance in between narrow escapes in their race against the end-of-the-year calendar. Sound far-fetched? Perhaps, but it contains as much magic as its predecessors, Rudolph the Red-Nosed Reindeer and Santa Claus Is Comin' to Town, all produced and directed by Jules Bass and Arthur Rankin Jr., and written by the esteemed Romeo Muller. The same stop-motion animation we've grown to love is here as well, and narrator Red Skelton has as trusted a voice as Burl Ives and Fred Astaire. While the New Year holiday will never be as celebrated as Christmas, this title is a welcome addition to any Rankin and Bass collection of holiday films. \n\nA enjoyable classic for kids as well as adults alike. \n\nRuntime:  51 mins\nLanguage: English\nYear: 1976\nQuality: 8/10\nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon.com/Rudolphs-Shiny-New-Year-VHS/dp/6302503760&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Rudolphs-Shiny-New-Year-VHS/dp/6302503760&lt;/a&gt;\n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business. And please do pray for the Christian movie makers and their families.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;b7ded9d3ded6d9d4dfc5dec4c3ded6d98587878ef7ced6dfd8d899d4d899ded9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:f3d971061a8b2694e4a498c4f8de7145ed0ccce5","amp;dn":"Rudolph+Shiny+New+Year+%28Ultimate+Christmas+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3d971061a8b2694e4a498c4f8de7145ed0ccce5","infoHashBuffer":{"type":"Buffer","data":[243,217,113,6,26,139,38,148,228,164,152,196,248,222,113,69,237,12,204,229]},"announce":[],"urlList":[]}}