{"title":"The Good Among the Great: 19 Traits of the Most Admirable,","uid":8354508,"size":3255491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f45ab9ad423c03954e65333d072520a801de43f7&amp;dn=The+Good+Among+the+Great%3A+19+Traits+of+the+Most+Admirable%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365450288,"description":"\nDonald Van De Mark - The Good Among the Great: 19 Traits of the Most Admirable, Creative, and Joyous People\nPublished: 2011-04-01 | ISBN: 0984606122 | PDF | 280 pages | 3 MB\n\n\nThe Good Among the Great: 19 Traits of the Most Admirable, Creative and Joyous People offers an in-depth look at the qualities that make a few high achievers also good people. Using lively stories drawn from his more than 25 years interviewing prominent leaders for CNN, CNBC, and other television news programs, author Donald Van de Mark illustrates the 19 personality traits of self-actualized people, as originally identified by psychologist Abraham Maslow.\nVan de Mark shows how the traits are exhibited by wonderful, successful people in all walks of life, spanning the famous (Meryl Streep, Charles Schwab, and Andrew Weil) to the great but not well known (Poosie Orr, mother and housewife; Rachel Walton, pediatric hospice nurse; and Andrew Ferguson, teacher).\nPractical, common-sense guidelines and Takeaways after every chapter show readers how they can identify and nurture the traits in themselves and others, creating the shortest route possible to personal and professional achievement and fulfillment.\n","torrent":{"xt":"urn:btih:f45ab9ad423c03954e65333d072520a801de43f7","amp;dn":"The+Good+Among+the+Great%3A+19+Traits+of+the+Most+Admirable%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f45ab9ad423c03954e65333d072520a801de43f7","infoHashBuffer":{"type":"Buffer","data":[244,90,185,173,66,60,3,149,78,101,51,61,7,37,32,168,1,222,67,247]},"announce":[],"urlList":[]}}