{"title":"Goldman&amp;Steinberg-Permindex(JFK assasination)(1978)","uid":4616141,"size":197583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4855f18bfbd551c7dbdbf6d0371ae8ba5326b76&amp;dn=Goldman%26Steinberg-Permindex%28JFK+assasination%29%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1230845063,"description":"This is David Goldman's and Jeffrey Steinberg's explosive intelligence report Permindex - Britain's Assassination Bureau (1978) which exposes Permindex, a Swiss-based international trading company, as allegedly fronting for British Intelligence president assassination attempts including JFK and DeGaulle. Rare and little-known report which builds on Jim Garrison's abortive accusations against Clay Shaw's membership in Permindex that was allegedly a front for money laundering and bankrolling assassinations. Shaw was the Permindex &quot;case officer&quot; for the seven-member rifle team deployed in Dealey Plaza, gathered from a Mexico-based assassination unit secretly established by FBI Director J. Edgar Hoover and British superspys William Stephenson and Louis Bloomfield in 1943 under the umbrella of the American Council of Christian Churches (ACCC). Members of the ACCC included minister Albert Osborne, who ran the assassination facility, and &quot;priest&quot; David Ferrie, who in 1956 recuited Lee Harvey Oswald. RFK aide Walter Sheridan, in 1967 head of a private investigative agency, exposed as hired thug used by NBC to wreck the Garrison probe as it focused in on Permindex. The rationale: NBC's President was Robert Sarnoff who, as wartime chum of Stephenson, owed one to Permindex. Prepare yourself to read all about an impressive attempt to unify suppressed Kennedy assassination data into post World War II geopolitical manipulations that have been ongoing to present day. 45 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f4855f18bfbd551c7dbdbf6d0371ae8ba5326b76","amp;dn":"Goldman%26Steinberg-Permindex%28JFK+assasination%29%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4855f18bfbd551c7dbdbf6d0371ae8ba5326b76","infoHashBuffer":{"type":"Buffer","data":[244,133,95,24,191,189,85,28,125,189,191,109,3,113,174,139,165,50,107,118]},"announce":[],"urlList":[]}}