{"title":"Beethoven Sonatas Claude Frank","uid":10429385,"size":2424896380,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f6089b3cd7d590bcbbdebd74e526fc6cf6565649&amp;dn=Beethoven+Sonatas+Claude+Frank&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"magneez","files":53,"time":1403787857,"description":"Beethoven Piano Sonatas (complete) Claude Frank\n\nFLAC+CUE+scans\n\n\n\nNotes and Editorial Reviews\nMusic and Arts has repackaged its reissue of Claude Frank's late-1960s Beethoven Sonata cycle (originally released by RCA to tie in with the composer's 1970 bicentennial) in a space-saving box with much-improved graphics and an enticing price to boot. The back of the box lists several press blurbs, including a lengthy one culled from my favorable review (in another publication) of this cycle's earlier CD incarnation. In contrast to presenting the sonatas in opus number progression, the pianist wisely chose to mix and match, programming each of the 10 discs as a mini-recital, so to speak. This results in revealing stylistic contrasts between early and late works, while at the same time pointing up how Beethoven might deploy similar melodic or rhythmic devices in sonatas you wouldn't automatically link up.\n\nFor example, Frank follows the little F major Op. 10 No. 2 with the A-flat Sonata Op. 110. Listen to the former's concluding Presto, with its jaunty repeated-note theme. Then hear how Beethoven treats repeated notes in a more asymmetrical manner, galvanized by syncopation accents, in Op. 110's Allegro Molto. You can make similar contextual leaps throughout this set, but what's most important, of course, is Frank's vital, communicative, and stimulating artistry, on both intellectual and emotional levels. As with his primary teachers Artur Schnabel and Rudolf Serkin, Frank's music-making aims to fuse architecture with passion--and it succeeds brilliantly.\n\nNote the unusual clarity and shape with which Frank imbues bass lines and inner voices, yet he never loses sight of the composer's assertive brio. He relishes the larger-scaled sonatas' heroic contours (the Appassionata, Waldstein, Hammerklavier, or the C major Op. 2 No. 3) while giving plenty of definition and bite to details such as dotted rhythms and subito dynamics. It's also clear that Frank harbors equal affection for smaller &quot;no-name&quot; sonatas, borne out by his inspired, genially inflected performances of the Op. 14 and Op. 49 pairs. In short, this is one of the most rewarding Beethoven cycles on the market, deserving of equal consideration alongside the reference versions.","torrent":{"xt":"urn:btih:f6089b3cd7d590bcbbdebd74e526fc6cf6565649","amp;dn":"Beethoven+Sonatas+Claude+Frank","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6089b3cd7d590bcbbdebd74e526fc6cf6565649","infoHashBuffer":{"type":"Buffer","data":[246,8,155,60,215,213,144,188,187,222,189,116,229,38,252,108,246,86,86,73]},"announce":[],"urlList":[]}}