{"title":"Empire of Blue Water by Stephan Talty .epub","uid":10498762,"size":610176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6517ba3ab5861c2519730fc660ac3ec0af4af19&amp;dn=Empire+of+Blue+Water+by+Stephan+Talty+.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":2,"time":1404667427,"description":"Before he became rum, Cap'n Morgan humbled the Spanish Empire. Part swashbuckling pirate, part aristocratic wannabe Henry Morgan blended his desire for adventure and wealth into an innovative military approach. English greed and rugged individualism could defeat Spanish monarchical bureaucracy. Talty illustrates the lures that drew free spirits from the Old World and into the new. Port Royal, Jamaica, serving as the seventeenth-century's sin city, offered all the vices a young rogue craved, plus the pirate excursions to fund his debaucheries. Talty's well-researched account weaves together myriad political and financial interests in the New World. From the young rogue in search of wealth and a good time to the British monarchy looking for a cheap way to defeat the Spanish (and finding that champion in the young pirate), the pirate's ferocity and depravity became known and feared. Morgan succeeded, where most could not, in straddling dual roles. He stood as the vital force in British military cunning and success, and did so as a feared yet respected pirate.","torrent":{"xt":"urn:btih:f6517ba3ab5861c2519730fc660ac3ec0af4af19","amp;dn":"Empire+of+Blue+Water+by+Stephan+Talty+.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6517ba3ab5861c2519730fc660ac3ec0af4af19","infoHashBuffer":{"type":"Buffer","data":[246,81,123,163,171,88,97,194,81,151,48,252,102,10,195,236,10,244,175,25]},"announce":[],"urlList":[]}}