{"title":"Software Engineering for Self-Adaptive Systems","uid":4963023,"size":5281868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f80f6bc0f42f6c4b7955801477e32d1c588a413b&amp;dn=Software+Engineering+for+Self-Adaptive+Systems&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245407933,"description":"Although the self-adaptability of systems has been studied in a wide range of disciplines, from biology to robotics, only recently has the software engineering community recognized its key role in enabling the development of future software systems that are able to self-adapt to changes that may occur in the system, its requirements, or the environment in which it is deployed.\n\nThe 12 carefully reviewed papers included in this state-of-the-art survey originate from the International Seminar on Software Engineering for Self-Adaptive Systems, held in Dagstuhl Castle, Germany, in January 2008. They examine the current state-of-the-art in the field, describing a wide range of approaches coming from different strands of software engineering, and present future challenges facing this ever-resurgent and challenging field of research. Also included in this book is an invited roadmap paper on the research challenges facing self-adaptive systems within the area of software engineering, based on discussions at the Dagstuhl Seminar and put together by several of its participants. The papers have been divided into topical sections on architecture-based self-adaptation, context-aware and model-driven self-adaptation, and self-healing. These are preceded by three research roadmap papers.\n","torrent":{"xt":"urn:btih:f80f6bc0f42f6c4b7955801477e32d1c588a413b","amp;dn":"Software+Engineering+for+Self-Adaptive+Systems","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f80f6bc0f42f6c4b7955801477e32d1c588a413b","infoHashBuffer":{"type":"Buffer","data":[248,15,107,192,244,47,108,75,121,85,128,20,119,227,45,28,88,138,65,59]},"announce":[],"urlList":[]}}