{"title":"Robotask v3.1","uid":4218061,"size":4869599,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f861c611b618199a642302d0c5e43927e755b276&amp;dn=Robotask+v3.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1212446313,"description":"                    Robotask.v3.1\n\nIt can automate any series of tasks you can do on your computer system\nRoboTask can easily automate any series of tasks on your computer system, whether you are a novice\nor advanced user. You don&amp;#039;t even have to know how to program?use RoboTask to build your own automated solutions\nquickly and easily. Yet RoboTask is powerful.\n\nRoboTask will help users avoid losing important information when they will create a backup task for\nplacing files on a remote server.\n\nThe software can manage and trigger a wide variety of repetitive tasks to save your valuable time.\nWith RoboTask, you don&amp;#039;t need complicated batch files or scripts.\n\nHere are many examples of what RoboTask can do for you:\nÂ· Runs applications and open documents.\nÂ· Manages automatic backups.\nÂ· Alerts you of any changes in your folders.\nÂ· Shuts down Windows and powers off your computer triggered by any event you choose.\nÂ· Processes files and folders (copies, moves, renames, deletes).\nÂ· Works with FTP and Web servers (downloads, uploads, etc).\nÂ· Sends letters and files by e-mail.\nÂ· Starts and stops Windows NT services.\nÂ· Sends network\nmessages as WinPopups.\nÂ· Acts as an alarm clock.\n\nRoboTask can be used for an unlimited number of tasks. When creating a task, you decide what the task\nneeds to do and when. Every task has two parts:\nÂ· Actions\nÂ· Triggering events\n\nActions\n\nFirst, you must decide what actions you want to accomplish. You can select built-in actions in RoboTask\nto accomplish the following:\n\nÂ· Run applications.\nÂ· Open or print documents.\nÂ· Emulate your keystrokes.\nÂ· File and folder processing (copy, move, delete, rename, synchronize folders).\nÂ· Work with FTP servers (download, upload, rename, delete).\nÂ· Work with e-mail (check for e-mail, send e-mail).\nÂ· Work with ZIP files (pack files, extract files).\nÂ· Work with windows (focus, maximize, minimize, restore, close, hide, unhide).\nÂ· Flow control (if-then, file loop, text loop, dataset loop, and so forth).\n\nTriggering events\n\nA triggering event can be one of the following:\nÂ· A specific time\nÂ· When something happens on your computer.\n\nPractically anything that happens on your computer can trigger RoboTask to perform an action. An example\nwould be when RoboTask automatically updates a log and uploads it to a website whenever you receive an email\nwith a subject that is a particular string of words or contains a word such as &quot;Important&quot;.\n\nThe following are examples of triggering events:\nÂ· Scheduler (at a specified time).\nÂ· Hot Keys (when a special key is pressed).\nÂ· Tray Icon (when you double-click it).\nÂ· File Monitor (when a particular file is created, destroyed, changed, renamed).\nÂ· Dial-up Connection Monitor (when a connection is made or broken).\nÂ· Window Watcher (when a window is created, activated, closed, and so forth).\nÂ· System Events (time, spooler, device, display changed, log on, log off, on idle). \n\n-------------------------------\nInstall\nUse crack.\n\nEnjoy!!","torrent":{"xt":"urn:btih:f861c611b618199a642302d0c5e43927e755b276","amp;dn":"Robotask+v3.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f861c611b618199a642302d0c5e43927e755b276","infoHashBuffer":{"type":"Buffer","data":[248,97,198,17,182,24,25,154,100,35,2,208,197,228,57,39,231,85,178,118]},"announce":[],"urlList":[]}}