{"title":"Euro+ Reward Millenium - Angielski","uid":10353097,"size":4439177562,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f89b90068af67768e5460bb44e994774572d560e&amp;dn=Euro%2B+Reward+Millenium+-+Angielski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"impact0r","files":-1,"time":1402700662,"description":"EuroPlus Reward Millennium Angielski 1-4 Extra Pack\n\nElementary\nPre-intermediate\nIntermediate\nUpper-intermediate\n\n-------------------------------------------\nDO POSIADACZY WINDOWS 7 / WINDOWS 8:\n-------------------------------------------\nProgram nie dziaÅ‚a poprawnie w systemie Windows 7 / 8 (wersjach x86 i x64), jedynym sposobem na poprawne dziaÅ‚anie programu w tym systemie jest skorzystanie z trybu XP Mode dostÄ™pnego w wersji Professional i Ultimate w innych wersjach systemu np. Home naleÅ¼y uruchomiÄ‡ program na dowolnej maszynie wirtualnej (VritualPC lub VMware Workstation) z zainstalowanym systemem Windows XP\n\n-------------------------------------------\nDO POSIADACZY WINDOWS XP:\n-------------------------------------------\nDla posiadaczy Windows XP: Jezeli program nie dziala tak jak trzeba to musicie ustawic zgodnosc z windowsem 2000 dla pliku Euro.exe znajdujacego sie w katalogu gdzie zainstalowaliscie kurs.\nNatomiast jezeli ciagle niemozliwe jest uruchomienie jakies lekcji, nalezy zainstalowac patcha (plik DiskPatch.exe)\ninne problemy techniczne: http://www.ydp.com.pl/pomoc.asp?ProduktID=27\n--------------------------------\n\n\nOPIS:\n\nEuroPlus+ Reward Millennium to nowoczesny interaktywny program do nauki jezyka angielskiego dla mlodziezy i doroslych. Bogaty material kursu przygotowany zostal na podstawie jednego z najlepszych podrecznikow do angielskiego - Reward wydawnictwa Macmillan Heinemann English Language Teaching. W polaczeniu z latwa w obsludze, multimedialna aplikacja tworzy on doskonaly system edukacyjny gwarantujacy nauke na najwyzszym poziomie. Dzieki zastosowaniu najnowoczesniejszych technologii informatycznych, jak funkcja rozpoznawania mowy ViaVoice i dostep do jezykowych serwisow internetowych, nauka jezyka jest skuteczna, atrakcyjna i staje sie prawdziwa przyjemnoscia.\nNajwazniejsze cechy programu:\nmaterial kursu, dostepny na 8 plytach CD-ROM, podzielony jest na cztery poziomy zaawansowania, od Elementary do Upper-Intermediate; kazdy poziom odpowiada 150 godzinom intensywnej nauki pierwsze trzy poziomy zawieraja po 8 rozdzialow: w kazdym z nich jest 5 lekcji, lekcja powtorkowa i lekcja wideo; poziom czwarty ma 5 rozdzialow; kazdy z nich zawiera 4 lekcje ( dluzsze niz w pozostalych poziomach), lekcje powtorkowa i lekcje wideo cwiczenia zostaly opracowane przez doswiadczonych lektorow w taki sposob, aby uzytkownik programu doskonalil wszystkie sprawnosci jezykowe - czytanie, rozumienie ze sluchu, pisanie, mowienie, znajomosc zasad gramatyki oraz slownictwa i zwrotow kurs zawiera 16 typow interaktywnych cwiczen, ktore uczacy sie moze rozwiazywac przy pomocy myszy, wpisujac tekst z klawiatury lub uzywajac wlasnego glosu. Sa to np. testy wyboru, wypelnianie luk i tabel, korekta tekstu, laczenie elementow, porzadkowanie wyrazow w zdaniu i zdan w tekscie, a oprocz tego dialogi, scenki z zycia codziennego, filmy, teksty do czytania i wiele innych istnieje mozliwosc sledzenia na biezaco postepow w nauce dzieki: raportom poszczegolnych lekcji testom, ktore maja za zadanie sprawdzic wiedze z kolejnych rozdzialow - pokazuja wyniki procentowe calego testu i poszczegolnych cwiczen oraz oferuja pomoc poprzez wyszukiwanie stron kursu, na ktorych pojawily sie zagadnienia lub zwroty wystepujace w tescie rejestrowi wynikow, ktory jest dostepny z glownego okna aplikacji i na osobnych tablicach podaje procentowe wyniki poszczegolnych rozdzialow, lekcji i kategorii (gramatyka, slownictwo, wymowa, itd.) EuroPlus+ Reward wyposazony jest w pomocnicze programy narzedziowe, konstruowane w przejrzysty sposob i dostepne z kazdego miejsca aplikacji:\nGramatyka to zestaw wszystkich zagadnien gramatycznych poruszanych w rozdzialach kursu; do kazdego tematu dolaczone sa przykladowe zdania z mozliwoscia odsluchania ich wymowy Slowniczek zawiera slownictwo z calego kursu pogrupowane alfabetycznie i wedlug lekcji; program ten stwarza rowniez mozliwosc uporzadkowania slowek wedlug kategorii wybranych przez uzytkownika; do kazdego hasla dolaczone jest nagranie z jego wymowa Wymowa zawiera wizualne przedstawienie nagran dzwiekowych, co ulatwia trening poprawnej wymowy; umozliwia nagranie wlasnych wypowiedzi i porownanie ich z nagraniami lektorow anglojezycznych w oparciu o graficzna reprezentacje roznych parametrow glosu (graficzne przedstawienie fali dzwiekowej, intonacji glosu, czestotliwosci fali dzwiekowej oraz spektrogram) Nowoczesne technologie informatyczne uzyte w programie: funkcja rozpoznawania mowy ViaVoice pozwala cwiczyc wymowe poszczegolnych slow, zwrotow i calych zdan w oparciu o wzor poprawnej wymowy nagrany na plycie przez native speakera filmy wideo - kazdy rozdzial kursu konczy sie lekcja wideo, w ktorej kolejne czesci filmow opowiadajacych o grupie reporterow Reward TV przeplatane sa cwiczeniami i pytaniami zwiazanymi z nagraniami; do kazdego filmu dolaczone sa napisy w angielskiej wersji jezykowej dzwiekowe nagrania dialogow umozliwiaja cwiczenie umiejetnosci rozumienia ze sluchu, a ponadto pozwalaja na wybranie i samodzielne wypowiadanie kwesti dialogu Serwisy internetowe EuroPlus+ Reward udostepnia zarejestrowanym uzytkownikom cztery serwisy internetowe, dzieki ktorym nauka jezyka angielskiego jest skuteczniejsza, wydajna i bardziej atrakcyjna:\nNauczyciel - serwis ten pozwala na wyslanie do lektora tzw. cwiczen nieobiektywnych, czyli wypracowan pisemnych, ktorych program nie sprawdza; po poprawieniu przez nauczyciela zostaja one odeslane z powrotem do ucznia Forum - umozliwia rozmowe i wymiane opinii (poprzez wpisywanie tekstu lub polaczenie glosowe) z innymi uzytkownikami kursu Wiadomosci - serwis informacyjny z najswiezszymi informacjami z calego swiata. Teksty pogrupowane sa w cztery zestawy - kazdy stopniem trudnosci odpowiada kolejnemu poziomowi zaawansowania kursu Gry - serwis, ktory oferuje piec pasjonujacych gier jezykowych (w tym jedna gre 3D), w ktore mozna grac razem z uczacymi sie z calego swiata lub samodzielnie z komputerem. Istnieje mozliwosc dopasowania zakresu materialu jezykowego danej gry do poziomu zaawansowania graczy Interaktywny kurs jezyka angielskiego EuroPlus+ Reward zostal wpisany na liste srodkow dydaktycznych zalecanych przez Ministra Edukacji Narodowej ","torrent":{"xt":"urn:btih:f89b90068af67768e5460bb44e994774572d560e","amp;dn":"Euro%2B+Reward+Millenium+-+Angielski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89b90068af67768e5460bb44e994774572d560e","infoHashBuffer":{"type":"Buffer","data":[248,155,144,6,138,246,119,104,229,70,11,180,78,153,71,116,87,45,86,14]},"announce":[],"urlList":[]}}