{"title":"Under the Dome - Stephen King (mp3)","uid":11379147,"size":1575196074,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f96616967f8410443c673a29f91b351e6837f7e0&amp;dn=Under+the+Dome+-+Stephen+King+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"clwarriors","files":-1,"time":1415148961,"description":"Synopsis\nOn an entirely normal, beautiful fall day in Chester's Mill, Maine, the town is inexplicably and suddenly sealed off from the rest of the world by an invisible force field. Planes crash into it and fall from the sky in flaming wreckage, a gardener's hand is severed as the dome comes down on it, people running errands in the neighboring town are divided from their families, and cars explode on impact. No one can fathom what this barrier is, where it came from, and when -- or if -- it will go away.Dale Barbara, Iraq vet and now a short-order cook, finds himself teamed with a few intrepid citizens -- town newspaper owner Julia Shumway, a physician's assistant at the hospital, a select-woman, and three brave kids. Against them stands Big Jim Rennie, a politician who will stop at nothing -- even murder -- to hold the reins of power, and his son, who is keeping a horrible secret in a dark pantry. But their main adversary is the Dome itself. Because time isn't just short. It's running out.\n\nSTEPHEN KING &quot;RETURNS TO HIS GLORY DAYS OF THE STAND&quot; ( New York Daily News) WITH HIS NEW #1 BESTSELLING EPIC Just down Route 119 in Chester's Mill, Maine, all hell is about to break loose. . . . On an entirely normal, beautiful fall day, a small town is suddenly and inexplicably sealed off from the rest of the world by an invisible force field. Planes crash into it and rain down flaming wreckage. A gardener's hand is severed as the dome descends. Cars explode on impact. Families are separated and panic mounts. No one can fathom what the barrier is, where it came from, and whenor ifit will go away. Now a few intrepid citizens, led by an Iraq vet turned short-order cook, face down a ruthless politician dead set on seizing the reins of power under the dome. But their main adversary is the dome itself. Because time isn't just running short. It's running out.\n\n* Thanks to hexabit for hardware and nattsudd.nu for scripting *","torrent":{"xt":"urn:btih:f96616967f8410443c673a29f91b351e6837f7e0","amp;dn":"Under+the+Dome+-+Stephen+King+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f96616967f8410443c673a29f91b351e6837f7e0","infoHashBuffer":{"type":"Buffer","data":[249,102,22,150,127,132,16,68,60,103,58,41,249,27,53,30,104,55,247,224]},"announce":[],"urlList":[]}}