{"title":"Babyshambles - Sequel to the Prequel (Deluxe) (2013) [FLAC]","uid":9070541,"size":415427201,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9af5c9b54d58eaf40a179d4eb3b2f4c04b72454&amp;dn=Babyshambles+-+Sequel+to+the+Prequel+%28Deluxe%29+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1382196962,"description":"\n  Babyshambles - Sequel to the Prequel (Deluxe) (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Post-Punk\n  Source: Deluxe 2CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Disc 1\n\n  01 Fireman\n  02 Nothing Comes to Nothing\n  03 New Pair\n  04 Farmers Daughter\n  05 Fall from Grace\n  06 Maybelline\n  07 Sequel to the Prequel\n  08 Dr. No\n  09 Penguins\n  10 Picture Me in a Hospital\n  11 Seven Shades\n  12 Minefield\n\n  Disc 2\n\n  01 Cuckoo\n  02 Stranger in My Own Skin\n  03 The Very Last Boy Alive\n  04 After Hours\n  05 Dr. No (Demo)\n\n  Formed in spring 2004, just as the Libertines were beginning to fall apart, Babyshambles became the main vessel for Pete Doherty's poetic, chaotic rock when he was ousted from the Libertines for his increasing drug use and erratic behavior. Babyshambles released their self-titled debut 7&quot; in April 2004, and settled on the lineup of Doherty, guitarist Patrick Walden, bassist Drew McConnell, and drummer Gemma Clarke by that summer. That fall, things went relatively smoothly for the band, with a sold-out U.K. tour and the release of a second single, Killamangiro, on the Libertines' former label, Rough Trade. But by December, the band had to cancel or halt shows because Doherty was unable to perform; one of these sudden cancellations sparked a riot at the London Astoria. Clarke left the band early in 2005 and was replaced with new drummer Adam Ficek.\n\n  Despite the band's ongoing tumult -- which included Doherty's arrest for allegedly assaulting and blackmailing documentarian Max Carlish (these charges were dropped that spring) -- Babyshambles began work on their first album. Teaming up with former Libertines producer Mick Jones, the band worked on the album through the spring and summer of 2005 and released the single Fuck Forever that August as a teaser for the full-length. Down in Albion was released in the U.K. that fall and Babyshambles toured in support of it, although the band canceled almost as many gigs as it actually performed. Doherty's wild behavior continued and his numerous run-ins with the law, which included being held on suspicion of stealing a car and possession of class A drugs in early 2006, and being arrested three times in one day, made Babyshambles' existence as perilous as ever. Down in Albion was released in the U.S. that spring. \n\n  The Blinding EP arrived in fall 2006. Shotter's Nation, Babyshambles' first full-length for EMI/Parlophone, arrived the following fall, boasting more polished production and focused songwriting. After a slightly shambolic European tour -- with cancelled dates due to Doherty's imprisonment -- in support of Shotter's Nation, Doherty went on to release a solo album -- 2009's Grace/Wastelands -- and kickstart an acting career. With the band in limbo, drummer Adam Ficek departed to focus on his own project, Roses Kings Castles, with former Supergrass drummer Danny Goffey stepping in to fill his space. In early 2013, Babyshambles returned to the studio with Stephen Street to record their third album. Recruiting Stereophonics drummer Jamie Morrison to fill the empty drum stool, the band released their third studio album, Sequel to the Prequel, in September 2013.","torrent":{"xt":"urn:btih:f9af5c9b54d58eaf40a179d4eb3b2f4c04b72454","amp;dn":"Babyshambles+-+Sequel+to+the+Prequel+%28Deluxe%29+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9af5c9b54d58eaf40a179d4eb3b2f4c04b72454","infoHashBuffer":{"type":"Buffer","data":[249,175,92,155,84,213,142,175,64,161,121,212,235,59,47,76,4,183,36,84]},"announce":[],"urlList":[]}}