{"title":"Hogarth and His Place in European Art (Art Ebook).pdf","uid":13297871,"size":72975824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb29951e63c4db7efe45c53591e8567487232510&amp;dn=Hogarth+and+His+Place+in+European+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1453669895,"description":"Hogarth and His Place in European Art\r\nBasic Books | 1962 | English | 454 pages | PDF | 70 MB\r\n\r\nIn this work, the author has made the first attempt to convey the historical relevance, both in its native and European context, of perhaps the most outstanding English painter of the 18th Century. Dr. Antal here applies his method of establishing the close relationship between the political and social history and the arts and letters of the period. Thus the book goes far beyond the limits of art historical appreciation. It gives a panoramic picture of the 1st half of the 18th Century in England with all its social, literary and artistic connotations. He shows how England, which during these years became both politically and economically the most advanced country in Europe, could provide in Hogarth, in spite of the slender native tradition, the most progressive artistic personality of his time - whose work revealed the views and tastes of a broad cross-section of society. He traces Hogarth's stylistic origins back to their European sources and analyses his impact on contemporary European and English art as well as the influence he exerted on generations to come. Among the numerous illustrations, many works by Hogarth are juxtaposed with others by foreign artists","torrent":{"xt":"urn:btih:fb29951e63c4db7efe45c53591e8567487232510","amp;dn":"Hogarth+and+His+Place+in+European+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb29951e63c4db7efe45c53591e8567487232510","infoHashBuffer":{"type":"Buffer","data":[251,41,149,30,99,196,219,126,254,69,197,53,145,232,86,116,135,35,37,16]},"announce":[],"urlList":[]}}