{"title":"Kay Redfield Jamison - Touched with Fire (on manic-depression)","uid":13449164,"size":11304167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb4d97cbe464b209a8749152e88c58b17dd58403&amp;dn=Kay+Redfield+Jamison+-+Touched+with+Fire+%28on+manic-depression%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":4,"time":1454780717,"description":"\nKay Redfield Jamison - Touched With Fire: Manic-Depressive Illness and the Artistic Temperament (Free Press, 1993).  383 pp.\r\n\r\nePub / Mobi / PDF (new scan)\r\n\r\n\r\nThe definitive work on the profound and surprising links between manic-depression and creativity, from the bestselling psychologist of bipolar disorders who wrote &quot;An Unquiet Mind&quot;.\r\n\r\nThe anguished, volatile intensity we associate with the artistic temperament has often been thought to have much in common with the experience of manic-depressive illness, both characterized by despairing low and exalting highs.  Dr. Jamison draws on her work as a psychiatrist to artists and writers, in addition to what we know about the lives of Van Gogh, Schubert, Byron and Virginia Woolf among others, to explore the literary, biographical and scientific evidence for the connection between manic-depressive illness and artistic activity.  She also examines the cultural implications of this perceived connection between artistic temperament and mood disorders.  She advocates a restrained, humanistic approach to the treatment of manic-depressive illness which seeks to preserve the artistic energy that is often its concomitant.\r\n\r\nOne of the foremost psychologists in America, &quot;Kay Jamison is plainly among the few who have a profound understanding of the relationship that exists between art and madness&quot; (William Styron).\r\n\r\n\r\nCover image: http://d28hgpri8am2if.cloudfront.net/book_images/cvr9780684831831_9780684831831_hr.jpg\r\n\r\n\r\nSEE ALSO:\r\nKay Redfield Jamison - Night Falls Fast: Understanding Suicide (1999) \nhttps://thepiratebay.se/torrent/8320451/\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\n&gt;&gt; CONTACT ME\r\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n               \nhttps://pirates-forum.org/User-workerbee  \r\n\r\n&gt;&gt; PLEASE HELP TO SEED!\r\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:fb4d97cbe464b209a8749152e88c58b17dd58403","amp;dn":"Kay+Redfield+Jamison+-+Touched+with+Fire+%28on+manic-depression%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb4d97cbe464b209a8749152e88c58b17dd58403","infoHashBuffer":{"type":"Buffer","data":[251,77,151,203,228,100,178,9,168,116,145,82,232,140,88,177,125,213,132,3]},"announce":[],"urlList":[]}}