{"title":"Democracy Now - 03 aug 2010","uid":5737425,"size":450940343,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fbfe9aced7089d4814ac7a86f65a8b296b6af3c5&amp;dn=Democracy+Now+-+03+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roys","files":1,"time":1280869511,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 3, 2010\n\n- 1,400 Killed, 3 Million People Affected by Floods in Pakistan\n- Scientists: Nearly 5 Million Barrels of Oil Spilled in Gulf\n- BP Faces Insider Trading Probe\n- Israeli Shelling Kills Three Lebanese Soldiers, One Journalist\n- Six Afghan Children Die in Suicide Bombing\n- UN Panel to Probe Israeli Attack on Flotilla\n- Republicans Call for Repealing 14th Amendment\n- Virginia AG OKs Immigration Checks on Anyone Stopped by Police\n- 22 Die in Kashmir as Protests Intensify\n- Ahmadinejad Calls for Debate with Obama\n- Jury Convicts Two in JFK Airport Plot\n\n\nSpecial reports\n\n- End of Iraq Combat Operations or Beginning of Downsized, Rebranded Occupation Relying Heavily on Private Military Contractors?\n\nPresident Obama said Monday in a speech before the Disabled American Veterans national convention in Atlanta that the US military is on target to withdraw all its combat troops from Iraq by the end of August. We speak with independent journalist Jeremy Scahill, who says this instead marks the beginning of a downsized and rebranded occupation that will rely heavily on private military forces.\n\n\n- Julian Assange Responds to Increasing US Government Attacks on WikiLeaks\n\nIt's been ten days since the whistleblower website WikiLeaks published the massive archive of classified military records about the war in Afghanistan, but the fallout in Washington and beyond is far from over. Justice Department lawyers are reportedly exploring whether WikiLeaks and its founder Julian Assange could be charged with violating the Espionage Act of 1917 for publishing the classified Afghan war documents. Meanwhile, investigators in the Army's criminal division have reportedly questioned two students in Boston about their ties to WikiLeaks and Private First Class Bradley Manning, a leading suspect in the leak. We speak with WikiLeaks founder, Julian Assange.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:fbfe9aced7089d4814ac7a86f65a8b296b6af3c5","amp;dn":"Democracy+Now+-+03+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbfe9aced7089d4814ac7a86f65a8b296b6af3c5","infoHashBuffer":{"type":"Buffer","data":[251,254,154,206,215,8,157,72,20,172,122,134,246,90,139,41,107,106,243,197]},"announce":[],"urlList":[]}}