{"title":"Wallerstein - European Universalism (2006)","uid":3784651,"size":306050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc773f7f80c6ab428004e69357e35073aeb243af&amp;dn=Wallerstein+-+European+Universalism+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SocialTranslation","files":1,"time":1188097484,"description":"Publisher&amp;#039;s description:\n\nEver since the Enlightenment, Western intervention around the world has been justified by appeals to notions of civilization, development, and progress. The assumption has been that such ideas are universal, encrusted in natural law. But, as Immanuel Wallerstein argues in this short and elegant philippic, these concepts are, in fact, not global. Rather, their genesis is firmly rooted in European thought and their primary function has been to provide justification for powerful states to impose their will against the weak under the smoke screen of what is supposed to be both beneficial to humankind and historically inevitable.\n\nWith great acuity Wallerstein draws together discussions of the idea of orientalism, the right to intervene, and the triumph of science over the humanities to explain how strategies designed to promote particular Western interests have acquired an all-inclusive patina.\n\nWallerstein concludes by advocating a true universalism that will allow critical appraisal of all justifications for intervention by the powerful against the weak. At a time when such intervention?in the name of democracy and human rights?has returned to the center stage of world politics, his treatise is both relevant and compelling.","torrent":{"xt":"urn:btih:fc773f7f80c6ab428004e69357e35073aeb243af","amp;dn":"Wallerstein+-+European+Universalism+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc773f7f80c6ab428004e69357e35073aeb243af","infoHashBuffer":{"type":"Buffer","data":[252,119,63,127,128,198,171,66,128,4,230,147,87,227,80,115,174,178,67,175]},"announce":[],"urlList":[]}}