{"title":"CCleaner Pro 322","uid":7713481,"size":4286976,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fc8851284783c2873b2bd60ec17aeda49ba944e2&amp;dn=CCleaner+Pro+322&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cjen","files":1,"time":1349870138,"description":"CCleaner supports the cleaning of temporary or potentially unwanted files left by certain programs, including Internet Explorer, Firefox, Google Chrome, Opera, Safari, Windows Media Player, eMule, Google Toolbar, Netscape, Microsoft Office, Nero, Adobe Acrobat, McAfee, Adobe Flash Player, Sun Java, WinRAR, WinAce, WinZip, GIMP and other applications[6] along with browsing history, cookies, Recycle bin, memory dumps, file fragments, log files, system caches, application data, autocomplete form history, and various other data.[7] The program also includes a registry cleaner to locate and correct problems in the Windows registry, such as missing references to shared DLLs, unused registration entries for file extensions, and missing references application paths.[6] As of v2.27, CCleaner can wipe the MFT free space of a drive, or the entire drive itself.\nCCleaner can be employed to uninstall programs. In addition, CCleaner allows the alteration of start-up programs, similar to the Microsoft Windows MSConfig utility. Users can disable start-up programs.[8] As of version 2.19.901, CCleaner also allows users to delete system restore points.\n\nThis is the pro.\nJust install already precracked.\nBTW BEFORE YOU ADD COMMENTS About it\nCracks false positive to a antivirus...","torrent":{"xt":"urn:btih:fc8851284783c2873b2bd60ec17aeda49ba944e2","amp;dn":"CCleaner+Pro+322","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8851284783c2873b2bd60ec17aeda49ba944e2","infoHashBuffer":{"type":"Buffer","data":[252,136,81,40,71,131,194,135,59,43,214,14,193,122,237,164,155,169,68,226]},"announce":[],"urlList":[]}}