{"title":"DareDevil - Seasons 2 - Episodes 10 thru 13","uid":15133901,"size":8077436881,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fcb6147903272b1fa30f91f0951f5c6cc7f0309c&amp;dn=DareDevil+-+Seasons+2+-+Episodes+10+thru+13&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":17,"time":1467168208,"description":"DareDevil - Season 2 - Episodes 10 thru 13 (Size: 7.17 GB)\r\n \t\tmarvels.daredevil.s02e10.720p.webrip.x264-skgtv.mkv\t1.58 GB\r\n \t\tmarvels.daredevil.s02e11.720p.webrip.x264-skgtv.mkv\t1.53 GB\r\n \t\tmarvels.daredevil.s02e12.720p.webrip.x264-skgtv.mkv\t1.25 GB\r\n \t\tmarvels.daredevil.s02e13.720p.webrip.x264-skgtv.mkv\t1.44 GB\r\n\r\n\r\n\r\nDaredevil is a fictional superhero appearing in American comic books published by Marvel Comics. Daredevil was created by writer-editor Stan Lee and artist Bill Everett, with an unspecified amount of input from Jack Kirby.[1] The character first appeared in Daredevil #1 (April 1964).\r\n\r\n\r\nDaredevil's origin story relates that while living in the Hell's Kitchen neighborhood of New York City, Matt Murdock is blinded by a radioactive substance that falls from an oncoming vehicle while pushing a man to safety from the oncoming truck. While he no longer can see, the radioactive exposure heightens his remaining senses beyond normal human ability and gives him a &quot;radar sense&quot;. His father, a boxer named Jack Murdock, supports him as he grows up, though Jack is later killed by gangsters after refusing to throw a fight. After donning a yellow and dark red costume (later all dark red), Matt seeks out revenge against his father's killers as the superhero Daredevil, fighting against his many enemies, including Bullseye and Kingpin.[2] He also becomes a lawyer. Daredevil's nickname is &quot;The Man Without Fear&quot;.[3]\r\n\r\nWhile Daredevil had been home to the work of comic-book artists such as Everett, Kirby, Wally Wood, John Romita Sr., and Gene Colan, among others, Frank Miller's influential tenure on the title in the early 1980s cemented the character as a popular and influential part of the Marvel Universe. Daredevil has since appeared in various forms of media including several animated series, video games and merchandise, and the 2003 feature-length film Daredevil, where he was portrayed by Ben Affleck. Charlie Cox plays Daredevil in Marvel's Daredevil, a live-action television series on Netflix that premiered on April 10, 2015.[4]","torrent":{"xt":"urn:btih:fcb6147903272b1fa30f91f0951f5c6cc7f0309c","amp;dn":"DareDevil+-+Seasons+2+-+Episodes+10+thru+13","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcb6147903272b1fa30f91f0951f5c6cc7f0309c","infoHashBuffer":{"type":"Buffer","data":[252,182,20,121,3,39,43,31,163,15,145,240,149,31,92,108,199,240,48,156]},"announce":[],"urlList":[]}}