{"title":"Kenny G And Rahul Sharma - Namaste 2012 [FLAC] vtwin88cube","uid":7734989,"size":363829590,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd0d862d7b54a151e0215dcd14504fa11c954ca5&amp;dn=Kenny+G+And+Rahul+Sharma+-+Namaste+2012+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1350453366,"description":"\n\n\nKenny G &amp; Rahul Sharma\nNamaste (2012)\n\n\nKenny G has long been the musician many jazz listeners love to hate. A phenomenally successful instrumentalist whose recordings make the pop charts, Kenny G's sound has been a staple on adult contemporary and smooth jazz radio stations since the mid-'80s, making him a household name. Kenny G is a fine player with an attractive sound (influenced a bit by Grover Washington, Jr.) who often caresses melodies, putting a lot of emotion into his solos. Because he does not improvise much (sticking mostly to predictable melody statements), his music largely falls outside of jazz. However, because he is listed at the top of &quot;contemporary jazz&quot; charts and is identified with jazz in the minds of the mass public, he is classified as jazz. \n\n\nThe mountainous region of Kashmir was where Rahul Sharma's lineage with music evolved. His grandfather, Uma Dutt Sharma, was a master of the santoor, an instrument that is similar to the hammer-dulcimer. The harsh tone of the instrument made it fall out of line with folk music as well as classical music, but Uma Dutt Sharma persisted. His father, Shivkumar Sharma mastered the instrument by experimenting with various striking positions and tones. As Shivkumar's status rose in the musical circles of Kashmir, word of his performances grew over borders and continents. Shivkumar's son, Rahul Sharma continued the tradition of the instrument. Rahul Sharma was always in love with music, often singing at an early age and playing the harmonium. Learning the santoor at age 13, the child wasn't completely sure of pursuing music until he turned 17. After studying economics at Bombay's Mithibai College, Rahul Sharma began performing with his father. In September 2000, Real World Records released Music Of The Himalayas, a live performance in Turin featuring Sharma, percussionist Pandi Bhawani Shankar and tabla player Ustad Shafat Ahmed Khan. The musician has performed in North America and throughout Europe. He has also performed at various folk and world music festivals, including WOMAD. \n\n\n\n\nFormat:\t\t\tFLAC Lossless\nLabel:\t\t\tConcord\nCatalog:\t\t         88072 33816\nAudiochecker:\t\t96.00% CDDA \nContains:\t\tAlbum Art &amp; ID Tags\n\n\nAudio-Info:\n\n\n01.Namaste\n02.Brhama-Vishnu-Shiva\n03.Dance Of The Elephant God\n04.Lotus Lovers\n05.Transcendental Consciousness\n06.Valley Of Flowers\n07.Silsila (Feat. Amitabh Bachchan)\n08.Om Shanti\n09.Transcendental Consciousness (Walter A. Remix)\n10.Namaste (Soul Seekerz Club Mix)\n\n\n\n\n\n\n\n\n\n                            ****Thanks For Seeding!****\n                                     \n                                   ***Enjoy!***\n\n\n","torrent":{"xt":"urn:btih:fd0d862d7b54a151e0215dcd14504fa11c954ca5","amp;dn":"Kenny+G+And+Rahul+Sharma+-+Namaste+2012+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd0d862d7b54a151e0215dcd14504fa11c954ca5","infoHashBuffer":{"type":"Buffer","data":[253,13,134,45,123,84,161,81,224,33,93,205,20,80,79,161,28,149,76,165]},"announce":[],"urlList":[]}}