{"title":"70's Soul Sessions","uid":4084172,"size":118520089,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe036b5578b39755c76cefbd6d450ed9208150f2&amp;dn=70%5C%27s+Soul+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mcmick","files":35,"time":1205708350,"description":"Come the &amp;#039;70s, it was the city of brotherly love that provided the blueprint, in particular through the Philly based labels, Philly Groove and Philadelphia International, with their smooth, string laden disco-inflected sounds and velveteen soft vocal delivery leading the way. The 70s also saw the invention of the sensual soul loverman in the form of Isaac Hayes, Barry White and Al Green and the political agitator through Marvin Gaye and Curtis Mayfield. What follows are some of the greatest, most beautiful soul tracks culled from the decade.\nSee Reviews\n\nTrack List\n\tCD1\n1 \tBobby Womack - Across 110th Street\n2 \tGil Scott-Heron - The Bottle\n3 \tBilly Paul - Me &amp; Mrs. Jones\n4 \tCurtis Mayfield - So In Love\n5 \tBetty Wright - Clean Up Woman\n6 \tThe Isley Brothers - Love The One You&amp;#039;re With\n7 \tIke &amp; Tina Turner - Come Together\n8 \tFreda Payne - Band Of Gold\n9 \tChairmen Of The Board - Give Me Just A Little More Time\n10 \tThe Skullsnaps - I?m Your Pimp\n11 \tAnn Sexton - You&amp;#039;ve Been Gone Too Long\n12 \tThe Staple Singers - Let&amp;#039;s Do It Again\n13 \tIsaac Hayes - Never Can Say Goodbye\n14 \tMillie Jackson - Hurts So Good\n15 \tHoney Cone - One Monkey Don&amp;#039;t Stop No Show\n\tCD2\n1 \tBarry White - You&amp;#039;re The First, The Last, My Everything\n2 \tAl Wilson - Show &amp; Tell\n3 \tAl Green - Sha La La (Make Me Happy)\n4 \tThe Meters - Hand Clappin&amp;#039; Song\n5 \tAlvin Cash - Ali Shuffle\n6 \tJones Girls - Will You Be There\n7 \tLeroy Hutson - All Because Of You\n8 \tLove Unlimited - Under The Influence Of Love\n9 \tThe Three Degrees - When Will I See You Again\n10 \tAllen Toussaint - From A Whisper To A Scream\n11 \tThe Impressions - First Impressions\n12 \tThe Notations - Super People\n13 \tAaron Neville ? Hercules\n14 \tO&amp;#039;Jays ? Backstabbers\n15 \tThe Chi-Lites - Have You Seen Her\n\t \n \n  \t \nIn the &amp;#039;60s it was Detroit&amp;#039;s Motown label and Memphis&amp;#039; Stax and Atlantic stables that defined soul music. The former&amp;#039;s early to mid 60s sugary sweet pop soul and later Norman Whitfield produced lysergic funk experiments and Stax&amp;#039;s rough, raucous gospel infused productions set the world alight. Come the &amp;#039;70s, however, and it was the city of brotherly love that provided the blueprint, in particular through the Philly based labels, Philly Groove and Philadelphia International, with their smooth, string laden disco-inflected sounds and velveteen soft vocal delivery leading the way. The 70s also saw the invention of the sensual soul loverman in the form of Isaac Hayes, Barry White and Al Green and the political agitator through Marvin Gaye and Curtis Mayfield. What follows are some of the greatest, most beautiful soul tracks culled from the decade. We hope you enjoy them.\n\nCD1\n\n01. Bobby Womack - Across 110th Street\n\nHe took his calling from Sam Cooke, with the Valentinos recorded the original of It&amp;#039;s All Over Now, a later hit for the Stones, penned numerous hits for Wilson Pickett and contributed to Sly and the Family Stone&amp;#039;s *There&amp;#039;s A Riot Goin&amp;#039; On before soundtracking the blaxploitation flick, Across 110th Street. The title theme included here is a brutal social commentary backed by a raw, gutsy funk groove.\n\n02. Gil Scott-Heron ? The Bottle\n\nHeron?s music conveyed a message of black frustration, inequality and consciousness. Here was a troubadour whose fiery diatribes mixed biting realism and sharp lyricism with a percussive poetic style providing the blueprint for rap music. The Bottle was a case in point; his gruelling account of alcoholism, also a rare groove hit.\n\n03. Billy Paul ? Me &amp; Mrs. Jones\n\nTalent spotted by neighbour Bill Cosby, Paul Williams learnt his trade on the local Philly circuit after changing his name - the lead singer of the Temptations was also called Paul Williams. This rather risque record dealing with the subject of adultery was banned by some US radio stations on its release in 72 but that didn&amp;#039;t stop it selling over 4 and a half million copies and landing Paul a Grammy Award for the Best Male Rhythm and Blues Performance.\n\n04. Curtis Mayfield ? So In Love\n\nA role model for black power Curtis preached civil rights through politically fired spiritual soul both as the lead singer with the Impressions and as a solo artist. He also owned his own publishing and record labels and excelled at fantasy vignettes (the Impressions&amp;#039; Roger Glover arranged Gypsy Woman), delightful gospel anthems (the Impressions&amp;#039; Keep On Pushing) and tender love songs as this sublime slab of self penned soul from 1975 shows, his inimitable vocal and incredible songwriting skill pushed to the fore.\n\n05. Betty Wright ? Clean up Woman\n\nShe helped invent the Miami Sound with her compelling Henry Stone collaborations, the southern soul/disco funk hybrid of Clean Up Woman landing her a huge hit in 1972.\n\n06. The Isley Brothers ? Love The One You?re With\n\nOn 1971&amp;#039;s *Givin&amp;#039; It Back, the Brothers Isley take time out from writing their own material with an album made up mostly of covers. Here they take the Stephen Stills&amp;#039; tune and turn it into a rocking soulful triumph.\n\n07. Ike &amp; Tina Turner ? Come Together\n\nIn their hands the Beatles&amp;#039; Come Together becomes a raucous yet sultry rock&amp;#039;n&amp;#039;soul howl, Tina&amp;#039;s vocal strident, Ike&amp;#039;s guitar playing intricate.\n\n08. Freda Payne ? Band Of Gold\n\nShe had sung jazz with the big bands of Count Basie, Quincy Jones and Duke Ellington and recorded for Impulse and MGM. Then in 1969 this honey voiced singer signed to Invictus and went head to head with Diana Ross. The Ronald Dunbar/Edith Wayne penned wedding night melodrama deservedly topped the charts.\n\n09. Chairmen Of The Board ? Give Me Just A little More Time\n\nThis wondrously infectious soul gem featuring General Johnson&amp;#039;s inimitable vocal artistry gave Chairmen Of The Board their first UK Top 5 hit, peaking at number 3 in August 1970.\n\n10. The Skull Snaps ? I?m Your Pimp\n\nFormed out of the ashes of the Diplomats, guitarist Ervan Waters, bassist Sam Culley and drummer George Bragg recorded just one LP under the legend, the Skullsnaps in 1973, this cut culled from it was a favourite at the Blackpool Mecca from 75 onwards.\n\n11. Ann Sexton ? You?ve Been Gone Too Long\n\nIt was as a gospel singer in Greenville, South Carolina that Ann Sexton, Chuck Jackson&amp;#039;s cousin perfected her delivery; a vocal style that balanced the sultry, coquettish inflections of Bettye Swann with the forthright tones of Betty Wright. Spotted by David Lee while playing with her husband and saxophonist Melvin Burton in 1971, Sexton released her debut 7-inch, You&amp;#039;re Letting Me Down, on Lee&amp;#039;s Impel label. This, its funky B side was picked up on the northern scene.\n\n12. The Staple Singers ? Let?s Do It Again\n\nThey started out singing gospel blues but on signing to Stax the family Staples recorded a number of more socially aware message songs. Backed by the funkier rhythms of the Stax engine room they landed hits with Respect Yourself and If You&amp;#039;re Ready Come Go With Me among others. Here they team with producer Curtis Mayfield for a secular joy on Curtom, culled from their LP of the same name.\n\n13. Isaac Hayes ? Never Can Say Goodbye\n\nHayes revolutionized soul music with his symphonically orchestrated concept LP, 1969&amp;#039;s *Hot Buttered Soul. With only four tracks it included an 18 minute extravaganza By The Time I Get To Phoenix and Bacharach and David&amp;#039;s Walk On By. He repeated the formula two years later on this Clifton Davis penned cut, his bedroom baritone taking it straight into the US R&amp;B Top 5.\n\n14. Milie Jackson ? Hurts So Good\n\nShe&amp;#039;d later make a name for herself with her *Caught Up trilogy chronicling the tale of a wife, husband and mistress and her rather saucy lewd recordings, but this cover of Phillip Mitchell&amp;#039;s sexy tale, culled from her second LP of the same name, reveals her at her most smouldering. It also appeared on the soundtrack to the blaxploitation movie, Cleopatra Jones.\n\n15. Honey Cone ? One Monkey Don?t Stop No Show\n\nThis bolshie three piece girl group comprising Darlene Love&amp;#039;s sister Edna Wright, ex-Ikette Shellie Clark and Carolyn Willis, late of the Girlfriends, released four albums and 12 singles between 1969 and &amp;#039;72. This is one of their most feisty, strident kick ass femme soul outings.\n\nCD2\n\n01. Barry White ? You?re The First, The Last, My Everything\n\nSeductive soul at its most lethal. Barry White&amp;#039;s joyous paean melds his smouldering baritone and guttural moans with a breathless strut of an intro.\n\n02. Al Wilson ? Show &amp; Tell\n\nHe started his singing career aged 12 but took time out to join the US navy. In 68 he signed to Johnny Rivers Soul City imprint where he landed a hit with the saucy parable, The Snake, a cut that is still a popular spin on the northern soul scene today. It would be a further five years, however, before Wilson tasted success again, this time with Show &amp; Tell, a cover of the producer Jerry Fuller penned Johnny Mathis song.\n\n03. Al Green - Sha La La (Make Me Happy)\n\nHis melismatic, honeyed falsetto, astute skill with a pen and natural charisma all combine effortlessly on this cogent, jubilatory gospel fuelled number from 1974.\n\n04. The Meters - Hand Clappin&amp;#039; Song\n\nThey started out backing Betty Harris and Lee Dorsey, then the Crescent City quartet debuted their unique brand of Allen Toussaint produced syncopated New Orleans funk with understated keyboards and chaotic snare drum rasps. 1970&amp;#039;s *Chicken Strut album was a standout spawning this delightful slab that went on to inspire A Tribe Called Quest&amp;#039;s Clap Your Hands and Eric B &amp; Rakim&amp;#039;s Put Your Hands Together.\n\n05. Alvin Cash - Ali Shuffle\n\nThe ex-Nightlighters and the Crawlers singer scored R&amp;B solo hits with The Philly Freeze, The Barracuda and Mr Penguin but it was the infectious, mesmeric Ali Shuffle, just one of his many tributes to Mohammad Ali - he recorded a whole album&amp;#039;s worth entitled *Alvin Cash Does The Greatest Hits Of Mohammad Ali - that got them out on the floor.\n\n06. The Jones Girls Will You Be There\n\nDaughters of the Detroit based gospel singer Mary Francis Jones, Shirley, Brenda and Valerie signed to Curtom offshoot Gemingo in 73 and released If You Don&amp;#039;t Love Me No More and its wonderful follow-up Will You Be There which so impressed its arranger Gil Askey, that he got the trio a spot on Diana Ross&amp;#039; tour .\n\n07. Leroy Hutson - All Because Of You\n\nLeroy Hutson traded in 70s sensual soul grooves. After co scribing The Ghetto with Donny Hathaway and a brief spell as Curtis Mayfield&amp;#039;s replacement in the Impressions, Hutson went solo in 1973 and delivered angelic slices of Chicago soul such as this from his 1975 eponymous third LP.\n\n08. Love Unlimited - Under The Influence Of Love\n\nThis Barry White penned infectious sweet ode to love was first recorded by White&amp;#039;s Bronco label prot?g? Felice Taylor but it is sisters Glodean and Linda James and Diane Taylor&amp;#039;s take that is the most sublime. Lavish Gene Page arrangements meld beautifully with sensual harmonies.\n\n09. The Three Degrees - When Will I See You Again\n\nThey began life in 1963 but it would be the following decade that they conquered with this, their 1974 UK number 1 disco ballad.\n\n10. Allen Toussaint - From A Whisper To A Scream\n\nSuch was the emotive power, anguish and passion of this song that New Orleans&amp;#039; songwriter, arranger, producer and pianist Allen Toussaint&amp;#039;s debut LP, *Toussaint for the Sceptor label in &amp;#039;71 was renamed after the track on the album&amp;#039;s re-release.\n\n11. The Impressions - First Impressions\n\nFirst Curtis Mayfield left them to pursue a solo career then his replacement Leroy Hutson upped sticks and did the same. Undeterred Impressions&amp;#039; staples Sam Gooden and Fred Cash teamed with singer Ralph Johnson and released this wondrously catchy singalong slice of wisdom and scored themselves a hit to boot.\n\n12. The Notations - Super People\n\nLike their contemporaries Curtis Mayfield, Gene Chandler and Major Lance, the Clifford Curry led Notations were purveyors of delicious Windy City soul. After scoring a hit in the 60s with I&amp;#039;m Still Here on Twinight, they signed to Curtom subsidiary Gemingo for a string of R&amp;B smashes including this.\n\n13. Aaron Neville ? Hercules\n\nThe New Orleans veteran has over four decades turnedhis hand to gospel, R&amp;B, funk, country and jazz yet his tremulous tenor is best suited to sweet soul music as evidenced on this spine tingling, poignant ballad.\n\n14. O Jays - Backstabbers\n\nThe O Jays&amp;#039; debut for Gamble and Huff&amp;#039;s Philadephia International label in 72 set the template both for the label and the band. Lyrically, a claustrophobic, paranoid critique of society, while musically it was equal parts funk and soul with Eddie Levert&amp;#039;s lead backed by lavish brass and string arrangements.\n\n15. The Chi-Lites - Have You Seen Her\n\nThey hailed from Chicago but this haunting transcendental ballad paid a debt to the soulful, string heavy mid tempo cuts emanating from 70s Philadelphia thanks to Eugene Record&amp;#039;s quavering falsetto, highly polished production and his group&amp;#039;s lush background harmonies.","torrent":{"xt":"urn:btih:fe036b5578b39755c76cefbd6d450ed9208150f2","amp;dn":"70%5C%27s+Soul+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe036b5578b39755c76cefbd6d450ed9208150f2","infoHashBuffer":{"type":"Buffer","data":[254,3,107,85,120,179,151,85,199,108,239,189,109,69,14,217,32,129,80,242]},"announce":[],"urlList":[]}}