{"title":"Tribes.Predators.and.Me--BBC-2016-w.subs-360p","uid":14170061,"size":1059393228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe5c4459daa4b12ce6bbc96a8747bf707068c3a1&amp;dn=Tribes.Predators.and.Me--BBC-2016-w.subs-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":6,"time":1459744353,"description":"Tribes, Predators &amp; Me\r\n\r\nGordon Buchanan travels to three remote tribes to learn the wildlife secrets of people who live alongside the iconic and dangerous animals we fear the most.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p03l23gr\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\n\r\nAnaconda People of the Amazon - Episode 1 of 3\r\nGordon Buchanan joins a Waorani tribal family in Ecuador's Amazon jungle as they search for giant anacondas.\r\nThe tribe know this remote rainforest and its spectacular wildlife better than anyone else. They teach Gordon their secrets for surviving here, using blow pipes and sharpened sticks to hunt monkeys and wild pigs.\r\nBut his greatest challenge is to help them catch and release a massive anaconda, an animal of spiritual importance that could hold the key to their future.\r\n\r\nLion People of the Kalahari - Episode 2 of 3\r\nGordon Buchanan joins a group of Bushmen in Botswana's Kalahari Desert to learn how to survive on foot among wild lions.\r\nThe Ju/'hoansi Bushmen teach Gordon their ancient survival secrets, how to make fire, find honey and gather water from desert plants. He sees them hunt with poisoned arrows and track predatory lions. These big cats are a terrifying presence, but can Gordon be brave enough to help his tribal family approach them on foot to retrieve meat to feed the tribe?\r\n\r\nCrocodile People of New Guinea - Episode 3 of 3\r\nCrocodiles are an animal we fear, and with good reason - they kill hundreds of people each year. Gordon Buchanan journeys up Papua New Guinea's remote Sepik River to meet the remarkable tribes who have learnt to live with these terrifying reptiles.\r\nCrocodile hunters invite Gordon to join them catching adult crocodiles with their bare hands, and Gordon meets a tribe who believe a giant crocodile protects them from their human enemies. Does Gordon trust the tribe enough to swim in the giant crocodile's lake?","torrent":{"xt":"urn:btih:fe5c4459daa4b12ce6bbc96a8747bf707068c3a1","amp;dn":"Tribes.Predators.and.Me--BBC-2016-w.subs-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5c4459daa4b12ce6bbc96a8747bf707068c3a1","infoHashBuffer":{"type":"Buffer","data":[254,92,68,89,218,164,177,44,230,187,201,106,135,71,191,112,112,104,195,161]},"announce":[],"urlList":[]}}