{"title":"Jessica Lee Rayman - Rethoric, Law, and the Regulation of IP on ","uid":4441547,"size":8728028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe7ea980788bbf8ec8cb7082b4b032d6d4f6f206&amp;dn=Jessica+Lee+Rayman+-+Rethoric%2C+Law%2C+and+the+Regulation+of+IP+on+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nijet99","files":1,"time":1223837801,"description":"Rhetoric, Law, and the Regulation of Intellectual Property on Peer-to-Peer Networks:\nThe Case of MGM Studios v. Grokster\n\n\nA DISSERTATION SUBMITTED TO THE FACULTY OF THE GRADUATE SCHOOL OF THE UNIVERSITY OF MINESOTA\n\nby\n\nJessica Lee Reyman\n\n\nIN PARTIAL FULFILLMENT OF THE REQUIREMENETS FOR THE DEGREE OF DOCTOR OF PHILOSOPHY\n\n\nLaura J. Gurak, Adviser\n\nJune 2006\n\n\n\nAbstract\n\nA unanimous ruling in a copyright case decided by the Supreme Court in 2005, MGM Studios v. Grokster, determined that file sharing services such as Grokster and StreamCast Networks can be held accountable for what users do with the material they download. As a result, the case defined the relationship between technology development and copyright regulation as one based on property rights, exclusivity, and economic value. This dissertation analyzes the legal and public discourse surrounding the case and the cultural context that made the ruling possible. I investigate the conditions that gave rise to the ruling by examining the discourse of creators, technologists, content owners, and their advocates. Through an analysis of the competing narratives about copyright regulation surrounding the case, I show how the stories told shape our cultural understanding of what is and is not acceptable use of copyrighted works on digital networks. This work seeks to complicate the dichotomy between concepts of &quot;property&quot; and &quot;the commons&quot; that operate in contemporary discourses of copyright. I argue that the ruling isn&amp;#039;t simply a legal response to the threat of peer-to-peer technology to the recording and movie industries, but, rather, can be seen as a site of negotiation among competing models of cultural production. This dissertation illustrates that the rhetoric of &quot;property stewardship&quot; from content owners aligns successfully with the law because each is premised on the notion of exclusive, transmittable information products, rather than the social and relational dimensions of communicative participation. As an interrogation into the tension between technological progress and copyright law, the ruling&amp;#039;s definition of value in cultural production, and of the cultural context within which the case occurs, this dissertation illustrates how scholars or rhetoric studying the public&amp;#039;s adoption and adaptation of specialized legal discourse might challenge inherent cultural biases through critical rhetorical praxis.","torrent":{"xt":"urn:btih:fe7ea980788bbf8ec8cb7082b4b032d6d4f6f206","amp;dn":"Jessica+Lee+Rayman+-+Rethoric%2C+Law%2C+and+the+Regulation+of+IP+on+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7ea980788bbf8ec8cb7082b4b032d6d4f6f206","infoHashBuffer":{"type":"Buffer","data":[254,126,169,128,120,139,191,142,200,203,112,130,180,176,50,214,212,246,242,6]},"announce":[],"urlList":[]}}