{"title":"BBC - Putin, Russia and the West 2. Democracy Threatens XviD AC3","uid":6987985,"size":734396416,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe8b7e42afb5bb6815895a5ad4de0c11d2cdd34c&amp;dn=BBC+-+Putin%2C+Russia+and+the+West+2.+Democracy+Threatens+XviD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos01","files":1,"time":1327628449,"description":"59:15\n\nDemocracy Threatens\n\n\nEpisode 2 of 4\n\nVladimir Putin, after eight years as president of Russia and four more as prime minister, is stubbornly holding on to power. He has announced his intention to return as president and declared his party the winner in parliamentary elections that are widely seen as fraudulent. In Moscow 100,000 protesters have taken to the streets in the largest demonstrations since Putin took office.\n\nPutin began his career as a KGB spy but when he became president, he made himself a valued ally of the West. How did he do it? And what made Washington and London turn against him?\n\nThe second episode includes an extraordinary interview with former Ukrainian president Leonid Kuchma, who was widely thought to be responsible for murder, corruption and sanctions-busting. He tells how, in the 2004 election, he set about getting his chosen successor elected president - with the help of Putin and his Kremlin advisers.\n\nThe opposition candidate, Victor Yushchenko, tells what it was like to be poisoned during the election campaign. It won him many voters and exit polls gave him a clear lead, but the Putin/Kuchma-backed candidate was still declared the winner. This result sparked the Orange Revolution.\n\nKremlin officials tell how they made sure that Putin would not face a similar revolution at home. It is claimed critics of Putin, including the British ambassador, were intimidated and some were even murdered. Tens of thousands of young Russians were mobilised to fight the threat of democracy.\n\nSource: BBC-HD\nHD-STBHDR TS file\n\n\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass MPEG) Vdubmod 700Mb\nACodec: AC3 2ch 192Kbps\n\nHD downsized/resized: 1440*1080 to 720*400\n\nFlawless encoding\n\nPls help seed to keep torrent alive!","torrent":{"xt":"urn:btih:fe8b7e42afb5bb6815895a5ad4de0c11d2cdd34c","amp;dn":"BBC+-+Putin%2C+Russia+and+the+West+2.+Democracy+Threatens+XviD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8b7e42afb5bb6815895a5ad4de0c11d2cdd34c","infoHashBuffer":{"type":"Buffer","data":[254,139,126,66,175,181,187,104,21,137,90,90,212,222,12,17,210,205,211,76]},"announce":[],"urlList":[]}}