{"title":"Swords.and.Sorcery.Underworld.Gold","uid":7771858,"size":126807873,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:febedde23363720f5de2bdcbfaa33a204d7fe2a8&amp;dn=Swords.and.Sorcery.Underworld.Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":1,"time":1351549222,"description":"Description:\n\nSwords and Sorcery - Underworld Gold is a kickback to the 80s dungeon crawler: 1st person, turn-based, step-based and party-based. Note that the Gold version is still undergoing the final stages of testing and should be released in the coming days.\n\nAbstract yet deeply tactical combat, with distance and timing management.\n\nSix classes: Knight, Paladin, Archer, Rogue, Priest and Sorcerer.\nFour races: Human, Elf, Dwarf and Gnome.\n\nCharacters will develop a variety of abilities and strengths that depend on these choices. Knights, for instance, learn Ambidextria, Powerhouse and Berserk as they earn higher levels.\n\n40 spells (Priest and Sorcerer, outdoor and indoor, combat and non-combat).\n\n100 illustrated enemies, many of which have one or two special abilities that offer varied challenges. Some, for instance will summon new enemies. Some will throw bombs, turn characters to stone or lock them in an inferno until the battle ends... If they survive that long...\n\n250 items, many with magical or otherwise valuable properties.\n\nThree towns to discover and travel back to for food, equipment, healing and other services offered by NPCs.\n\nMany unique NPCs that will offer quests, help your party gain in strength, guide you or deceive you.\n\nTraps, puzzles, slides and teleports add a variety of non-combat challenges. Puzzles are largely integrated in your interaction with the game world.\n\nDynamic world map illustrates 20 levels as they are discovered.\n\n40 fullscreen story illustrations.","torrent":{"xt":"urn:btih:febedde23363720f5de2bdcbfaa33a204d7fe2a8","amp;dn":"Swords.and.Sorcery.Underworld.Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febedde23363720f5de2bdcbfaa33a204d7fe2a8","infoHashBuffer":{"type":"Buffer","data":[254,190,221,226,51,99,114,15,93,226,189,203,250,163,58,32,77,127,226,168]},"announce":[],"urlList":[]}}