{"title":"Garmin Mapsource Metroguide North America v7 - No unlock needed","uid":3597263,"size":1363017479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ff1db9589c553e32bea42d349bf79d4e8765c7de&amp;dn=Garmin+Mapsource+Metroguide+North+America+v7+-+No+unlock+needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SunyJim","files":1,"time":1168980525,"description":"One 1.38Gb DVD ISO winrar\\&amp;#039;d as a single file\n\nI am still looking for the newest version of this Metroguide North America v8\nplease upload if you have it.\n\nUnfortunately the metroguide series is not-routable on the GPSr, but does contain the same data as the Navigator series. Despite the wording of the latest version v8 of the software on Garmin.com, The metroguide series DOES work quite well on the models of GPSr that are able to route.\n\n The problem with City Select and Navigator is that they require a serial number that not only matches the product but also your GPSr. So if you download it you might be able to get it working on your computer, but it will still be locked on the GPSr.\n\nAs always, no unlock codes are needed for my uploaded Garmin stuff. Enjoy!\n___________________________________________________________________________________\n\n\n    Garmin Mapsource Metroguide North America v7\n\n      Perfect for the urban jungle, MapSource MetroGuide North America v7 DVD includes detailed maps throughout the United States, Canada and Puerto Rico - and now with verified coverage for Alaska.\n\n      MetroGuide offers automatic route capability on the PC and is compatible with Garmin units that do not have automatic route calculation themselves. Best of all, this product is fully unlocked!\n\n      Version 7 features include:\n\n    * Full coverage maps throughout the U.S., Canada and Puerto Rico, including metropolitan and rural coverage\n    * Now with verified coverage for Alaska\n    * Detailed maps include highways, interstates, business and residential roads with attributes such as turn restrictions, speed categories and other navigation features\n    * Nearly 6 million points of interest such as:\n          o Food and drink\n          o Lodging\n          o Attractions\n          o Entertainment\n          o Shopping\n          o Emergency services\n          o Post offices\n          o Camp grounds\n          o Movie theaters and more \n    * Will automatically create point-to-point routes in MapSource on the PC\n    * Supplemental coverage of Hawaii provided using unverified governmental sources\n    * Trip and waypoint management feature lets you transfer waypoints, routes, and tracks between your Garmin GPS and your PC","torrent":{"xt":"urn:btih:ff1db9589c553e32bea42d349bf79d4e8765c7de","amp;dn":"Garmin+Mapsource+Metroguide+North+America+v7+-+No+unlock+needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1db9589c553e32bea42d349bf79d4e8765c7de","infoHashBuffer":{"type":"Buffer","data":[255,29,185,88,156,85,62,50,190,164,45,52,155,247,157,78,135,101,199,222]},"announce":[],"urlList":[]}}